[
  "Cohen, Y., Spatial-Multimedia-Compartmental Model (SMCM), National Center for Intermedia Transport Research (NCITR), UCLA (1991), Educational/Research Software.",
  "Cohen, Y. and Van de Water, Intermedia Transfer Factor Predictor (ITFP), Software package developed for the California Protection Agency (CalEPA), California Air Resources Board, Sacramento, Research Division, ARB-R-97/637, NTIS No. PB98-102700INZ (1997).",
  "Cohen, Y. and R. Vohra, Fish Bioaccumulation Factor (FIBAF), Software developed for CalEPA as companion to the ITFP software package, NTIS No. PB98-102700INZ (1997)",
  "Cohen, Y., Multimedia Environmental Distribution of Toxics: Mend-Tox, Multimedia Envirosoft Corporation, Los Angeles, CA (1998).",
  "Taimur Hassan, Rong Liu and Y. Cohen, “Web-Based High Throughput Data Analysis Tool (HDAT) for Nanoparticle Toxicity,” UCLA, CEIN (2011).",
  "Taimur Hassan, Haven Liu, Rong Liu and Y. Cohen, “A Web-Based Collaboratory for Nanoinformatics,” UCLA, CEIN (2011).",
  "Cohen, Y. and H. Liu, “Multimedia Environmental Distribution of Nanomaterials (Mend-Nano), UCLA, CEIN (2014).",
  "Cohen, Y., H. Liu, R. Liu and M. Bilal and P. Church, NanoDataBank – a web-based data management platform for NanoEHS (Data repository and management system for environmental health and safety associated with engineered nanomaterials: http://nanoinfo.org/nanodatabank/ (2016-2017).",
  "Cohen, Y., H. Liu, R. Liu and M. Bilal, http://www.Nanoinfo.org, Nanoinformatics platform for assessing the environmental impact of nanomaterials (includes web-based software/ simulators items (5) and (7), Life-cycle analysis of the environmental release of nanomaterials (LearNano), Bayesian Networks model for predictive toxicology of nanoparticles, and Environmental impact assessment (EIA).",
  "Cohen, Y., H. Liu, R. Liu and M. Bilal, NanoDataBank, Web-Based Data Management software for environmental impact assessment of nanomaterials",
  "Cohen, Y., \"High Yield Water-Soluble Polymer Silica Separation Resins,” U.S. Patent 5,035,803, July 30, 1991.",
  "Cohen, Y, “Ceramic-Supported Polymer Pervaporation Membrane,” U.S. Patent 6,440,309, August 27, 2002.",
  "Cohen, Y. and M. Uchymiak, “Method and System for Monitoring Reverse Osmosis Membranes,” U.S. Patent 7,910,004, (March 22, 2011)",
  "Cohen, Y., G. Lewis, M. Kim and N. Lin, “Fouling and Scaling Resistant Surface Nano-Structured Reverse Osmosis Membranes.” U.S. Patent 8,445, 076, 5/21/2013.",
  "Cohen Y. and G. Lewis, U.S-International Patents Pending, “Atmospheric Pressure Plasma Induced Graft Polymerization,” US Patent 9144824 B2 (Sep 29, 2015).",
  "Cohen, Y., P. D. Christofides, A. Rahardianto, A. R. Bartman, R. Zhu and H. Gu, and L. Gao “Integrated UF and RO Process and System,” U.S. Patent 9790113 B2, Oct 17, 2016",
  "Cohen, Y., A. Rahardianto and T. Lee,  System and Methods for Flexible Low-Energy Membrane-Based Liquid Purification, U.S. Patent 10569222, 2/25/2020 (priority 5/202016).",
  "Cohen Y., P. D. Christofides, H. Gu, L. X. Gao. And A. Rahardianto, “Self-adaptive Control and Optimization of Membrane Filtration,” US20170209834A1 (3/3/2020).",
  "Hoek, E., Y. Sungtaek, D. Jassby, and Y. Cohen, Y., Carbon-Negative Desalination With High-Value Materials Recovery, Provisional Patent, Appl No. 63537358, Sept 8, 2013.",
  "Cohen, Y. (Editor), Pollutants in a Multimedia Environment, Plenum Press (1986).",
  "Allen, D., I. R. Kaplan and Y. Cohen (Editors), Intermedia Pollutant Transport: Modeling and Field Measurements, Plenum Press, (1989).",
  "Cohen, Y., Guest Editor, Special Issue of the J. Hazardous Materials on “Intermedia Transport and Transformation of Chemical Pollutants,” (1994).",
  "Cohen, Y. and R. W. Peters, Novel Adsorbents and their Environmental Applications, AIChE Symposium Series, Volume 91, 1995, AIChE, New York, New York.",
  "Cohen, Y., Multimedia Environmental Assessment, Electronic Book published by Multimedia Envirosoft, Los Angeles, 1997.",
  "Nanoinformatics 2020 Roadmap, National Nanomanufacturing Network Amherst, MA 01003, April 2011; Y. Cohen is one of 29 contributors; DOI: 10.4053/rp001-110413http://eprints.internano.org/607/1/Roadmap_FINAL041311.pdf",
  "Cohen, Y. and J. Gilron, Co-Editors, Desalination, Special issue to mark the 45th Anniversary of launching Desalination journal and to honor Prof. David Hasson for his enormous support and contribution to Desalination, Vol. 273, Issue 1, pp. 1-234 (6/1/2011).",
  "Cohen, Y. and D. Hasson, Co-Editors, Desalination, \"Desalination, energy and the environment\" in honor of Professor Raphael Semiat, Volume 431, pp. 1-170 , April 2018.",
  "Gray, S., T. Tsuru, Y. Cohen, W.-J. Lau (Eds.), Advanced Materials for Membrane Fabrication and Modification\", Boca Raton, FL, CRC Press, Taylor & Francis, LLC, (2019).",
  "Cohen, Y., Advances in Water Desalination Technologies, World scientific Publishing Company, Y. Cohen (Editor), 652 pages. July 2021, https://doi.org/10.1142/12009.",
  "Cohen, Y., “Water Desalination: Current Status and New Technologies in Water Desalination,” The World Scientific Reference of Water Science, World scientific Publishing Company, Y. Cohen (Editor), 588 pages, in https://doi.org/10.1142/12514.",
  "Mackay, D., and Y. Cohen, \"Comments on the Role of Organic Microlayers in Modifying \tGas and Particulate Fluxes at Air-Water Interfaces,” J. Great Lakes Research, 1, supp. 1, \t111-112 (1976).",
  "Cohen, Y., W. Cocchio and D. Mackay, \"Laboratory Study of Liquid Phase Controlled Volatilization Rates in the Presence of Wind-Waves,” Environmental Science & Technology, 12, 553-558 (1978).",
  "Metzner, A. B., Y. Cohen and C. Rangel-Nafaile, \"Flows of Non-Newtonian Fluids:  Generation of Spatial Concentration Gradients,” J.Non-Newtonian Fluid Mechanics, 5, 449-469 (1979).",
  "Cohen, Y., D. Mackay and W. Y. Shiu, \"Mass Transfer Rates Between Oil Slicks and Water,” Canadian J. Chemical Engineering, 58, 569-575 (1980).",
  "Cohen, Y. and S. I. Sandler, \"The Viscosity and Thermal Conductivity of Simple Dense Gases,” Industrial Engineering Chemistry Fundamentals, 19, 186-188 (1980).",
  "Cohen, Y. and A. B. Metzner, \"Wall Effects in Laminar Flow of Fluids through Packed Beds,” AIChE. J., 27, 75 (1981).",
  "Cohen, Y. and A. B. Metzner, \"Slip Phenomena in Polymeric Solutions Flowing Through Packed Beds,” AIChE Symposium Series, No. 212, 78, 77 (1982).",
  "Cohen, Y. and A. B. Metzner, \"Adsorption Effects in the Flow of Polymer Solutions through Capillary Tubes,” Macromolecules, 15, 1425, (1982).",
  "Cohen Y., \"Mass Transfer Across Sheared Wavy Interfaces,” International J. Heat and Mass Transfer, 26, 1289 (1983).",
  "Cohen, Y. and C. Chen-Niang, \"The Flow of Microemulsions through Packed Beds and Capillary Tubes,” Chemical Engineering Communications, 28, 73 (1984).",
  "Cohen, Y., \"Adsorption and Slip Effects in the Flow of Polymer Solutions and Microemulsions through Porous Media,” in \"Advances in Rheology,” Volume 2, p. 299, Mena B., Garcia-Rejon and C. Rangel-Nafaile (Eds.), Universidad National Autonoma De Mexico (1984).",
  "Cohen, Y. and A. B. Metzner, \"Apparent Slip Flow of Polymer Solutions,” J. Rheology, 29, 67-102 (1985).",
  "Cohen, Y., \"The Effect of Polymer Adsorption on Particle Settling in Polymer Solutions,” R & D Note, AIChE. J., 31, 695 (1985).",
  "Cohen, Y. and P. A. Ryan, \"A Theoretical Analogy of Turbulent Mass Transfer Across Sheared Gas-Liquid Interfaces,” International Communications in Heat & Mass Transfer, 12, 139-148 (1985).",
  "Cohen, Y., \"A Comment on the Wall Effect in the Flow of Fluids through Packed Beds,” AIChE J., 31, 524 (1985).",
  "Cohen, Y. and P. A. Ryan, \"Multimedia Modeling of Environmental Transport: Trichloroethylene Test Case,” Environmental science & Technology, 19, 412 (1985).",
  "Cohen, Y. and P. A. Ryan, \"Multimedia Transport of Particle Bound Organics: Benzo(a)Pyrene Test Case,” Chemosphere, 15, 31-47 (1986).",
  "Cohen, Y., \"Organic Pollutant Transport,” Environmental Sci. & Technol., 20, 538 (1986).",
  "Cohen, Y., \"Intermedia Transport Modeling in Multimedia Systems,” in Pollutants in a Multimedia Environment, Cohen, Y. (Editor), Plenum Press (1986).",
  "Cohen, Y. and R. Christ, \"Hydrodynamic Adsorption of Macromolecules in Porous Media,” J. Reservoir Engineering SPE, p. 113-118, March (1986).",
  "Cohen, Y. and A. B. Metzner, \"A Theory of Apparent Slip Flow of Polymer Solutions,” Rheologica Acta, 25, 28-35 (1986).",
  "Cohen, Y. and A. B. Metzner, \"Diffusion of Macromolecules: A Constitutive Theory,\" Chemical Engineering Communications, 41, 73-99 (1986).",
  "Cohen, Y. and R. S. Parnas, \"The Flow of Power-Law Fluids through a Channel Bounded by Porous Media,” Chemical Engineering Communications, 53, 3 (1987).",
  "Cohen, Y., \"Modeling of Pollutant Transport and Accumulation in a Multimedia Environment,” in Geochemical and Hydrologic Processes and Their Protection, Draggan, S., J. J. Cohrssen, and R. E. Morrison (Eds), Praeger Pub. Company, New York (1987).",
  "Cohen, Y., \"Models of Multimedia Pollutant Transport,” in Multimedia Approaches to Pollution Control, National Academy Press, Washington, D.C. (1987).",
  "Cohen, Y., H. Taghavi, and P. A. Ryan, \"Contaminant Diffusion under Non-Isothermal Conditions in Nearly Dry Soils,” J. Environmental Quality, 17, 198 (1988).",
  "Cohen, Y., \"The Hydrodynamic Thickness of Adsorbed Polymers in Steady Shear Flow,” Macromolecules, 21, 494 (1988).",
  "Cohen, Y. \"Apparent Slip Flow of Polymer Solutions,” in Encyclopedia of Fluid Mechanics, Vol. 7, invited chapter, Chereminisinoff, N. P. (Ed), Gulf Publishing (1988).",
  "Parnas, R. S., M. Chaimberg, and V. Taepaisitphongse, and Y. Cohen, \"The Adsorption of Polyvinylpyrrolidone and Polyethylene oxide onto Chemically Modified Silica,\" J. Colloid & Interface Science., 129, 441-449 (1989).",
  "Chaimberg, M., R. S. Parnas and Y. Cohen, \"Graft Polymerization of Polyvinylpyrrolidone onto Silica,\" J. Applied Polymer Science, 37: 2921-2931 (1989).",
  "Parnas, R. S. and Y. Cohen, \"Brownian Dynamics of Freely-Jointed Chains: Chain Conformation with Excluded Volume Effects,” J. Chemical Physics, 90, 6680-6690 (1989).",
  "Cohen, Y., \"Intermedia and Multimedia Concepts in Environmental Monitoring,\" in Intermedia Pollutant Transport: Modeling and Field Measurements, Allen, D. T., I. R. Kaplan and Y. Cohen (eds.), Plenum Press, (1989).",
  "Ryan, A. P. and Y. Cohen, \"Chemical Transport in the Topsoil Zone -- The Role of Moisture and Temperature Gradients,” J. Hazardous Materials, 22, 283-304 (1989).",
  "Ryan, P. A. and Y. Cohen, \"Multiphase Chemical Transport in Soils,” in Intermedia Pollutant Transport: Modeling and Field Measurements, D. T. Allen, I. R. Kaplan and Y. Cohen (eds.), Plenum Press, (1989).",
  "Cohen, Y. and P. A. Ryan, \"Diffusion of Sorbed Solutes in Gas and Water Phases of Low-Moisture Soils,” J. Soil Science Society of America, 54, 341-346 (1990).",
  "Sakugawa, H., W-T. Tsai, I. R. Kaplan and Y. Cohen, \"Factors Controlling the Photochemical Generation of Gaseous H2O2 in the Los Angeles Atmosphere,\" Geophysical Research Letters, 17, 93 (1990).",
  "Sakugawa, H., W-T. Tsai, I. R. Kaplan and Y. Cohen, \"Historic Trend of the Levels of Atmospheric H2O2 During 1960s-1980s in Los Angeles,\" Geophysical Research Letters, 17, 937-940 (1990).",
  "Sakugawa, H., W.-T Tsai, I. R. Kaplan and Y. Cohen,\" Atmospheric Hydrogen Peroxide,\" Environmental Science & Technology, (Feature Article), 24, 1442 (1990).",
  "Cohen, Y., W-T. Tsai, and S. Chetty, \"Partitioning of Pollutants in the Multimedia Environment: The SMCM Software,\" CACHE News, No. 30, 18-26 (1990).",
  "Cohen, Y., W-T., Tsai, S. Chetty and G. J. Mayer, \"Dynamic Partitioning of Organic Chemicals in Local Environments: A Multimedia Screening Level Modeling Approach,\" Environmental Science &Technology, 24, 1549 (1990).",
  "Cohen, Y., W. Tsai and S. Chetty, \"A Course on Multimedia Environmental Transport, Exposure and Risk Assessment,\" Chemical Eng. Education, pages 212-219, Fall 1990.",
  "Onishi, Y., L. Shulyer and Y. Cohen, \"Multimedia Modeling of Toxic Chemicals,\" in Proceedings of the International Symposium on Water Quality Modeling of Agricultural and Non-Point Sources, Part II, Donn G. DeCoursey (Editor), 479-509 (1990). Published by the United States Department of Agriculture, ARS-81.",
  "Tsai, W-T., Y. Cohen, H. Sakugawa and I. R. Kaplan, \"Hydrogen Peroxide and Ozone Levels in Los Angeles: A Screening-Level Evaluation,\" Atmospheric Environment, 25, 67-78 (1991).",
  "Chaimberg, M. and Y. Cohen, \"Kinetics of Free-Radical Polymerization: A Conservational Polymerization and Molecular Weight Distribution Model,\" Industrial and Engineering Chemistry Research, 28, 1152 (1990).",
  "Chaimberg, M. and Y. Cohen, \"Silylation of Inorganic Oxide Supports,\" J. Colloid & Interface Science, 134, 576-579 (1990).",
  "Cohen, Y. and T. E. Browne, \"Aqueous Phase Adsorption of Trichloroethylene and Chloroform by Polymeric Resins and Activated Carbon,\" Industrial and Engineering Chemistry Research, 29, 1338-1345 (1990).",
  "Parnas, R. S. and Y. Cohen, \"The Response of a Terminally Anchored Polymer Chain to Simple Shear Flows,\" Macromolecules, 24, 4646-4656 (1991).",
  "Chaimberg, M. and Y. Cohen, \"Free-Radical Graft Polymerization of Vinyl Pyrrolidone onto Silica,\" Industrial and Engineering Chemistry Research, 30, 2534-2542 (1991).",
  "Ryan, P. A. and Y. Cohen, \"One-Dimensional Immiscible Phase Transport of NAPL (Non-Aqueous Phase Liquids) Containing Sparingly Water Soluble Organics in the Unsaturated Soil Zone: A Front Tracking Model,\" Water Research, 27, 1487-1500 (1991).",
  "Tsai, W., Y. Cohen, H. Sakugawa and I. R. Kaplan, \"Dynamic Partitioning of Semi-Volatile Organics in Gas/Particle/Water Phases During Rain Scavenging,\" Environmental Science & Technology, 25, 2012-2023 (1991).",
  "Cohen, Y. and D. T. Allen, \"An Integrated Approach to Pollution Prevention Research,\" J. Hazardous Materials, 29, 237-253 (1992).",
  "Seigneur, S., A. Venkatram, D. Galya, P. Anderson, D. Liu, D. Foliart, R. von Burg, Y. Cohen, T. Permutt, and L. Levin, \"Review of Mathematical Models for Health Risk Assessment. I. Overview,\" Environmental Software, 7, 3-7 (1992).",
  "Cohen, Y. and P. Eisenberg, \"Poly(vinylpyrrolidone)-Grafted Silica Resin: A New Promising Material for SEC of Water-Soluble Polymers,\" pp. 254-268, in Polyelectrolyte Gels: Properties, Preparation, and Applications, Harland, R. S. and R. K. Prud'homme, ACS Symposium Series 480, American Chemical Society, Washington, DC (1992).",
  "Browne, Tom, M. Chaimberg and Y. Cohen, \"Graft Polymerization of Vinyl Acetate onto Silica,\" J. Applied Polymer Science, 44, 671-677 (1992).",
  "Eisenberg, P., M. Chaimberg and Y. Cohen, \"Permeability of Graft Polymerized Poly(vinylpyrrolidone)-Silica Resin in Packed Columns,\" J. Colloid and Interface Science, 148, 580-586 (1992).",
  "Browne, T. and Y. Cohen, \"Polymer-Grafted Silica: A Screening System for Polymeric Adsorption Resin Development,\" Ind. and Eng. Chem. Res., 32, 716-725 (1993).",
  "Gusler, M. G., T. Browne and Y. Cohen, \"Sorption of Organics from Aqueous Solution onto Polymeric Resins,\" Ind. & Eng. Chem. Res., 32, 2727-2735 (1993).",
  "Castro, R. P., H. G. Monbouquette, and Y. Cohen and R. Castro, \"The Permeability of Surface Modified Porous Silica Membranes,\" J. Membrane Science, 84, 151-160 (1993).",
  "Creelman, L. W., Pesinova, V., Cohen Y. and Winer, A. M., “Development of Intermedia Transfer Factors for Hexavalent Chromium,” Proc. Annual Meeting. Air & Waste Manag. Assoc., 86th, 93RA116A.03, 20pp. (1993).",
  "Cohen, Y. \"Partitioning of Organic Pollutants in the Environment,\" pages 278-295, in Managing Hazardous Air Pollutants, Chow, W. and K. K. Connor (Eds.) Lewis Publishers, Ann Arbor, MI (1993).",
  "Tsai, W-T. and Y. Cohen, \"Rain Scavenging of Toxic Air Pollutants: The Rain Scavenging Ratio and Research Needs,\" pages 494-501, in Managing Hazardous Air Pollutants, Chow, W. and K. K. Connor (Eds.) Lewis Publishers, Ann Arbor, MI (1993).",
  "Grifoll, J. and Y. Cohen, \"Chemical Volatilization from the Soil Matrix: Transport through the Air and Water Phases,\" J. Hazardous Materials, 37, 445-457 (1994).",
  "Cohen, Y. and R. E. Clay, \"Multimedia Partitioning of Particle-Bound Organics,\" J. Hazardous Materials, 37, 507-526 (1994).",
  "Creelman. L. W., V. Pesinova, Y. Cohen Y. and A. M. Winer, \"Intermedia Transfer Factors for Modeling the Environmental Impact from Industrial Sources,\" J. Hazardous Materials, 37, N1:15-25 (1994).",
  "Cohen, Y., \"Intermedia Transport of Chemical Pollutants,\" (Editorial), J. Hazardous Materials, 37, R3, editorial (1994).",
  "Cohen, Y., \"The Valdez Air Health Study,\" Risk Analysis, 14, 887-889 (1994).",
  "Cohen, Y. and R. B. Van de Water, \"Environmental Distribution of Organics,\" 267-278, in Computer Techniques in Environmental Studies V. Vol. I: Pollution Modeling, P. Zannetti (Ed.), Computational Mechanics Publications, Southampton, UK (1994).",
  "Gusler, G. M. and Y. Cohen, \"Swelling Equilibrium of Highly Crosslinked Polymeric Resins,\" Ind. and  Eng.Chem. Res., 33, 2345-2357 (1994).",
  "Chaimberg, M. and Y. Cohen, \"The Kinetics of Graft Polymerization onto Silica Substrates,\" AIChE J., 40, 294-311 (1994).",
  "Parnas, R. S. and Y. Cohen, \"A Terminally Anchored Polymer Chain in Laminar Shear Flow: Hydrodynamic Interactions,\" Rheologica Acta, 33, 485-505 (1994).",
  "Cohen, Y. and J. Klein, “Removal of Organics from Aqueous Systems,” in Novel Adsorbents and Their Environmental Applications, AIChE Symposium Series, 91, 72-78 (1995).",
  "Stein, Eric, A. M. Winer and Y. Cohen, \"Mercury in the Environment,” Critical Reviews in Environmental Science, 26, 1-43 (1995).",
  "Cohen, Y., \"Volatile Organic Compounds in the Environment: A Multimedia Perspective,\" in Volatile Organic Compounds in the Environment, ASTM STP 1261, Wang, W., J. Schnoor and J. Doi (Eds.), American Society for Testing and Materials, pp. 7-32 (1996).",
  "Grifoll, J. and Y. Cohen, \"Contaminant Migration in the Unsaturated Soil Zone: The Effect of Rainfall and Evapotranspiration,\" J. Contaminant Hydrology, 23, 185-211 (1996).",
  "Font, J., R. P. Castro and Y. Cohen, \"On the Loss of Hydraulic Permeability in Ceramic Membranes,\" J. Colloid & Interface Science, 181, 347-350 (1996).",
  "Cohen, Y. and F. Giralt, \"Strategies for Pollution Prevention: Waste Minimization and Source Reduction,” Afinidad: Revisita de Química Teórica y Aplicada, Afinidad LII, 462, 80-92 (1996).",
  "Castro, R. P., H. G. Monbouquette and Y. Cohen, \"Poly(vinyl pyrrolidone)-Silica Membranes for the Treatment of Oil-in-Water Emulsions,” J. Membrane Science, 115, 179-187 (1996).",
  "Faibish R., Menachem Elimelech and Y. Cohen, \"Effect of Intraparticle Electrostatic Double Layer Interactions on Permeate Flux Decline in Crossflow Membrane Filtration of Colloidal Suspensions: An Experimental Investigation,” J. Colloid and Interface Science, 204, 77-86 (1998).",
  "Cohen, Y. Polymeric Resins for VOC Removal from Aqueous Systems, in “Volatile Organic Compounds (VOC) Recovery Seminar,” EPA/625/R-99/005, ORD, EPA National Risk Management Research Laboratory, Sept 16-17, 1998.",
  "Cooter, E. J., Y. Cohen and J. B. Hill, “Application of hybrid compartmental model to the Neuse River Basin of North Carolina,” in Measurements of Toxics and Related Air Pollutants,” Volume II, Air and Waste Management Association and USEPA, September 1-3, 1998, Cary North Carolina.",
  "Grifoll, Y. and Y. Cohen, \"Front Tracking Algorithm for Liquid Infiltration into Dry Soils,” Water Resources Research, 35, 2579-2585 (1999).",
  "Cuesta, I., F. Giralt, X. Grau and Y. Cohen, “Air-Water Mass Transfer of Organics from Shallow Ponds Under Laminar Recirculation” In. Journal of Heat and Mass Transfer, 42, 165-179 (1999).",
  "Creelman, L., A. Winer and Y. Cohen, \"Chromium in the Environment,” D. E. Kimbrough, Y. Cohen, A. M. Winer, L. Creelman and C. Mabuni, Critical Reviews in Environmental Science and Technology, 29, 1-46 (1999).",
  "Cooter, E., J. B. Hill and Y. Cohen, “Impact of secular precipitation changes on the deposition of benzo(a)pyrene to the Neuse River Basin of North Carolina,” American Meteorological Society, Proceedings of the 11th Conference on Applied Climatology, January 10-15, 1999, Dallas, Texas.",
  "Jou, Jeng-Dung, W. Yoshida and Y. Cohen, \"Pervaporation with Ceramic-Supported Polymer Membranes,” J. Membrane Science, 162, 269-284 (1999).",
  "Cohen, Y., R. Faibish and M. Rovira, Size Exclusion Chromatography with Graft Polymerized Silica Resins, in Surface Interactions in Size Exclusion Chromatography, E. Pefferkorn (Editor) Marcel Dekker, (1999)",
  "Castro, Robert P., H. G. Monbouquette, Y. Cohen, “Shear-induced permeability changes in a polymer grafted silica membrane,” J. Membrane Science, 179, 207-220 (2000).",
  "Faibish, Ron and Y. Cohen, “Fouling-Resistant Ceramic-Supported Polymer Membranes for Ultrafiltration of Oil-in-Water Microemulsions,” J.Memb.Sci., 185, 129-143 (2001).",
  "Espinosa, G., D. Yaffe, Y. Cohen, A. Arenas and F. Giralt, “Neural Network Based Quantitative Structural Property Relations (QSPRs) for Predicting Boiling Points of Aliphatic Hydrocarbons, J.Chem.Information & Computer Sci., V40(N3):859-879 (2000).",
  "Cohen, Y., “The Air Toxics Problem,” in “Southern California Environmental Report card” 2000, R. Berk and A. M. Winer (Eds), Institute of the Environment, University of California, Los Angeles (2000).",
  "Cohen, Y., J. Glater, A. Tsao and R-W Lee, “Nanofiltration Membranes for Agricultural Drainage Water Reclamation,” in Proceedings of the International Conference on Membrane Technology for Wastewater Reclamation and Reuse, September 9-13, Tel-Aviv, Israel, 2001, Gideon Oron and Amos Bick (Editors), Published by Ben-Gurion University.",
  "Montserrat Rovira-Bru, F. Giralt and Y. Cohen, “Protein Adsorption onto Zirconia Modified with Terminally Grafted Poly(vinylpyrrolidone),” J. Colloid and Interface Science, 235, 70-79 (2001).",
  "Denise, Yaffe and Y. Cohen, “Neural Network Based Temperature-dependent Quantitative Structure Property Relations (QSPRs) for Predicting Vapor Pressure of Hydrocarbons,” J. Chemical Information & Computer Science, 41, 463-477 (2001).",
  "Yaffe, D., Y. Cohen, J. Arey and A. J. Grosovsky, “Multimedia Analysis of PAHs and Nitro-PAH Daughter Products in the Los Angeles Basin,” Risk Anal., 21, 275-294 (2001).",
  "Cohen, Y., W. Yoshida, V. Nguyen, N. Bei and J-D Jou, “Surface Modification of Oxide Surfaces by Graft Polymerization,” in Oxide Surfaces, J. A. Wingrave (editor), Marcel Dekker, New York (2001).",
  "Espinosa, Gabriela, Denise Yaffe, Alex Arenas, Yoram Cohen and Francesc Giralt, \"A Fuzzy ARTMAP based Quantitative Structure-Property Relationships (QSPRs) for predicting Physical Properties of Organic Compounds,” Industrial and Engineering Chemistry, 40, 2757-2766 (2001).",
  "Yaffe, D., G, Espinosa, A. Arenas, F. Giralt and Y. Cohen, “A Fuzzy ARTMAP Based on Quantitative Structure-Property Relationships (QSPRs) for Predicting Aqueous Solubility of Organic Compounds,” J. Chemical Information & Computer Sci., 41, 1177-1207 (2001).",
  "Yoshida, W, Castro, R. P., Jou, J. D. and Cohen, Y., “Multilayer alkoxysilane silylation of oxide surfaces,” Langmuir, 17, 5882-5888 (2001).",
  "Faibish, R. and Y. Cohen, “Fouling and Rejection Behavior of Ceramic and Polymer-Modified Ceramic Membranes for Ultrafiltration of Oil-in-Water Emulsions and Microemulsions,” Colloids and Interfaces, 191, 27-40 (2001).",
  "Grifoll, J., Y. Cohen, “Simulació numèrica de la migració de contaminants en la zona no saturada del sòl” Dossiers Agraris, 7, 109-119 (2001).",
  "Cooter, E. J., and Y. Cohen, \"Model Evaluation of Dry-Deposition to Vegetation for Volatile and Semi-Volatile Organic Compounds in a Multimedia Environment,” Water, Air, and Soil Pollution: Focus, 1, 285-294 (2001).",
  "Cohen, Y. and E. J. Cooter, \"Multimedia Environmental Distribution of Toxics (Mend-Tox). I: Hybrid Compartmental-Spatial Modeling Framework,\" Practice Periodicals of Hazardous, Toxic and Radioactive Waste Management, 6, 70-86 (2002).",
  "Cohen, Y. and E. J. Cooter, \"Multimedia Environmental Distribution of Toxics (Mend-Tox). II: Software Implementation and Case Studies,\" Practice Periodicals of Hazardous, Toxic and Radioactive Waste Management, 6, 87-101 (2002).",
  "Williams, M., Evangelista, R., and Cohen Y. (2002) \"Non-thermal Process for Recovering Reverse Osmosis Concentrate: Process Chemistry and Kinetics\" In Proceedings of the 2002 AWWA Water Quality Technology Conference. Seattle, WA.",
  "Yaffe, D., Y. Cohen, G. Espinosa, A. Arenas and F. Giralt, \"Fuzzy ARTMAP and Back-Propagation Neural Networks Based Quantitative-Structure-Property Relationships (QSPRs) for Octanol-Water Partition Coefficient of Organic Compounds,” J. Chemical Information & Computer Sciences, 42, 162-183 (2002).",
  "Nguyen, V., W. Yoshida, J-D. Jou and Y. Cohen, \"Kinetics of Free-Radical Graft Polymerization of 1-vinyl-2-pyrrolidone onto Silica,\" J. Polymer Science Part A: Polymer Chemistry, Volume 40, Number 1, 26-42 (2002).",
  "Faibish, R. S., W. H. Yoshida and Y. Cohen, \"Contact Angle Study of Polymer Grafted Silicon Wafers,” J. Colloid and Interface Science, 256, 341-350 (2002).",
  "Nguyen, V., W. Yoshida and Y. Cohen, \"Graft Polymerization of Vinyl Acetate onto Silica,” J. Applied Polymer Science, 87, 300-310 (2003).",
  "Grifoll, J., J. Ma. Gastó and Y. Cohen, “Efficient Estimation of Internodal Permeabilities for Numerical Simulation of Unsaturated Flows,” Water Resources Research, 38, 1326-1335 (2002).",
  "Yaffe, D., G, Espinosa, A. Arenas, F. Giralt and Y. Cohen, “Back Propagation and Fuzzy ARTMAP Neural Network Based Quantitative Structural Property Relations (QSPRs) for Prediction of Henry’s Laws of Organic Compounds,” J. Chemical Information & Computer Sciences, 43, 85-112 (2003).",
  "Yoshida, H. W and Y. Cohen, “Ceramic Supported Polymer Membranes for Pervaporation of Binary Organic-Organic Mixtures,” J. Membrane Science, 213, 145-157 (2003).",
  "Lee, Ron-Wai, J. Glater and Y. Cohen, “Low Pressure RO Desalination of Agricultural Drainage Water,” Desalination, 155, 109-120 (2003).",
  "Wayne, H, Y and Y. Cohen, “Topological AFM Characterization of Graft Polymerized Silica Membranes,” J. Membrane Science, 215, 249-264 (2003).",
  "Yoshida, W. and Y. Cohen, \"Removal of Methyl Tert-butyl Ether from Water by Pervaporation using Ceramic-Supported Polymer Membranes,\" J. Membrane Science, 229, 27–32 (2004).",
  "Francesc Giralt, G. Espinosa, A. Arenas, J. Ferre-Gine, L. Amat, X. Gironés, R. Carbó-Dorca and Y. Cohen, “Prediction of Activity Coefficients of Diverse Organic Compounds in Water at Infinite Dilution with an Integrated SOM-fuzzy ARTMAP Neural System,” AIChE J., 50, 1315-1343 (2004).",
  "Wen-Yi Shih, K. Albrecht, J. Glater and Y. Cohen, “A Dual Probe Approach for Evaluation of Gypsum Crystallization in Response to Antiscalant Treatment,” Desalination, 169, 213-221 (2004).",
  "Gabelich, C. J., F. W. Gerringer, J. C. Franklin, J. Gao, Y. Cohen, and I. H. Suffet, Reverse Osmosis Pretreatment: Challenges with Conventional Treatment, p1-15, in Proceedings of the 2004 AWWA ACE Meeting, Orlando, Florida.",
  "Villaluenga, J. P.G. and Y. Cohen, “Numerical Model of Non-Isothermal Pervaporation in a Rectangular Channel,” J. Membrane Science, 260, 119-130 (2005).",
  "Shih, W-Y, A. Rahardianto, R-W. Lee and Y. Cohen \"Morphometric Characterization of Calcium Sulfate Dihydrate (Gypsum) Scale on Reverse Osmosis Membranes,\" J. Membrane Science, 252, 253-263 (2005).",
  "Grifoll, J., J. M. Gastó and Y. Cohen, “Non-Isothermal Soil Water Transport and Evaporation,” Advances in Water Resources, 28, 1254-1266 (2005).",
  "Katner A. and Y. Cohen, “Exposure Assessment Involving an Aerospace Facility with Limited Monitoring Data,” p 626-632, in Proceedings of Environmental Science and Technology (2005), Volume 1, Edited by William G. Lyon, Jihua Hong and Ramesh K. Reddy, American Science Press, New Orleans, USA. First International Conference on Environmental Science and Technology, held January 23-26, 2005, in New Orleans, Louisiana, USA; ISBN 0-9768853-4-4].",
  "Shih, W-Y, J. Gao, A. Rahardianto, J. Glater, Y. Cohen and C. J. Gabelich, \"Ranking of antiscalant performance for gypsum scale suppression in the presence of residual aluminum,\" Desalination, 196, 280–292 (2006).",
  "Anditya Rahardianto, Wen-Yi Shih, Ron-Wai Lee and Yoram Cohen, \"Diagnostic characterization of gypsum scale formation and control in RO membrane desalination of brackish water,\" J. Membrane Science, 279, 655-668 (2006).",
  "Gabelich, C.J., J. C. Franklin, Y. Cohen and I. H. Suffet, “Reverse Osmosis Pretreatment: Challenges with Conventional Treatment,” Chapter in Membrane Treatment for Drinking Water & Reuse Applications: A Compendium of Peer-Reviewed Papers, K. J. Howe (Editor), American Water Works Association, Denver, CO (2006).",
  "Rahardianto, A., J. Gao, C. J. Gabelich, M. D. Williams and Y. Cohen, “High recovery membrane desalting of low-salinity brackish water: Integration of accelerated precipitation softening with membrane RO,” J. Membrane Science, 289 (2007) 123–137.",
  "Uchymiak, M., A. Rahardianto, E. Lyster, J. Glater, and Y., Cohen, “A Novel RO Ex-Situ Scale Observation Detector (EXSOD) for Mineral Scale Characterization and Early Detection,” J. Membrane Science, 291, 86–95 (2007).",
  "Gabelich, C. J., T. I. Yun, M. D. Williams, T. Knoll, W. Pearce, U. Daniel, Y. Cohen, E. M. V. Hoek, M. R. Matsumoto, L. Sangines-Uriate, P. John, R. Scherzinger and A. A. Mofidi, “Applied Research for Large-Scale Desalting Applications: The Desalination Research and Innovation Partnership,” Chapter in Desalination of Seawater and Brackish Water”, William C. Lauer (Ed), American Water Works Association (2006).",
  "Katner, A. and Y. Cohen, “Improvement of Risk Assessments for Multicontaminant Sites in the Face of Critical Data Gaps,” Chapter in textbook Risk Assessment in Environmental Health, Editors: M. G. Robson, W. A. Toscano, G. Robson, J. Wiley & Sons, ASPH ISBN: 0-7879-8319-5 Hardcover 656 pages February 2007.",
  "Lewis, G., G. Nowling, R. H. Hicks and Y. Cohen, \"Inorganic Surface Nanostructuring by Atm. Pressure Plasma-Induced Graft Polymerization.” Langmuir, 23, 10756-10764 (2007).",
  "Lyster, E and Y. Cohen, “Numerical study of concentration polarization in a rectangular reverse osmosis membrane channel: Permeate flux variation and hydrodynamic end effects,” J. Membrane Science, 303, 140-153 (2007).",
  "Gabelich, C. J., M. D. Williams, A. Rahardianto, J. C. Franklin and Y. Cohen, “High-recovery reverse osmosis desalination using intermediate chemical demineralization,” J. Membrane Science, 301, 131-141 (2007).",
  "Lewis, G. T., V. Nguyen and Y. Cohen, Synthesis of Poly(4-vinylpyridine) by Reverse Atom Transfer Radical Polymerization, J.Polymer Sci.Part A: Polymer Chemistry, 45, 5748-5758 (2007).",
  "McFall, C., P. D. Christofides, Y. Cohen and J. F. Davis, \"Fault-Tolerant Control of a Reverse-Osmosis Desalination Process, ''Proceedings of 8th IFAC Symposium on Dynamics and Control of Process Systems - Volume 3, 163-168, Cancun, Mexico, 2007.",
  "Libotean, D. M., J. Giralt, R. Rallo, Y. Cohen, F. Giralt, H. F. Ridgway, G. Rodriguez, and D. Phipps, “Organic Compounds Passage through RO Membranes,” J. Membrane sci., 313, 23-43 (2008).",
  "Uchymiak, M, E. Lyster and Y. Cohen, “Kinetics of Gypsum Crystals Growth on Reverse Osmosis Membranes by Direct Visual Observations,” J. Memb. Sci., 314, 163-172 (2008).",
  "Zach-Maor, A., R. Semiat, A. Rahardianto, Y. Cohen, S. Wilson, and S.R. Gray, “Diagnostic analysis of the technical feasibility of RO desalting of treated wastewater,”   Desalination, 230, 239-247 (2008).",
  "Rahardianto, A, B. McCool and Y. Cohen,” Reverse Osmosis Desalting of Inland Brackish Water of High Gypsum Scaling Propensity: Kinetics and Mitigation of Membrane Mineral Scaling,” Env. Sci. Technol. 42, 4292-4297 (2008).",
  "Lewis, G. T. and Y. Cohen, “Controlled Nitroxide-Mediated Styrene Surface Graft Polymerization with Atmospheric Plasma Surface Activation,” Langmuir, 24, 13102-13112 (2008).",
  "McFall, C., A. Bartman P. D. Christofides and Y. Cohen, \"Control of Reverse Osmosis Desalination at High Recovery,'' Proceedings of the American Control Conference, 2241-2247, Seattle, Washington, 2008.",
  "McFall, C., A. Bartman, P. D. Christofides and Y. Cohen, \"Control and Monitoring of a High-Recovery Reverse-Osmosis Desalination Process,'' Ind. & Eng. Chem. Res., 47, 6698-6710 (2008).",
  "Cohen, Y., “Graywater – A Potential Source of Water,” Southern California Environmental Report Card, UCLA Institute of the Environment and Sustainability, Editor: Arthur M. Winer, Fall 2009.",
  "Libotean, D., J. Giralt, F. Giralt, R. Rallo, T. Wolfe, and Y. Cohen, “Neural Network Approach for Modeling the Performance of Reverse Osmosis Membrane Desalting Plants,” J. Membrane Sci., 326, 408-419 (2009).",
  "Bartman, A. R., C. W. McFall, P. D. Christofides, and Y. Cohen “Model-predictive control of feed flow reversal in a reverse osmosis desalination process,” J. Process Control, 19, 433-442 (2009).",
  "Zhu, A., P. D. Christofides and Y. Cohen, “Effect of Thermodynamic Restriction on Energy Cost Optimization of RO Membrane Water Desalination,” Industrial and Engineering Chemistry Research, 48, 6010-6021 (2009).",
  "Kim, M., J. Au, A. Rahardianto, J. Glater, Y. Cohen, F. W. Gerringer and C. J. Gabelich, “Impact of Conventional Water Treatment Coagulants on Mineral Scaling in RO Desalting of Brackish Water,” Industrial & Eng. Chem. Res., 48, 3126-3135 (2009).",
  "Lyster, E., J. Au, R. Rallo, F. Giralt and Y. Cohen, \"Coupled 3-D hydrodynamics and mass transfer analysis of mineral scaling-induced flux decline in a laboratory plate-and-frame reverse osmosis membrane module,\" J. Membrane science, 339, 39-48 (2009).",
  "Lewis, G., V. Nguyen, W. Shih and Y. Cohen, “Reverse atom transfer radical graft polymerization of 4-vinylpyridine onto inorganic oxide surfaces,” J. Applied Polymer Science, 113, 437-449 (2009).",
  "Hilary A. Godwin, Kabir Chopra, Kenneth A. Bradley, Yoram Cohen, Barbara Herr Harthorn, Eric M.V. Hoek, Patricia Holden, Arturo A. Keller, Hunter Lenihan, Roger M. Nisbet, and Andre E. Nel, The University of California Center for the Environmental Implications of Nanotechnology,” Env.Sci. & Technol., 43, 6453-6457 (2009).",
  "Zhu, R. P. Christofides and Y. Cohen, “Minimization of energy consumption for a two-pass membrane desalination: Effect of energy recovery, membrane rejection and retentate recycling,\" J. Membrane Science, 399, 126-137 (2009).",
  "Zhu, R. P. Christofides and Y. Cohen, \"On RO Membrane and Energy Costs and Associated Incentives for Future Enhancements of Membrane Permeability,\" J. Membrane Sci., 344, 15, 1-5 (2009); ibid, Corrigendum - 346 (2009) 361.",
  "Uchymiak, M., A. R. Bartman, N. Daltrophe, M. Weissman, J. Gilron, P. D. Christofides, W. J. Kaiser and Y. Cohen, “Brackish Water reverse osmosis (BWRO) Operation in Feed Flow Reversal Mode using an Ex-Situ Scale Observation Detector,” J. Membrane Science, 341, 60-66 (2009).",
  "Bartman, A. R., P. D. Christofides, and Y. Cohen, \"Nonlinear Model-Based Control of an Experimental Reverse-Osmosis Water Desalination System,\" Ind. Eng. Chem Res., 48, 6126-6136 (2009).",
  "Zhu, A., P. D. Christofides, and Y. Cohen, \"Energy Consumption Optimization of Reverse Osmosis Membrane Water Desalination Subject to Feed Salinity Fluctuation,\" Ind. Eng. Chem Res, 48, 9581–9589(2009).",
  "Gabelich, Christopher J. P. Xu, Y. Cohen, “Concentrate Treatment in Inland Desalting,” in Sustainable Water for the Future: Water Recycling versus Desalination. Vol 2, Eds. I. Escobar and A. Schafer, Elsevier, Amsterdam, The Netherlands, 1st Edition, 2010.",
  "Kim, M., H. N. Lin, G. T. Lewis, and Y. Cohen, “Surface Nano-Structuring of Reverse Osmosis Membranes via Atmospheric Pressure Plasma-Induced Graft Polymerization for Reduction of Mineral Scaling Propensity,” J. Membrane Science, 354, 142-149 (2010).",
  "Lin, N. H., M Kim, G. T. Lewis, and Y. Cohen, \"Polymer Surface Nano-Structuring of Reverse Osmosis Membranes for Fouling Resistance and Improved Flux Performance,\" J. Materials Chemistry, 20, 4642–4652 (2010).",
  "Zhu, A., A. Rahardianto, P. D. Christofides and Y. Cohen, \"Reverse Osmosis Desalination with High Permeability Membranes - Cost Optimization and Research Needs,\" Desalination and Water Treatment, 15, 256-266 (2010).",
  "Cohen, Y. and J. Glater, \"A Tribute to Sidney Loeb - The Pioneer of Reverse Osmosis Desalination Research,\" Desalination and Water Treatment, 15, 222-227 (2010).",
  "McCool, B.C., A. Rahardianto, J. Faria, K. Kovac, D. Lara, Y. Cohen, “Feasibility of Reverse Osmosis Desalination of Brackish Agricultural Drainage Water in the San Joaquin Valley, Desalination, 261, 240-250 (2010).",
  "E. Lyster, M.M. Kim, J. Au, Y. Cohen, “A Method for Evaluating Antiscalant Retardation of Crystal Nucleation and Growth on RO Membranes,” J. Membrane Science., 364, 122-131 (2010).",
  "Zhu, A.H., P.D. Christofides, Y. Cohen, Effect of Stream Mixing on RO Energy Cost Minimization, Desalination, 261, 232-239 (2010).",
  "Lin, N.H., W.-Y. Shih, E. Lyster, Y. Cohen, “Crystallization of Calcium Sulfate on Polymeric Surfaces,” J. Colloid Interf. Sci, 356, 790-797 (2010).",
  "Rahardianto, A., B.C. McCool, Y. Cohen, “Accelerated Desupersaturation of Reverse Osmosis Concentrate by Chemically-Enhanced Seeded Precipitation,” Desalination, 264, 256-267 (2010).",
  "Bartman, A. R., A. Zhu, P. D. Christofides, Y. Cohen, “Minimizing Energy Consumption in Reverse Osmosis Membrane Desalination using Optimization-Based Control,” American Control Conference, Pages: 3629-3635, June 30-July 2, 2010, Baltimore MD.",
  "Surawanvijit, S., M. Kim, Y. Cohen, “Analysis of Membrane Filtration Efficiency in Removal of Metal Oxide Nanoparticles from Aqueous Nanoparticle Suspension in the Presence of Coagulation Pretreatment,” NanoTech 2010, Vol. 3, 591-593, Chapter 9, in Nanotechnology 2010: Biosensors, Instruments, Medical, Environment and Energy, NSTI, ISBN 978-1-4398-3415-2",
  "Bartman, A.R., A.H. Zhu, P.D. Christofides, Y. Cohen, “Minimizing Energy Consumption in Reverse Osmosis Membrane Desalination using Optimization-Based Control,” J. Process Control, 20, 1261-1269 (2010).",
  "Liu, H., S. Surawanvijit, R. Rallo, G. Orkoulas and Y. Cohen, “Modeling aggregation and size distribution of nanoparticles with Monte Carlo simulation,” NanoTech 2010, Vol. 3, 532-534, Chapter 8, in Nanotechnology 2010: Biosensors, Instruments, Medical, Environment and Energy, NSTI, ISBN 978-1-4398-3415-2.",
  "Gray, S., R. Semiat, M. Duke, A. Rahardianto, Y. Cohen, “Seawater Use and Desalination Technology,” in: Treatise on Water Science. Volume 4: Water Quality Engineering, P. Wilderer (Ed.), Vol. 4, 73-109, Chapter 4, Elsevier, 2011.",
  "Nancy H. Lin, G. T. Lewis and Y. Cohen, “QCM study of mineral surface crystallization on aromatic polyamide membrane surfaces,” J. Membrane Science, 379, 426-433 (2011).",
  "Bartman, A.R., E. Lyster, R. Rallo, P.D. Christofides, Y. Cohen, “Mineral Scale Monitoring for Reverse Osmosis Desalination via Real-Time Membrane Surface Image Analysis,” Desalination, 273, 64-71 (2011).",
  "Gabelich, C., A. Rahardianto, C.R. Northrup, T.I. Yun, and Y. Cohen, “Process evaluation of intermediate chemical demineralization for water recovery enhancement in production-scale brackish water desalting,” Desalination, 272 (2011) 36.",
  "Rallo, R., B. France, R. Liu, S. Nair, S. George, R. Damoiseaux, F. Giralt, A. Nel, K. Bradley, Y. Cohen, “Self-Organizing Map Analysis of Toxicity-Related Cell Signaling Pathways for Metal and Metal Oxide Nanoparticles,” Env. Sci. Technology, 45, 1695-1702 (2011).",
  "Damoiseaux, R., S. George, M. Li, S. Pokhrel, Z. Ji, B. France, T. Xia, E. Suarez, R. Rallo, L. Madler, Y. Cohen, E.M.V. Hoek, and A. Nel, “No Time to Lose-High Throughput Screening to Assess Nanomaterial Safety,” Nanoscale, 3(4): 1345-1360 (2011).",
  "George, S., T. Xia, R. Rallo, Y. Zhao, Z. Ji, S. Lin, X. Wang, H. Zhang, B. France, D. Schoenfeld, R. Damoiseaux, R. Liu, S. Lin, K.A. Bradley, Y. Cohen, and A.E. Nel, “Use of a High-Throughput Screening Approach Coupled with in vivo Zebrafish Embryo Screening to Develop Hazard Ranking for Engineered Nanomaterials,” ACS Nano, 5(3): 1805-1817 (2011).",
  "Liu, R., R. Rallo, S. George, Z. Ji, S. Nair, A.E. Nel, and Y. Cohen, “Classification Nano-SAR Development for Cytotoxicity of Metal Oxide Nanoparticles,” Small, 7(8): 1118-1126 (2011).",
  "Zhang, H., T. Xia, H. Meng, M. Xue, S. George, Z. Ji, X. Wang, R. Liu, M. Wang, B. France, R. Rallo, R. Damoiseaux, Y. Cohen, K.A. Bradley, J.I. Zink, and A.E. Nel, “Differential Expression of Syndecan-1 Mediates Cationic Nanoparticle Toxicity in Undifferentiated versus Differentiated Normal Human Bronchial Epithelial Cells.” ACS Nano, 5, 2756-2769 (2011).",
  "Liu R., R. Rallo. and Y. Cohen, “Unsupervised Feature Selection Using Incremental Least Squares,” International J. of Information Technology & Decision Making, 6, 1-22 (2011).",
  "Liu, H. H., S. Surawanvijit, R. Rallo, G. Orkoulas and Y. Cohen, “Analysis of Nanoparticle Agglomeration in Aqueous Suspensions via Constant-Number Monte Carlo Simulations,” Env. Sci. & Technology, 2011, 45 (21): 9284–9292.",
  "R. Liu, S. Lin, R. Rallo, Y. Zhao, R. Damoiseaux, S. Lin, A. Nel, and Y. Cohen, “Automated Phenotype Recognition for Zebrafish Embryo based in-vivo High Throughput Toxicity Screening of Engineered Nano-Materials,” PLoS One, 7, 1-10, 2012.",
  "Liu, H.H. and Y. Cohen, “Multimedia Environmental Distribution of Nanomaterials,” p 304-306, in Nanotech 2012 Vol. 3, Nanotechnology 2012: Bio Sensors, Instruments, Medical, Environment and Energy (Volume 3).",
  "Sanciolo, P., E. Ostarcevic, P. Atherton, G. Leslie, T. Fane, Y. Cohen, M. Payne and S. Gray, “Enhancement of Reverse Osmosis Water Recovery using Inter-Stage Calcium Precipitation,” Desalination, 295, 43–52 (2012).",
  "McCool, B.C., A. Rahardianto and Y. Cohen, “Antiscalant removal in accelerated desupersaturation of RO concentrate via chemically-enhanced seeded precipitation (CESP),” Water Research, 46, 4261–4271 (2012).",
  "Thompson, J., N. Lin, E. Lyster, R. Arbel, J. Gilron, T. Knoll and Y. Cohen, “RO Membrane Mineral Scaling in the Presence of Biofilm,” J. Membrane Science, 415-416, 181-191 (2012).",
  "Cohen, Y., R. Rallo and R. Liu, “In Silico Analysis of Nanomaterials Hazard and Risk,” Accounts of Chemical Research, 46 (3), 802–812 (2013).",
  "Zhang, H., Z. Ji, T. Xia, H. Meng, C. Low-Kam, R. Liu, S. Pokhrel, S. Lin, X. Wang, Y-P Liao, M. Wang, L. Li, R. Rallo, R. Damoiseaux, D. Telesca, L. Mädler, Y. Cohen, J. I. Zink, A. E. Nel, “Use of metal oxide nanoparticle band gap to develop a predictive paradigm for oxidative stress and acute pulmonary inflammation,” ACS Nano, 6 (5), 4349-4368 (2013).",
  "Cohen, Y., N. H. Lin, K. Varin and D. Chien, and R. F. Hicks “Membrane Surface Nano-structuring with Terminally Anchored Polymer Chains,” in “Functional Nanostructured Materials and Membranes for Water Treatment,” 85-124 (2013), Editors: M. Duke, D. Zhao and R. Semiat, Wiley-VCH Verlag.",
  "Kimbrough, D. E., L. Boulos, S. Surawanvijit, A. Zacheis and Y. Cohen, “Pilot-Testing of electrolysis for bromide removal from drinking water,” J. AWWA,105, E299-E309 (2013).",
  "Liu, R., R. Rallo, S. Shaw, and Y. Cohen, “Nano-SAR Development for Bioactivity of Nanoparticles with Considerations of Applicability Domain and Decision Boundaries,” Small, 9, 1842-1852 (2013).",
  "Thompson, J., A. Rahardianto, H. Gu, M. Uchymiak, A. Bartman, M. Hedrick, D. Lara, J. Cooper, J. Faria, P. Christofides, Y. Cohen, \"Rapid field assessment of RO desalination of brackish agricultural drainage water\", Water Research, 47 (2013) 2260-2649.",
  "Gu, H., A. R. Bartman, M. Uchymiak, P. D. Christofides and Y. Cohen, “Self-Adaptive Cyclic Feed Flow Reversal Operation of Reverse Osmosis Desalination,” Desalination, 308, 63-72 (2013).",
  "Pascual, X, H. Gu, A.R. Bartman, A. Zhu, A. Rahardianto, J. Giralt, P.D. Christofides, Y. Cohen, \"Data-driven models of steady state and transient operations of spiral-wound RO Plant\", Desalination, 316, 154-161 (2013). https://doi.org/10.1016/j.desal.2013.02.006",
  "B. C. McCool, A. Rahardianto, Y. Cohen, “Evaluation of Chemically-Enhanced Seeded Precipitation of RO Concentrate for High Recovery Desalting of High Salinity Brackish Water,” Desalination, 317, 116-126 (2013).",
  "Liu, R., H. Y. Zhang, Z. X. Ji, R. Rallo, T. Xia, C. H. Chang, A. Nel and Y. Cohen, “Development of structure–activity relationship for metal oxide nanoparticles,” Nanoscale, 12, 5644-5653 (2013).",
  "Zita L.T. Yu, Anditya Rahardianto, J.R. DeShazo, Michael K. Stenstrom, Yoram Cohen, “Critical Review: Regulatory Incentives and Impediments for Onsite Graywater Reuse in the United States,” Water Env. Research, 815, 1-14, 2013.",
  "Varin, K., N. Liu and Y. Cohen, “Biofouling and Cleaning Effectiveness of Surface Nano-Structured Reverse Osmosis Membranes,” J. Memb. Sci, 446, 472-481 (2013).",
  "Xia, T., D. Malasarn, S. Lin, Z. Ji, H. Zhang, R. J. Miller, A. A. Keller, R. M. Nisbet, B.H. Harthorn, H. A. Godwin, H. S. Lenihan, R. Liu, J. J. Gardea-Torresdey, Y. Cohen, L. Mädler, P. A. Holden, J. I. Zink and A. E. Nel, “Implementation of a Multidisciplinary Approach to Solve Complex Nano EHS Problems by the UC Center for the Environmental Implications of Nanotechnology,” Small, 9, No. 9–10, 1428–1443 (2013).",
  "Liu, R., B. France, S. George, R. Rallo, H. Zhang, T. Xia, A. Nel, K. Bradley, and Y. Cohen, “Association rule mining of cellular responses induced by metal and metal oxide nanoparticles, Analyst, 139(5), 943-953 (2013).",
  "Liu, R., R. Rallo and Y. Cohen, “Quantitative Structure-Activity-Relationships for Cellular Uptake of Nanoparticles,” 1-4 pp, 54-157, in Proc. 13th IEEE International Conference on Nanotechnology (IEEE-NANO), August 5-8, 2013, Beijing, China.",
  "Harper S.L., J.E. Hutchison, N. Baker, M. Ostraat, S. Tinkle, J. Stevens, M.D. Hoover, J. Adamick, K. Rajan, S. Gaheen, Y. Cohen, A.E. Nel, R.E. Cachau, M. Tuominen, Nanoinformatics workshop report: current resources, community needs and the proposal of a collaborative framework for data sharing and information integration. Computational Science & Discovery, 2013 (6): 014008",
  "Surawanvijit, S., M. Kim, Y. Cohen, “Removal of Metal Oxide Nanoparticles from Aqueous Suspensions,” Separation Sci. and Technology, 49: 1–10 (2014).",
  "Liu, R., T. Hassan, R. Rallo and Y. Cohen, “HDAT: Web-Based High-Throughput Screening Data Analysis Tools,” Comput. Sci. Disc., 6 (2013) 014006, doi:10.1088/1749-4699/6/1/014006.",
  "Cohen, Y., J. Glater, B. McCool, A. Rahardianto and M. Kim, Jose Faria, “Membrane Desalination of Agricultural Drainage Water,” Chapter in Salinity and Drainage in the San Joaquin Valley, California: Science, Technology, and Policy, Editors: A. C. Wang and D. B. Silva, Springer Science, Springer's series of Global Issues in Water Policy., Vol. 5, Pages 303-342 (2014). ISBN: 978-94-007-6850-5 (Print) 978-94-007-6851-2 (Online).",
  "Liu, R., Y. Ge, P. Holden, Y. Cohen, “Visual data exploration of soil bacteria susceptible to engineered nanomaterials,”2014 IEEE International Conference on Bioinformatics and Biomedicine, 18-24, Nov 2-5 (2014), doi:10.1109/BIBM.2014.6999369",
  "Gao, L., A. Rahardianto, H. Gu, P. D. Christofides, and Y. Cohen, “Energy-Optimal Control of RO Desalination,” I&EC, 53 (18), 7409–7420 (2014).",
  "Liu, H.H, M. Bilal, Y. Cohen, A. Lazareva, A. Keller, “Regional Multimedia Distribution of Nanomaterials and Associated Exposures: A software platform,” 2014 IEEE International Conference on Bionformatics and Biomedicine (BIBM), pp 10-17, Nov 2-5 (2014), doi:10.1109/BIBM.2014.6999368",
  "Ivask, A. El-Badawy, C. Kaweeteerawat, D. Boren, H. Fischer, Z. Ji, C.H. Chang, R. Liu, T. Tolaymat, D. Telesca, J. I. Zink, Y. Cohen, P.A. Holden, and H.A. Godwin, “Toxicity Mechanisms in Escherichia coli Vary for Silver Nanoparticles and Differ from Ionic Silver,” ACS Nano, 8(1), 374-386 (2014). doi: 10.1021/nn4044047.",
  "Liu, H. and Y. Cohen, “Environmental Multimedia Distribution of Nanomaterials, “Environmental Sci. Technology, 48 (6), 3281–3292 (2014).",
  "Pascual, X., H. Gu, A. Bartman, R. Zhu, A. Rahardianto, J. Giralt, R. Rallo, P. D. Christofides, Y. Cohen, “Fault Detection and Isolation in Spiral-Wound RO Desalination,” Ind. Eng. Chem. Res., 53 (8), 3257–3271 (2014).",
  "Walkey, C., J. Olsen, F. Song, R. Liu, H. Guo, W. Olsen, Y. Cohen, W. Chan, Protein Corona Fingerprinting Predicts the Cell Association of Gold Nanoparticles, ACS Nano, 8 (3), 2439-2455 (2014), doi: 10.1021/nn406018q.",
  "Sagiv, A., A. Zhu, P. Christofides, Y. Cohen, R. Semiat, “Analysis of Forward Osmosis Desalination via Two-Dimensional FEM Model,” J. Membrane Sci., 464, 161–172 (2014).",
  "Varin, K and Y. Cohen, “Wettability of Terminally Anchored Polymer Brush Layers on a Polyamide Surface,” J. Colloid & Interface Sci., 436, 286-295 (2014).",
  "Yu, Z., L.T, B. R. Bill, M. K. Stenstrom, Y Cohen, “Feasibility of a Semi-Batch Vertical-Flow Wetland for Onsite Residential Graywater Treatment,” Ecological Eng., 82, 311-322 (2015). https://doi.org/10.1016/j.ecoleng.2015.04.087",
  "Yu, Z. L. T., JR DeShazo, M. K.K Stenstrom, Y. Cohen, “Cost-Benefit Analysis of Onsite Residential Graywater Recycling--A Case Study: The City of Los Angeles,” J. American Water Works Association 107 (9), E436-E444 (2015). DOI: 10.1021/acsnano.5b04420",
  "Liu, R., H. H. Liu, Z. Ji, C. H. Chang, T. Xia, A. E. Nel, Y. Cohen, “Evaluation of Toxicity Ranking for Metal Oxide Nanoparticles via an In Vitro Dosimetry Model,” ACS Nano, 9, 9303-9313 (2015). DOI: 10.1021/acsnano.5b04420 Equal",
  "Surawanvijit, S., J. Thompson, A Rahardianto, V. Frenkel, Y. Cohen, “Pulsed Marker Method for Real-Time Detection of Reverse Osmosis Membrane Integrity Loss,” Desalination 370, 25-32 (2015). https://doi.org/10.1016/j.desal.2015.05.003",
  "Sagiv, A., P. D. Christofides, Y. Cohen, R. Semiat, “On the Analysis of FO Mass Transfer Resistances via CFD Analysis and Film Theory,” J. Mem. Science, 495, 198-205 (2015). https://doi.org/10.1016/j.memsci.2015.08.022",
  "Liu, R., Y. Ge, P. A. Holden, Y. Cohen, “Analysis of Soil Bacteria Susceptibility to Manufactured Nanoparticles via Data Visualization,” Beilstein J. Nanotechnology, 6 (1), 1635-1651 (2015). doi:10.3762/bjnano.6.166",
  "Kaweeteerawat, C. C. H. Chang, K. R Roy, R. Liu, R. Li, D. Toso, H. Fischer, A. Ivask, Z. Ji, J. I. Zink, Z. H. Zhou, G. F. Chanfreau, D. Telesca, Y. Cohen, P. Ann Holden, A. E. Nel, H. A. Godwin, “Cu Nanoparticles Have Different Impacts in Escherichia Coli and Lactobacillus Brevis than Their Microsized and Ionic Analogues,” ACS Nano, 9 (7), 7215–7225 (2015). DOI: 10.1021/acsnano.5b02021",
  "Liu, R., R. Rallo, M. Bilal, Y. Cohen, “Quantitative Structure-Activity Relationships for Cellular Uptake of Surface-Modified Nanoparticles,” Combinatorial chemistry & high throughput screening, 18 (4), 365-375 (2015). doi.org/10.2174/1386207318666150306105525",
  "Liu, H., H., M Bilal, A. Lazareva, A. Keller, Y. Cohen, “Simulation Tool for Assessing the Release and Environmental Distribution of Nanomaterials,” Beilstein J. nanotechnology, 6 (1), 938-951 (2015). https//doi:10.3762/bjnano.6.97",
  "Liu, H. H., J. Lanphere, S. Walker, Y. Cohen, “Effect of Hydration Repulsion on Nanoparticle Agglomeration Evaluated via a Constant Number Monte–Carlo Simulation,” Nanotechnology, 26 (4), 045708 (2015). https://doi.org/10.1088/0957-4484/26/4/045708",
  "Godwin, H., C. Nameth, D. Avery, L. L Bergeson, D. Bernard, E. Beryt, W. Boyes, S. Brown, A. J. Clippinger, Y. Cohen, M. Doa, C. O. Hendren, P. Holden, K. Houck, A. B. Kane, F. Klaessig, T. Kodas, R. Landsiedel, I. Lynch, T. Malloy, M. B. Miller, J. Muller, G. Oberdorster, E. J. Petersen, R. C Pleus, P. Sayre, V. Stone, K. M. Sullivan, J. Tentschert, P. Wallis, A. E. Nel “Nanomaterial Categorization for Assessing Risk Potential To Facilitate Regulatory Decision-Making,” ACS Nano, 9, 3409-3417 (2015). https://doi.org/10.1021/acsnano.5b00941.",
  "Liu, R., W. Jiang, C. D. Walkey, W. C. W. Chan, Y. Cohen, “Prediction of Nanoparticles-Cell Association Based on Corona Proteins and Physicochemical Properties,” Nanoscale, 7 (21), 9664-9675 (2015). doi.org/10.1039/C5NR01537E",
  "Gao, L. X., A. Rahardianto, H. Gu, P. D. Christofides, and Y. Cohen, “Novel Design and Operational Control of Integrated Ultrafiltration – Reverse Osmosis System with RO Concentrate Backwash,” Desalination, 382, 43-52 (2016). https://doi.org/10.1016/j.desal.2015.12.022",
  "Kaweeteerawat, C., A. Ivask, R. Liu, H. Zhang, C. H. Chang, C. Low-Kam, H. Fischer, Z. Ji, S. Pokhrel, Y. Cohen, D. Telesca, J. Zink, L. Mädler, P. A Holden, A. Nel, H. Godwin, “Toxicity of Metal Oxide Nanoparticles in Escherichia coli Correlates with Conduction Band and Hydration Energies,” Env. Sci. Technology, 49 (2), 1105-1112 (2015). doi:10.1021/es504259s",
  "Oh, E., R. Liu, A. E. Nel, K. B. Gemill, M. Bilal, Y. Cohen, and I. L. Medintz “Meta-Analysis for Cellular Toxicity for Cadmium Containing Quantum Dots,” Nature Nanotechnology, 11, 479–486 (2016). https://doi.org/10.1038/nnano.2015.338",
  "Surawanvijit, S. and Y. Cohen, “An Integrated Approach for Characterization of Polyamide Reverse Osmosis Membrane Degradation Due to Free Chlorine,” J. Membrane Sci., 510, 164-173 (2016). https://doi.org/10.1016/j.memsci.2016.02.044",
  "Yu, Z. L.T., A. Rahardianto, M. K. Stenstrom, and Y. Cohen, “Performance and Economic Evaluation of a Semibatch Vertical-Flow Wetland for Onsite Residential Bathroom Graywater Treatment,” J. American Water Works Association, Vol. 108 (No. 7), E392-E404 (2016). https://dx.doi.org/10.5942/jawwa.2016.108.0079",
  "Cohen, Y., “Environmental Multimedia Distribution of Nanomaterials,” pp 35-39, Chapter in “Quantifying Exposure to Engineered Nanomaterials (QEEN) from Manufactured Products Addressing Environmental, Health, and Safety Implications,” Workshop Proceedings, July 7–8, 2015, Arlington VA, Consumer Product Safety Commission in collaboration with the National Nanotechnology Initiative. (Published 2016).",
  "Holden et al., Considerations of Environmentally Relevant Test Conditions for Improved Evaluation of Ecological Hazards of Engineered Nanomaterials, Environ. Sci. Technol., 2016, 50 (12), pp 6124–6145. https://doi:10.1021/acs.est.6b00608.",
  "Gu, H., A. Rahardianto. L. X.Gao, P. D. Christofides and Y. Cohen, “Ultrafiltration with self-generated RO concentrate pulse backwash in a novel integrated seawater desalination UF-RO system,” J. Membrane Science, 520, 111-119 (2016). https://doi.org/10.1016/j.memsci.2016.07.022",
  "Gao, L. X., H. Gu, A. Rahardianto, P. D. Christofides, and Y. Cohen, “Self-Adaptive Cycle-to- Cycle Control of In-line Coagulant Dosing in Ultrafiltration for Pre-Treatment of Reverse Osmosis Feed Water,” Desalination, 401, 22-31 (2017). http://dx.doi.org/10.1016/j.desal.2016.09.024",
  "Sagiv, A., W. Xu, R. Semiat and Y. Cohen, “Evaluation of Osmotic Energy Extraction via FEM Modeling and Exploration of PRO Operational Parameter Space,” Desalination, 401, 120-133 (2017), https://dx.doi.org/10.1016/j.desal.2016.09.015.",
  "Thompson, J., A. Rahardianto, L. Gao and Y. Cohen, “Real-time direct detection of silica scaling on RO membranes,” J. Mem. Sci., 528, 346-358 (2017). https://doi.org/10.1016/j.memsci.2017.01.027",
  "Bilal, M., H. Liu, R. Liu, and Y Cohen, \"Bayesian Network as a Support Tool for Rapid Query of the Environmental Multimedia Distribution of Nanomaterials.\" Nanoscale, 9.12 (2017): 4162-4174. https://doi.org/10.1039/C6NR08583K",
  "Frenkel, V., Y. Cohen, A. Rahardianto and S. Suriwanvijit, “New Techniques for Real-Time Monitoring of RO Membrane Integrity for Virus Removal,” UltraPure Water, April 2017, ISSN-0747-8291. url: https://www.ultrapurewater.com/articles/wastewater/new-techniques-for-real-time-monitoring-of-ro-membrane-integrity-for-virus-removal ISSN-0747-8291, Online Journal Publication",
  "Romero, M., M. Bilal, R. Liu, H. Godwin and Y. Cohen, “Needs and challenges for assessing the environmental impacts of engineered nanomaterials (ENMs),” Beilstein J Nanotechnol. 8, 989–1014 (2017). https://doi.org/10.3762/bjnano.8.101",
  "Cohen, Y., A. Rahardianto and R. Semiat, “A perspective on reverse osmosis water desalination: Quest for water sustainability,” AIChE J., 63, 1171-1784 (2017). https://doi.org/10.1002/aic.15726",
  "Gu, H., L. Gao, A. Rahardianto and Y. Cohen, “Fouling indicators for field monitoring the effectiveness of operational strategies of ultrafiltration as pretreatment for seawater desalination,” Desalination, 431, 86-99 (2018), doi.org/10.1016/j.desal.2017.11.038.",
  "Liu, R. and Y. Cohen, “Fractal Dimension Calculation for Big Data Using Box Locality Index,” Annals of Data Science, (2018). https://doi.org/10.1007/s40745-018-0152-5.",
  "Moses-Varin, K. J., M. Bilal, S-M Kim and Y. Cohen, “Tethered Hydrophilic Polymers Layers on a Polyamide Surface,” J. Appl. Polymer Sci., 135(43), 4683-46843 (2018). https://doi.org/10.1002/app.46843",
  "Cohen, Y., M. Bilal and H. Liu, “Comment on “Assessing the Risk of Engineered Nanomaterials in the Environment: Development and Application of the nanoFate Model,” Env. Sci.Technol, 55(9), 5509-5510 (2018). doi.org/10.1021/acs.est.8b00486",
  "Jeliazkova, N., C. O. Hendren, D. Hristozov, L. Farcal, N. Kochev, P. Doganis, P. Ritchie, B. Hardy, F. Klaessig, E. Willighagen, Y. Cohen, “Chapter 5. Data collection and curation,” in EU-US Roadmap Nanoinformatics 2030, Pages 17-36, Publisher: EU NanoSafety Cluster; Editors: A. Haase and F. Klaessig. DOI:10.5281/zenodo.1486012",
  "Puzyn, T., G. Verheyen, S. Van Miert, B. Xing, S. Iqbal, Q. Zhao, V. Lobaskin, G. Basei, A. G. Papadiamantis, Y. Cohen, “Chapter 6. Nano-chemoinformatics and statistical modelling,” in EU-US Roadmap Nanoinformatics 2030, Pages 37-55, Publisher: EU NanoSafety Cluster; Editors: A. Haase and F. Klaessig. DOI:10.5281/zenodo.1486012",
  "Lobaskin, V., P. Asinari, T. Puzyn and Y. Cohen, “Chapter 7. Modelling properties, interactions and fate of NMs,” in EU-US Roadmap Nanoinformatics 2030, Pages 56-64, Publisher: EU NanoSafety Cluster; Editors: A. Haase and F. Klaessig. doi: 10.5281/zenodo.1486012.",
  "Romero-Franco, M., M. Bilal. H. Godwin and Y. Cohen, “Assessment of Information Availability for Environmental Impact Assessment of Engineered Nanomaterials,” J. Nanoparticle Research, 20, 324 (2018). https://doi.org/10.1007/s11051-018-4402-4.",
  "Frenkel, V. S. and Y. Cohen, “New techniques for real-time monitoring of reverse osmosis membrane integrity for virus removal,” Water Practice and Technology, 13(4), 947-957 (2018). https://doi.org/10.2166/wpt.2018.121 (IWA Publication)",
  "Kim, Soomin, Y. Cohen, K. J. Moses, S. Sharma, M. Bilal, “Polysulfone surface nano-structured with tethered polyacrylic acid,” Appl.Surf.Sci., 470, 411-422 (2019). https://doi.org/10.1016/j.apsusc.2018.11.114",
  "Lee, Tae, A. Rahardianto and Y. Cohen, “Flexible Reverse Osmosis (FLERO) Desalination,” Desalination,452, 123-131 (2019). https://doi.org/10.1016/j.desal.2018.10.022 Equal",
  "Kim, S., K.J. Moses, S. Sharma, M. Bilal, Y. Cohen, “Surface characterization data for tethered polyacrylic acid layers synthesized on polysulfone surfaces,” Data in Brief, 23, 1-10, March 2019. https://doi.org/10.1016/j.dib.2019.103747.",
  "Bilal, M., E. Oh, R. Liu, H. Liu, I. L. Menditz and Y. Cohen, “Bayesian Network Resource for Meta-Analysis: Cellular Toxicity of Quantum Dots,” Small, 15(34): 1900510 (2019) (12 pages). https://doi.org/10.1002/smll.201900510",
  "Lee, T., J. Y Choi and Y. Cohen, “Gypsum scaling propensity in semi-batch RO (SBRO) and steady-state RO with partial recycle (SSRO-PR),” J. Memb. Sci., 588, 1-12 (2019). https://doi.org/10.1016/j.memsci.2019.05.030",
  "Lee, T., A. Rahardianto and Y. Cohen, “Multi-cycle operation of semi-batch reverse osmosis (SBRO) desalination,” J. Membrane Sci., 588, 1-17 (2019); doi.org/10.1016/j.memsci.2019.05.015.",
  "Choi, Y. C., T. Lee, A. B.M.A. Aleidan, A. Rahardianto, M. Glickfeld, M. Kennedy, Y. Chen, P. Haase, C. Chen and Y. Cohen, “On the Feasibility of Small Communities Wellhead RO Treatment for Nitrate Removal and Salinity Reduction,” J. Env. Management, 250, 109487 (12 pages). https://doi.org/10.1016/j.jenvman.2019.109487",
  "Choi, J-Y, T. Lee, Y. Cheng and Y. Cohen, “Observed Crystallization Induction Time in Seeded Gypsum Crystallization,” Ind. & Eng. Chem. Research, 58, 23359-23365 (2019). doi.org/10.1021/acs.iecr.9b06050",
  "Soomin, K., A. Rahardianto, J. S. Walker, K. Coleman and Y. Cohen, “Upgrading polyamide TFC BWRO and SWRO Membranes to Higher SWRO Membrane Performance via Surface Nano-Structuring with Tethered Poly(acrylic acid),” J.Memb.Sci, 597, 11736 (16 pages) (2020). doi.org/10.1016/j.memsci.2019.117736",
  "Lynch et al. (Y. Cohen is Co-Author), “NanoSolveIT Project: Driving Nanoinformatics Research to Develop Innovative and Integrated Tools for in Silico Nanosafety Assessment,” Computational & Structural Biotechnology J., 18, 583-602 (2020). https://doi.org/10.1016/j.csbj.2020.02.023",
  "Muratov et al (Y. Cohen is Co-Author), “QSAR without Borders,” Chemical Society Reviews (2020), https://doi.org/10.1039/D0CS00098A; Correction: https://doi.org/10.1039/D0CS90041A",
  "Cohen, Y., J-Y Choi, and A. Rahardianto, “Water Reclamation, Remediation and Cleaner Production with Nanofiltration,” Chapter in “Nanofiltration - Second Addition,” pp. 451-497, Vol. 2, I. Schafer and A. G. Fane (Editors), Elsevier B.V., 2021.",
  "Soomin, K. and Y. Cohen, “Surface Modified Reverse Osmosis Membranes,” Chapter in in Advances in Water Desalination, Y. Cohen (Editor), World Scientific Publishing, Pages:337–412, July 2021. https://doi.org/10.1142/12009.",
  "Choi, J-Y, F. Kaufmann, A. Rahardianto and Y. Cohen, \"Desupersaturation of RO Concentrate and Gypsum Removal via Seeded Precipitation in a Fluidized Bed Crystallizer.\" Water Research (2020), 190, 16766. https://doi.org/10.1016/j.watres.2020.116766",
  "Chen, Y., S. Kim and Y. Cohen, “Tuning the Hydraulic Permeability and Molecular Weight Cutoff (MWCO) of Surface Nano-structured Ultrafiltration Membranes, J. Memb.Sci., 629, Article 119180, 2021, https://doi.org/10.1016/j.memsci.2021.119180",
  "Chen, Y., M. Rovira, Y. Chen, F. Giralt, and Y. Cohen, \"Hydraulic resistance and protein fouling resistance of a zirconia membrane with a tethered PVP layer.\" Water 13.7 (2021): 951. https://doi.org/10.3390/w13070951",
  "Zhou, Y., B. Khan, H. Gu and Y. Cohen, \"Modeling UF fouling and backwash in seawater RO feedwater treatment using neural networks with evolutionary algorithm and Bayesian binary classification.\" Desalination 513 (2021): 115129. https://doi.org/10.1016/j.desal.2021.115129",
  "Zhou, Y., B. Khan, J-Y Choi, \"Machine Learning Modeling of Water Use Patterns in Small Disadvantaged Communities.\" Water, 13.16 (2021): 2312. https://doi.org/10.3390/w13162312",
  "Chen, Y., J. Zhang, and Y. Cohen. \"Fouling Resistant and Performance Tunable Ultrafiltration Membranes via Surface Graft Polymerization induced by Atmospheric Pressure Air Plasma.\" Separation and Purification Technology (2022): 120490. https://doi.org/10.1016/j.seppur.2022.120490",
  "Chen, Y., Chen, Y., Kim, S., Kim, Y., Walker, J. S., Wolfe, T., Coleman, K., & Cohen, Y., “Scale up of polyamide reverse osmosis membranes surface modification with tethered poly (acrylic acid) for fabrication of low fouling spiral-wound elements,” Desalination, 536, 2022, 115762. https://doi.org/10.1016/j.desal.2022.115762",
  "Chen, Y. and Y. Cohen, “Calcium Sulfate and Calcium Carbonate Scaling of Thin-Film Composite Polyamide Reverse Osmosis Membranes with Surface-Tethered Polyacrylic Acid Chains,” Membranes, 2022, 12(12), 1287; https://doi.org/10.3390/membranes12121287",
  "Cohen, Y., Chen, Y. and S. Kim, “Surface Restructuring of Reverse Osmosis membranes, Chapter in Current Status and New Technologies in Water Desalination, (Editor: Y. Cohen), Vol. 3, 307-376, World Scientific Reference of Water Science, World Scientific Publishing Company (2022). https://doi.org/10.1142/12514",
  "Jarma, Y., J. Thompson, B. Khan, and Y. Cohen, “Field Evaluation of UF Filtration Pretreatment Impact on RO Membrane Scaling,” Water, 15(5):847(2023). https://doi.org/10.3390/w15050847",
  "Khan, B. and Y. Cohen, “Predictive nanotoxicology – Nanoinformatics Approach to Toxicity Analysis of Nanomaterials,” 58 pages, Chapter in Machine Learning in Chemical Safety and Health: Fundamentals with Applications, Q. Wang and C. Cai (Editors), 12/16/2022, ISBN:9781119817482. John Wiley & Sons Ltd.",
  "Chen, Y. and Y. Cohen, “Selective RO membrane with a surface tethered polymer brush layer for enhanced rejection of nitrate, boron, and arsenic,” J. Memb. Sci. Letters,3, 100062 (2023).  https://doi.org/10.1016/j.memlet.2023.100062",
  "Mackay, D. and Y. Cohen, \"Prediction of Volatilization Rates of Pollutants in Aqueous Systems,” NBS Symposium on Non-Biological Transport and Transformation of Pollutants on Land and Water,” May 1976, NBS, Gaithersburg, Maryland.",
  "Cohen, Y. and D. Mackay, \"Mass Transfer of Low Solubility Materials Across an Air-Water Interface,” ACS Symposium on the \"Transfer of Chemical Pollutants Between Air and Water,\" August 1976, San Francisco, California.",
  "Cohen, Y., \"The Role of Interfacial Transport in the Movement of Pollutants in Soils,” Workshop on Research Needs in Intermedia Transport Processes, National Center for Intermedia Transport Research, University of California, Los Angeles, April 1982. NCITR 81-1, August (1981).",
  "Cohen, Y., \"Flow Enhancement and Reduction in Mobility Control with Polymer Solutions,” 182 ACS National Meeting, Division of Geochemistry, Sept. 1981, New York.",
  "Cohen, Y. and S. M. Dinh, \"Hydrodynamic Adsorption Effects of Macromolecules in Porous Media,” ACS National Meeting, March 28-April 2, 1982, Las Vegas, Nevada.",
  "Cohen, Y. and A. B. Metzner, \"Slip Flow of Polymer Solutions,” 54th Annual Meeting of the Society of Rheology, October 15-18, 1982, Evanston, Illinois.",
  "Cohen, Y. and A. B. Metzner, \"Flow Induced Diffusion of Macromolecules,” AIChE 75th Annual Meeting, November 14-18, 1982, Los Angeles, California.",
  "Cohen, Y., \"Mass Transfer Across Sheared, Wavy Gas-Liquid Interfaces,” AIChE 75th Annual Meeting, November 14-18, (1982), Los Angeles, California.",
  "Cohen, Y., \"Chemical Emissions from Liquid Waste Sites,” AIChE Summer National Meeting, August 19-22, 1984, Philadelphia, Pennsylvania.",
  "Cohen, Y. and R. Christ, \"Adsorption Effects in the Flow of Polymer Solutions through Porous Media,” 55th Annual Meeting of the Society of Rheology, October 17-20, 1983, Knoxville, Tennessee.",
  "Cohen, Y., \"Adsorption and Apparent Slip Effects in the Flow of Emulsions and Polymer Solutions through Porous Media,” IXth International Congress on Rheology, October 13, 1984, Acapulco, Mexico.",
  "Cohen, Y., \"Multimedia Aspects of Pollutant Transport,” Conference on New Dimensions of Pollution Control: Cross Media Problems,” The Conservation Foundation, November 13, 1984, Washington, D.C.",
  "Cohen, Y. and P. A. Ryan, \"Environmental Distribution of Aerosol-Bound Pollutants,” ACS National Meeting, April 28- May 3, 1985, Miami, Florida.",
  "Cohen, Y. and P. A. Ryan, \"Multimedia Modeling of Environmental Transport: Trichloroethylene Test Case,” AIChE Annual Meeting, November 25-30, 1984, San Francisco, California.",
  "Cohen, Y. and P. A. Ryan, \"Multimedia Distribution of Pollutants in the Environment,” Northwest ACS Regional Meeting, June 18-20, 1985, Sun Valley Idaho.",
  "Cohen, Y. and M. P. Dudukovic, \"Mass Transfer in Centrifugal Gas/Liquid Contacting Devices,” AIChE Annual Meeting, November 10-14, 1985, Chicago, IL.",
  "Taghavi, H., P. A. Ryan, and Y. Cohen, \"Contaminant Transport under Non-Isothermal Conditions in the Topsoil,” ACS Annual Meeting, Sept. 7-12, 1986, Anaheim, California.",
  "Ryan, P. A. and Y. Cohen, \"Contaminant Diffusion in the Topsoil Zone -- The Equilibrium Assumption Revisited,” ACS Annual Meeting, September 7-12, 1986, Anaheim, California.",
  "Cohen, Y., \"An Integrated Approach to Environmental Engineering Education at UCLA,” invited paper presentation, the Fifth Conference on Environmental Education, July 1986, Houghton, Michigan. Published in the Proceedings of the Fifth Conference on Environmental Engineering Education, Baillord, C. R. (Ed), Michigan Technological University (1986).",
  "Cohen, Y., \"Intermedia Transport Modeling in Multimedia Systems,” The First NCITR Workshop on \"Pollutant transport and Accumulation in a Multimedia Environment,” January 21-24, 1986, Santa Monica, California.",
  "Cohen, Y., M. Chaimberg and R. S. Parnas \"Surface-Grafting of Water-Soluble Polymers,” AIChE Annual Meeting, November 1986, Miami, Florida.",
  "Parnas, R. S. and Y. Cohen, \"Flow of Non-Newtonian Fluids through A Channel Bounded by Porous Media,” Winter Meeting of the Society of Rheology, January 18-21, 1987, Santa Monica, California.",
  "Cohen, Y., \"Models of Multimedia Pollutant Transport,” Invited Paper, Academy of Sciences Symposium on \"Multimedia Approaches to Pollution Control,” Washington, D.C., February 12-14, 1987.",
  "Cohen, Y., R. S. Parnas, M. Chaimberg, and V. Taepaisitphongse, \"Adsorption of Poly-vinylpyrrolidone onto Silica,” AIChE Annual Meeting, Nov. 1987, New York, New York.",
  "Cohen, Y., \"Adsorption of Poly(vinylpyrrolidone) on Modified Silica Surfaces,” International Symposium on Surface Interactions, March 13-18, 1988, Neve-Ilan, Israel.",
  "Cohen, Y., M. Chaimberg, and R. S. Parnas, \"Graft Polymerization of Water-Soluble Polymers,” IUPAC International Symposium on Polymers for Advanced Technologies, Jerusalem, August 16-21, 1987.",
  "Onishi, Y., L. Shuyler and Y. Cohen, \"Multimedia Modeling of toxic Chemicals,” International Symposium, on Water Quality Modeling of Agricultural Non-Point Sources, Utah State University, Logan Utah, June 20-23, 1988.",
  "Cohen, Y. and R. S. Parnas, \"Brownian Simulations of Terminally Anchored Freely-Jointed Chains,” ACS Workshop on Polymer Surfaces and Interfaces, September 20-23, 1988, Pacific Grove, California.",
  "Chaimberg, M. and Y. Cohen, \"Free Radical Graft Copolymerization,” AIChE Annual Meeting, November 1988, Washington, D.C.",
  "Cohen, Y., \"Atmospheric Intermedia Transport Processes.,” Invited Paper, National Science Foundation Conference (co-sponsored by the Association of Environmental Professors) on Fundamental Research Directions in Environmental Engineering, Washington, DC, November 13-15, 1988.",
  "Parnas, R. S. and Y. Cohen, \"Molecular Dynamics Simulation of Chain Molecules at Interfaces,” AIChE Annual Meeting, November 1988, Washington, D.C.",
  "Cohen, Y. and R. S. Parnas, \"Molecular Dynamics of a Terminally Anchored Freely-Jointed Chain Subjected to Laminar Solvent Shear Flow,” AIChE Annual Meeting, November 1988, Washington, D.C.",
  "University of California, Santa Barbara, December 4-5, 1988, Workshop on \"Characterization of Polymers at Solid Surfaces by Neutron Reflectometry,” Invited presentation, \"Dynamics of Polymers at Solid Surfaces\".",
  "Tsai, W-T., Sakugawa, H., Kaplan, I. R., and Y. Cohen, \"Modeling of Gaseous Hydrogen Peroxide and Ozone in Los Angeles Air,” American Geophysical Union Fall Meeting, San Francisco, California, December 5-9, 1988.",
  "Cohen, Y., \"Human Exposure to Chemicals:  A Workshop,” Invited Paper, University of Toronto (Toronto, Canada), December 12-13, 1988.",
  "Cohen, Y. and T. E. Browne, \"Selective Adsorption with Polymeric Adsorbents,\" paper presented in the workshop on \"Advanced Aqueous Separation Technologies for Waste Minimization,” August 22-24, 1988, Santa Monica, CA.",
  "Cohen, Y. and R. S. Parnas, \"Brownian Dynamics of Terminally Anchored Freely-Jointed Chains,” Symposium on \"Polymers in Regions of Restricted Geometry,” ACS Meeting, April 9 - 14, 1989, Dallas, Texas.",
  "Cohen, Y., Tsai, W-T. and S. Chetty, \"Dynamic Partitioning of Organic Pollutants in the Environment,” International Society for Ecological Modeling, ISEM North America Annual Meeting, Toronto, Ontario, Canada, August 6-10, 1989.",
  "Sakugawa, H., Tsai, W-T., Kaplan, I. R. and Cohen, Y., \"Photochemical Generation of H2O2 in the Los Angeles Atmosphere: Comparison of Field Data with Model Predictions,” American Chemical Society, Division of Environmental Chemistry, September 10-15, 1989, Miami Beach, Florida.",
  "Cohen, Y. and D. T. Allen, \"An Integrated Approach to Pollution Prevention Research,\" AIChE Symposium on \"Pollution Prevention for the 1990's: A Chemical Engineering Challenge,\" December 4-5, 1989, Washington D.C.",
  "Cohen, Y. and P. A. Ryan, \"NAPL and Contaminant Transport in the Soil Matrix,” ASCE Environmental Engineering Conference, Austin, Texas, July 10-12 (1989). Proc. of the 1989 Society Conference, Malina, J. F. and C. W. Cook (Eds), ASCE, New York (1989).",
  "Cohen, Y., W-T. Tsai and S. Chetty, \"Dynamic Partitioning of Organic Pollutants in the Multimedia Environment,” 10th Annual Meeting, Society of Environmental Toxicology and Chemistry, October 28-November 2, 1989, Toronto, Canada.",
  "Cohen, Y. and T. E. Browne, \"Removal of Trichloroethylene and Chloroform by Polymeric Adsorbents,” Annual AIChE Meeting, November 1989, San Francisco, CA.",
  "Cohen, Y., \"Multimedia Transport,” Assessment of Human Exposure to Chemicals from Superfund Sites,” June 4-5, 1990, Michigan State University, East Lansing, Michigan.",
  "Cohen, Y., \"Fugacity Model Review,” July 9-10, 1990, University of Toronto, Toronto, Ontario, Canada.",
  "Chaimberg, M. and Y. Cohen, \"Free-Radical Graft Polymerization of Vinyl Monomers onto Silica,” Annual AIChE Meeting, November 11-16, 1990, Chicago, Illinois.",
  "Parnas, S. and Y. Cohen, \"The Effect of Hydrodynamic Interactions of a Terminally Anchored Bead-Rod Model Chain in Simple Shear Flow,” Annual Meeting of the Material Research Society, November 1990, Boston, MA.",
  "Cohen, Y. and R. S. Parnas, \"The Effect of Hydrodynamic Interactions on a Terminally Anchored Bead-Rod Model Chain,\" AIChE Annual Meeting, November 11-16, 1990, Chicago, Illinois.",
  "Seigneur, C., C. Whipple, Y. Cohen, et al., Formation of a Modular Mathematical Model for Multimedia Health Risk Assessment,” AIChE 1990 Summer Meeting, in Session 58: Control and Assessment of Impacts from Multimedia Toxic Chemical Releases.",
  "Cohen, Y., D. T. Allen and W-T Tsai, “Multimedia Assessment of Emissions from the Amoco Oil Company Yorktown Refinery,” published in “Amoco - U.S. EPA Pollution Prevention Project,” Yorktown, Virginia, March 1991.",
  "Cohen, Y. and D. T. Allen, \"An Integrated Approach to Process Waste Minimization Research,\" Paper 91-84.6, 84th Annual Meeting of the Air & Waste Management Association, June 16-21, 1991, Vancouver, B.C. Canada.",
  "Cohen Y., D. T. Allen, R. Clay, W-T. Tsai, K. Rosselot, H. Klee and D. Blewitt, \"Multimedia Assessment of Refinery Emissions,\" Paper 91-84.6, 84th Annual Meeting of the Air & Waste Management Association, June 16-21, 1991, Vancouver, B.C. Canada.",
  "Tsai, W-T., Y. Cohen, H. Sakugawa and I. R. Kaplan, \"Rain Scavenging of Semi-Volatile Organics,\" 84th Annual Meeting of the Air & Waste Management Association, Paper 91-59.1, June 16-21, 1991, Vancouver, B.C. Canada.",
  "Cohen Y. and S. Chetty, \"Total Dose Analysis,” Annual Meeting of the International Society for Exposure Analysis, Atlanta, Georgia, November 4-7, 1991.",
  "Seigneur, C. Whipple, C., P. Anderson, M. Bonfiglio, R. von Burg, D. Foliart, S. Foster, D. Galya, D. Liu, P. Ryan, A. Venkatram, A. Ziegler, Y. Cohen and T. Permutt, \"Formulation of a Modular Mathematical Model for Multimedia Health Risk Assessment,\" 84th Annual Meeting of the Air & Waste Manag. Assoc., June 16-21, 1991, Vancouver, B.C. Canada.",
  "Cohen, Y. and V. Taepaisitphongse, \"Adsorption of Water-Soluble Polymers onto Chemically Modified Silica Surfaces,” AIChE Annual Meeting, November 17-22, 1991, Los Angeles, California.",
  "Cohen, Y. and T. E. Browne, \"Aqueous Phase Adsorption of Priority Pollutants onto Polymeric and Polymer-Grafted Resins,” AIChE Annual Meeting, November 17-22, 1991, Los Angeles, California.",
  "Monbouquette, H. G., Y. Cohen and R. G. Castro, \"Surface Modification of Ceramic Membranes by Graft Polymerization,” AIChE Annual Meeting, November 17-22, 1991, Los Angeles, California.",
  "Tsai, W-T., H. Sakugawa, I. R. Kaplan and Y. Cohen, \"Rain Scavenging of Semi-Volatile Organics,” AIChE Annual Meeting, November 17-22, 1991, Los Angeles, California.",
  "Parnas, R. S. and Y. Cohen, \"A Consistent Calculation of the Effective Hydrodynamic Thickness (EHT) of a Terminally Anchored Bead Rod Chain in Shear Flow,” AIChE Annual Meeting, November 17-22, 1991, Los Angeles, California.",
  "Gusler, G. M., T. E. Browne and Y. Cohen, \"Anomalous Adsorption of Organics onto Polymeric Resins,” AIChE Annual Meeting, Nov. 17-22, 1991, Los Angeles, California.",
  "Bobke, D. and Y. Cohen, \"The Adsorption and Desorption of Organic Solutes on Polymeric Resins using an HPLC System,” AIChE Annual Meeting, November 17-22, 1991, Los Angeles, California.",
  "Cohen, Y., \"Transport and Fate of Organic Air Toxics in the Multimedia Environment,\" EPRI International Conference on Managing Hazardous Air Pollutants: State of the Art, November 4-6, 1991, Washington, D.C.",
  "Tsai, W-T. and Y. Cohen, \"Rain Scavenging of Toxic Air Pollutants: The Need to Revisit the Application of the Rain-Scavenging-Ration Concept,” EPRI International Conference on Managing Hazardous Air Pollutants: State of the Art, Nov. 4-6, 1991, Washington, D.C.",
  "Gusler, G. M., T. E., Browne and Y. Cohen, \"Comparison of Polymeric Resins and Activated Carbon,” 23rd Annual Meeting of the Fine Particle Society Las Vegas, Nevada, July 13-17, 1992.",
  "Browne, T. E. and Y. Cohen, \"Aqueous Adsorption of Priority Pollutants onto Polymeric Resins,” 23rd Annual Mtg. Fine Particle Society Las Vegas, Nevada, July 13-17, 1992.",
  "Pesinova, V., L. Creelman, A. M. Winer and Y. Cohen, \"Intermedia Transfer Factors for Volatile Aromatic Hydrocarbons,\" Annual Air and Waste Management Association Meeting, Kansas City, Kansas, June 16-21, 1992, Paper 92-95.04.",
  "Cohen, Y. and R. E. Clay, \"Multimedia Partitioning of Particle-Bound Organics,” AIChE Annual Meeting, November 1-6, 1992, Miami Beach, FL.",
  "Cohen, Y. and R. E. Clay, \"Multimedia Partitioning of Particle-Bound Organics,\" AIChE Annual Meeting, November 1-6, 1992, Miami Beach, Florida.",
  "Cohen, Y., \"Integrated Multimedia Exposure Assessment,\" ATSDR International Congress on the Health Effects of Hazardous Waste, May 3-6, 1993, Atlanta, Georgia.",
  "Cohen, Y. and R. E. Clay, \"Multimedia Transport and Fate of Particle-Bound Organics,\" Air & Waste Management Association Meeting, Paper 93-WA-73.04, June 11-18, 1993, Denver, Colorado.",
  "Van de Water, R. B. and Y. Cohen, \"Multimedia Transport and Fate, Exposure and Risk Assessment: Strategies for Developing Evaluative, Integrated Computer Software,\" Air & Waste Manag. Assoc. Mtg., Paper 93-WA-76.02, June 11-18, 1993, Denver, Colorado.",
  "Creelman, L. W., A. W. Winer and Y. Cohen, \"Development of Intermedia Transfer Factors for Hexavalent Chromium,\" Air & Waste Management Association Meeting, Paper 93-RA-116A.03, June 11-18, 1993, Denver, Colorado.",
  "Gusler, G. M., Y. Cohen and T. E. Browne, \"Removal of Organics by Polymeric Resins: Adsorption or Absorption?\" paper 186d, AIChE Annual Meeting, November 7-12, 1993, St. Louis, Missouri.",
  "Cohen, Y. and T. E. Browne, \"A Screening-Level System for the Design of Polymeric Adsorption Resins,\" paper 184b, AIChE Annual Meeting, Nov. 7-12, 1993, St. Louis, Missouri.",
  "Cohen, Y., G. M. Gusler and T. E. Browne, \"Anomalous Bi-Solute Adsorption of Organics by Polymeric Resins,\" paper 159a, AIChE Annual Meeting, November 7-12, 1993, St. Louis, Missouri.",
  "Cohen, Y., \"Volatile Organic Compounds in the Environment: A Multimedia Perspective,\" Invited Keynote, The First ASTM International Symposium on VOCs in the Environment, Montreal, Canada, April 11-13 (1994).",
  "Cohen, Y., \"Multimedia Risk Assessment of Hazardous Waste Sites and Uncertainties,” Invited Paper, Seventh Annual Workshop of the Southern California Chapter for Risk Analysis, May 19, 1994, University of Southern California.",
  "Castro, R. P., Y. Cohen and H. G. Monbouquette, \"Treatment of Oil in Water Emulsions by Ceramic-Supported Polymer Membrane,\" ASCE 1994 National Conference on Environmental Engineering, July 11-13, 1994, Boulder, Colorado.",
  "Cohen, Y. and J. Klein, \"Dynamic Column Adsorption and Regeneration Studies with Polymeric Resins,\" AIChE Annual Meeting, November 13-18, 1994, San Francisco, CA.",
  "Castro, R. P. and Y. Cohen, \"Ceramic-Supported Polymer Membrane for Ultrafiltration Applications,\" AIChE Annual Meeting, November 13-18, 1994, San Francisco, CA.",
  "Cohen, Y. and R. van de Water, \"Software for Multimedia Analysis of Chemical Contaminants,” Envirosoft, 1994, November 16-19, 1994, San Francisco, CA.",
  "Cohen, Y., “Environmental Risk Reduction,” Annual Meeting of the Center for Clean Technology, November 1995.",
  "Cohen, Y., “Multimedia Distribution of Chemical Contaminants: An Integrated Modeling Approach,” Invited Paper, Eight Annual Workshop on Current Issues in Risk Assessment and Human Health, Southern California Chapter for Risk Analysis, May 18, 1995, Los Angeles, CA.",
  "Cohen Y. And F. Giralt, “Strategies in Pollution Prevention: Waste Minimization and Source Reduction,” 2a Conferncia Internacional Sobre Miniització de Residus i Producció Neta, June 7-9, 1995, Barcelona, Spain.",
  "Cohen, Y. “Intermedia and Multimedia Transport of Chemical Pollutants,” Invited Speaker, 6th International Conference on Conservation and Management of Lakes, October 23-27, 1995, Tsukuba, Japan.",
  "Cohen Y. and R. B. Van de Water, “Multimedia Distribution of Chemical Contaminants: An Integrated Modeling Approach,” Second World SETAC Congress, November 5-9, 1995, Vancouver, BC, Canada.",
  "Cohen, Y. and R. Vohra, “Dynamic Bioaccumulation of Organics in Finned Fish,” Second World SETAC Congress, November 5-9, 1995, Vancouver, BC, Canada.",
  "Cohen, Y., R. P. Castro and H. G. Monbouquette, “Ceramic Membrane Modification by Graft Polymerization,” AIChE Annual Meeting, Nov. 12-17, 1995, Miami Beach, Florida.",
  "Font, J., Y. He, J-D. Jou, R. Castro and Y. Cohen, “Ceramic-Supported Polymer Membranes for Pervaporation of Volatile Organic Compounds from Dilute Aqueous Solutions,” AIChE Annual Meeting, November 12-17, 1995, Miami Beach, Florida.",
  "Jou, D-J, Y. He and Y. Cohen, “Free-Radical Graft Polymerization of Vinyl Monomer onto Silica,” AIChE Annual Meeting, November 12-17, 1995, Miami Beach, Florida.",
  "Cohen, Y., I. Cuesta, X. Grau and F. Giralt, “Hydrodynamics and Mass Transfer in Shallow Liquid Ponds Due to Surface Shear,” AIChE Annual Meeting, November 12-17, 1995, Miami Beach, Florida.",
  "Cohen, Y., “Environmental Multimedia Assessment,” AIChE Annual Meeting, November 10-15, 1996, Chicago, IL.",
  "Cohen, Y., R. P. Castro, J-D Jou and H. G. Monbouquette, “Ceramic-Supported Polymer Membranes for Ultrafiltration,” AIChE Annual Meeting, Nov. 10-15, 1996, Chicago, IL.",
  "Cohen, Y., I. Park, A. Markov, “Removal of Organics from Aqueous systems using Macronet Resins: Dynamic Sorption and Regeneration,” AIChE Annual Meeting, November 10-15, 1996, Chicago, IL.",
  "Cohen, Y., “Current Trends in Human Health Risk Assessment,” Panel Member, Southern California Society for Risk Analysis, 9th Annual Meeting and Workshop, Current Issues in Risk Management and Human Health, May 23, 1996, University of Southern California, Los Angeles, California.",
  "Faibish, T., Cohen, Y. and M. Elimelech, “Effect of Interparticle Interactions on Flux Decline in Crossflow Membrane Filtration of Colloidal Suspensions.” North American Membrane Society Annual Meeting, Baltimore, MD, USA, May 1997.",
  "Cohen, Y., “Endocrine Disruptors: What Are the Most Appropriate Approaches to Estimating Exposure,” Invited Panel Member, 7th Annual Meeting of the International Society for Exposure Analysis, November 3-5, 1997, RTP, NC.",
  "Cohen, Y. and R. Van de Water, “Modular Environmental Multimedia Analysis Software,” 18th Annual Meeting, Society of Environmental Toxicology and Chemistry, November 16-20, 1997.",
  "Cohen, Y., “Ceramic-Supported Polymer Membranes,” Gordon Research Conference on Membrane: Materials and Synthesis,” New Hampshire, July 1997.",
  "Yaffe, D. And Y. Cohen, “Polyaromatic Hydrocarbons and their Nitro-PAH Daughter Products,” 18th Annual Meeting, Society of Environmental Toxicology and Chemistry, 16-20, November 1997.",
  "Ron Faibish, Y. Cohen and M. Elimelech, “Crossflow Membrane Filtration of Colloidal Suspensions,” Poster Presentation, Gordon Research Conference on Membrane: Materials and Synthesis, New Hampshire, July 1997.",
  "Cohen, Y. and J. Grifoll, “Infiltration of Liquid Contaminants in Nearly Dry Soils,” AIChE Annual Meeting, Miami Beach, FL, November 15-20, 1998.",
  "Grifoll, J. and Y. Cohen, “Front Tracking Numerical Algorithm for Liquid Infiltration into Nearly Dry Soils,” 1998 Symposium on Environmental Models and Experiments: EnviroMeet’98, July 20-23, 1998, Irvine, California.",
  "Yoshida, W., Y. Cohen and Jeng-Deng J., “Graft Polymerization and Application to ceramic Supported Polymer Pervaporation membranes for VOC Removal,” AIChE Annual Meeting, Miami Beach, FL, November 15-20, 1998.",
  "Cohen, Y. and E. Cooter, “Integrated Multimedia Assessment,” AIChE Annual Meeting, Miami Beach, FL, November 15-20, 1998.",
  "Yaffe, D. and Y. Cohen, “Multimedia Distribution and Environmental Impact of PAHs and their Nitro-PAH daughter Products,” AIChE Annual Meeting, Miami Beach, FL, November 15-20, 1998.",
  "Rovira, M., F. Giralt and Y. Cohen, “Protein Fouling Reduction on ceramic Membranes via Graft Polymerization,” AIChE Annual Meeting, Miami Beach, FL, November 15-20, 1998.",
  "Cohen, Y. and J.D. Jou, “Ceramic-Supported Polymer Pervaporation Membranes for VOC Removal,” 10th Annual Meeting of the North American Membrane Society, May 19-20, 1998, Cleveland, OH.",
  "Cohen, Y., W. Yoshida and Jeng-Deng, J., “CSP Membranes,” Invited Poster Presentation, DOE First Annual Environmental Management Science Program Scientific Workshop, Rosemont, IL, July 27-30, 1998.",
  "Yaffe, D. and Y. Cohen, “Multimedia Risk Assessment for PAH and Nitro-PAHS,” Annual Air and Water Management Meeting, North Carolina, September 1998.",
  "Faibish, R.S., Y. Cohen and M. Elimelech, “Ceramic-Supported Polymeric Membranes for Filtration of Stable Oil-in-Water Microemulsions.” International Congress on Membranes and Membrane Processes, Toronto, Canada, June 1999.",
  "Ron Faibish and Y. Cohen, Crossflow Ultrafiltration of Oil-in-Water Microemulsions with Polymer-Modified Ceramic Membranes, 1999 AIChE Annual Meeting, October 31-November 5, 1999, Dallas, TX.",
  "Yoshida, Y., Jeng-dung Jou, Y. Liang, Y. Cohen, “Graft Polymerized Poly (vinyl acetate) and Poly(vinylpyrrolidone) Layers on Inorganic Substrates for Membrane Separations,” 1999 AIChE Annual Meeting, October 31-November 5, 1999, Dallas, TX.",
  "Yoram Cohen, Environmental Multimedia Distribution of Toxics (Mend-Tox), 1999 AIChE Annual Meeting, October 31-November 5, 1999, Dallas, TX.",
  "Cohen, Y., Polymer at Solid Surfaces for Novel Membranes, Chemistry for a Cleaner Environment (January 29-February 2, 2000), Santa Fe New Mexico.",
  "Faibish, R. and Y. Cohen, Novel Polymer-Modified Ceramic Membrane for the Treatment of Oily Aqueous Waste, Poster Presentation, North American Membrane Society (NAMS) Annual Meeting, Boulder, CO, USA, May 2000.",
  "Yoshida, H. W. and Y. Cohen, Characterization of Polymer-Modified Ceramic Membranes, American Membrane Society (NAMS) Annual Meeting, Boulder, CO, USA, May 2000.",
  "Faibish, R. and Y. Cohen, Novel Polymer-Modified Ceramic (PMC) Membranes for the Filtration of Stable Oil-in-Water (O/W) Microemulsions, Poster Presentation, 74th Colloid and Surface Science Symposium, Lehigh University, Bethlehem, PA, USA, June 2000.",
  "Faibish, R. and Y. Cohen, Fouling-Resistant Polymer-Modified Ceramic Membranes for Ultrafiltration of Oil-In-Water Microemulsions, Poster Presentation, Euromembrane 2000, September 2000, Israel.",
  "Yoshida, H. W. and Y. Cohen, \"Characterization of Graft Polymerized Layers on Inorganic Substrates,\" AIChE Annual Meeting, November 11-17, 2000, Los Angeles, CA.",
  "Cohen, Y. and E. Cooter, \"A Dynamic Simulator of Environmental Chemical Partitioning,” AIChE Annual Meeting, November 11-17, 2000, Los Angeles, CA.",
  "Nguyen, N. V. and Y. Cohen, \"Kinetics of Graft Polymerization of Vinyl(pyrrolidone) onto Vinyl Silane-Modified Silica Surface,\" AIChE Annual Meeting, November 11-17, 2000, Los Angeles, CA.",
  "Yoshida, H. W. and Y. Cohen, \"Pervaporation Removal of MTBE from Aqueous Solutions Using Ceramic Supported Polymer (CSP) Pervaporation Membranes,” AIChE Annual Meeting, November 11-17, 2000, Los Angeles, CA.",
  "Faibish, R., W. Yoshida and Y. Cohen, Topology and Wetting Characteristics of Terminally Grafted Polymer Chains on Ceramic Surfaces,\" AIChE Annual Meeting, November 11-17, 2000, Los Angeles, CA.",
  "Faibish, R. and Y. Cohen, Fouling-Resistant Polymer-Modified Ceramic Membranes for Ultrafiltration of Oil-In-Water Microemulsions, AIChE Annual Meeting, November 11-17, 2000, Los Angeles, CA.",
  "Giralt, F. G. Espinosa, A. Arenas, D. L. Yaffe and Y. Cohen, Estimation of Diverse Physical Properties of Organic Compounds with a Modified Fuzzy ARTMAP Neural System, AIChE Annual Meeting, November 11-17, 2000, Los Angeles, CA.",
  "Yaffe, D. L., Y. Cohen, Giralt, F. G. Espinosa and A. Arenas, Estimation of Physicochemical Properties for Environmental Multimedia Analysis using Neural-Networks, AIChE Annual Meeting, November 11-17, 2000, Los Angeles, CA.",
  "Wai, Ron-Lee, A. Tsao, J. Glater and Y. Cohen, “Nanofiltration Membranes for Agricultural Water Reclamation,” Annual North American Membrane Society Meeting, May 15-18, 2001, Lexington, Kentucky.",
  "Cohen, Y., L. P. G. Villaluenga and W. Yoshida and, “Non-isothermal Pervaporation Model,” North American Membrane Soc. Meeting, May 15-18, 2001, Lexington, Kentucky.",
  "Cohen, Y., J. Glater, A. Tsao and R-W Lee, \"Nanofiltration Membranes for Agricultural Drainage Water Reclamation,\" International Conference on Membrane Technology for Wastewater Reclamation and Reuse, September 9-13, 2001, Tel-Aviv, Israel.",
  "Yaffe, D. L., Y. Cohen, Giralt, F. G. Espinosa and A. Arenas, “Neural Network- based Molecular Models for Estimating Physicochemical Properties for Environmental Analysis,” Annual AIChE Meeting, November 4-9, 2001, Reno, NV.",
  "Yoshida, H. W and Y. Cohen, “Multilayer Alkoxy Silane Silylation of Inorganic Oxide Surfaces,” poster presented at the Annual AIChE Meeting, 11/4-9/ 2001, Reno, NV.",
  "Yaffe, D. L. and Y. Cohen, “Neural Network-Molecular Descriptor-based Models for Predicting Vapor Pressure of Hydrocarbons,” Annual AIChE Meeting, November 4-9, 2001, Reno, NV.",
  "Cohen, Y. and J. P. G Villaluenga, “Non-Isothermal Pervaporation Model,” Annual AIChE Meeting, November 4-9, 2001, Reno, NV.",
  "Villaluenga, J. P.G and Y. Cohen, “Non-isothermal effects in Pervaporation,” North American Membrane Society Meeting, May 11-15, 2002, Long Beach, CA.",
  "Espinosa, G., Arenas, A., Giralt, F., Amat, L., Girones, X., Carbo-Dorca, R. and Y. Cohen “Prediction of Activity Coefficients of Organic Compounds in Water at Infinite Dilution with an Integrated SOM-Fuzzy ARTMAP Neural System,” SETAC Europe 12th Annual Meeting, Vienna, May 2002.",
  "Yoshida, H. W and Y. Cohen, “Surface Engineering of Grafted Polymers on Inorganic Oxide Substrates for Membrane Pervaporation,” North American Membrane Society Meeting, May 11-15, 2002, Long Beach, CA.",
  "Cohen, Y., “Desalination of Agricultural Drainage Water: Future Challenges,” Plenary lecture, North American Membrane Society Meeting, May 11-15, 2002, Long Beach, CA.",
  "Cohen, Y., “Scale Formation and Control,” Desalination Innovation Research Partnership, Annual Meeting, October 8, 2002, Los Angeles, CA.",
  "Wayne, H. Y. and Y. Cohen, “Surface Engineering of Grafted Polymers on Inorganic Oxide Substrates for Membrane Pervaporation,” Annual AIChE Meeting, November 3-8, 2002, Indianapolis, IN.",
  "Nguyen, V. and Y. Cohen, “Graft Polymerization of Vinyl Acetate onto Silica,” Annual AIChE Meeting, November 3-8, 2002, Indianapolis, IN.",
  "Giralt, F., G. Espinosa, A. Arenas, E. Besalú, X. Girones , R. Carbo-Dorca and Y. Cohen, “QSAR Based on Cognitive Neural Systems for Anti-HIV Activity Derivatives,” Annual AIChE Meeting, November 3-8, 2002, Indianapolis, IN.",
  "Grifoll, J., J. M. Gasto, and Y. Cohen, “Modeling and Numerical Simulation of Non-Isothermal Water and Organic Solute Transport in Soil Vadose Zone,” Annual AIChE Meeting, November 3-8, 2002, Indianapolis, IN.",
  "Williams, M., R. Evangelista and Y. Cohen, “Non-Isothermal Process for Recovering Reverse Osmosis Concentrate: Process Chemistry and Kinetics,” 2002 Water Quality Technology Conference, American Water Works Association, November 10-14, 2002, Seattle, Washington.",
  "Espinosa, G., Arenas, A., Giralt, F., Amat, L., Girones, X., Carbo-Dorca, R., and Y. Cohen, “Carcinogenicity Prediction by using SOM Prototypes & Fuzzy ARTMAP Neural Networks,” SETAC Europe 13th Annual Meeting, Hamburg, April-May 2003.",
  "Wen-Yi Shih and Y. Cohen, “Axial Development of CaSO4 crystals on Reverse Osmosis Membranes,”, 2003 North American Membrane Society, May 17-21, 2003, Snow King Resort Hotel, Jackson Hole, Wyoming.",
  "Nguyen, V and Y. Cohen, “Atom Transfer Radical Polymerization of 4-Vinylpyridine”, Annual AIChE Meeting, November 16-21, 2003, San Francisco, CA.",
  "Ron-Wai Lee, Wen-Yi Shih, Y. Cohen, and Mark D. Williams, “Flux Decline due to Gypsum Scale Formation in RO Desalting,” May 17-21, 2003, Snow King Resort Hotel, Jackson Hole, Wyoming",
  "Cohen, Y., R-W Lee, W-Y Shih, J. Glater, J. Gao and M. Williams, “Membrane Desalination of High Salinity Surface and Agricultural Drainage Waters - Mineral Salt Scale Formation and Control,” Annual AIChE Meeting, November 16-21, 2003, San Francisco, CA.",
  "W-Shih, R-W, Lee, J. Gao, J. Glater and Y. Cohen, “Surface Characterization of CaSO4 Crystals on RO Membranes,” Annual AIChE Meeting, November 16-21, 2003, San Francisco, CA.",
  "Cohen, Y., J. Gao, A. Rahardianto and J. Glater, “Enhanced Water Recovery from Membrane RO Concentrate: Process Evaluation, Membrane Scaling and Precipitation Kinetics,” Annual AIChE Meeting, November 16-21, 2003, San Francisco, CA.",
  "F. Giralt, G. Espinosa, A. Arenas, Y. Cohen, J. Ferre-Gine and R. Carbo-Dorca, “Extraction of molecular features with self-organizing maps to estimate infinite dilution activity coefficients of organic compounds in water by a fuzzy ARTMAP neural classifier,” Annual AIChE Meeting, November 16-21, 2003, San Francisco, CA.",
  "F. Giralt, G. Espinosa, R. Rallo, A. Arenas, Y. Cohen R. Carbo-Dorca, “A Predictive Methodology for Carcinogenicity and Drug Activity Based on Neural Networks,” (poster presentation), Annual AIChE Meeting, November 16-21, 2003, San Francisco, CA.",
  "Gabelich, C. J., F. W. Gerringer, J. C. Franklin, J. Gao, Y. Cohen, and I. H. Suffet, Reverse Osmosis Pretreatment: Challenges with Conventional Treatment, p1-15, in Proceedings of the 2004 AWWA ACE Meeting, Orlando, Florida.",
  "Shih, W-Y, A. Rahardianto and Y. Cohen, “Characterization and Analysis of mineral salt scale formation in membrane desalting on surface water and agricultural drainage water,” 227th ACS National Meeting, March 28-April 1, 2004, Anaheim Convention Center, Anaheim, California.",
  "Wen-Yi Shih, A. Rahardianto, J. Glater, Yoram Cohen, “Development of mineral salt scale on RO membranes and surrogate surfaces,” 2004 NAMS Meeting, June 26-30, 2004, Honolulu, Hawaii.",
  "Cohen, Y., J. Gao, A. Rahardianto, W-Y. Shih, J. Glater, M. Williams, C. Gabelich, \"Membrane desalination of high salinity agricultural drainage water and surface water: Mitigation of mineral salt scaling and enhancement of product water recovery\", 2004 NAMS Meeting, June 26-30, 2004, Honolulu, Hawaii.",
  "Cohen, Y., “Low Pressure membrane desalination - the quest for high product water recovery,” Advanced Membrane Technology II, Engineering Conferences International, May 23-28, 2004, Kloster Irsee, Irsee, Germany.",
  "Rahardianto, A., and Y. Cohen, “Enhanced Water Recovery from Primary Membrane Desalination Concentrate by Precipitative Softening and Secondary Membrane Desalination,” AIChE Annual Meeting, November 7-12, 2004, Austin, Texas.",
  "Cohen, Y., A. Mofidi, C. J. Gabelich, M. D. Williams and Y. Tae I, “The Desalination Research and Innovation Partnership (DRIP) - A Cooperative Research Effort to Lower the Costs of Membrane Desalting in California,” AIChE Annual Meeting, November 7-12, 2004, Austin, Texas.",
  "G. Lewis, “Surface Nano-structuring of Inorganic Oxide Surfaces by Atmospheric Pressure Plasma-Induced Graft Polymerization,” AIChE Annual Meeting, Nov. 7-12, 2004, Austin, Texas.",
  "E. Lyster and Y. Cohen, “Numerical Modeling of Concentration Polarization and Mineral Scale Formation: Effects of Channel Geometry and Spacer Design,” Spring 2005 Meeting of the AWWA CA-NV Section, City of Industry, CA, April 4-8, 2005.",
  "Rahardianto, A., W-Y Shih, Y. Cohen and M. D. Williams, “Enhanced Water Recovery from Primary Membrane Desalination Concentrate by Precipitative Softening and Secondary Membrane Desalination,” Annual AIChE Meeting, November 7 – 12 2004, Austin Convention Center, Austin, TX.",
  "Cohen, Y., “Low pressure membrane desalting of brackish water at high product water recovery – mineral scale formation and mitigation,” Gordon Conference on “Membranes: Materials and Processes,” August 1-6, 2004, Colby-Sawyer College, New London, NH.",
  "Katner, A. and Y. Cohen, “Improvement of Risk Assessments in the Face of Critical Data Gaps:  Chemical Ranking, Dose Reconstruction, and Tiered Screening of Exposure Scenarios for Informed Regulatory Decision-Making\", Association of Schools of Public Health, Fifth Conference on Environmental Health Risk:  Assessment, Management, Communications, July 12-13, 2005, McNamara Alumni Center, University of Minnesota, Minneapolis, MN.",
  "Shih, W-Y and Y. Cohen, “Mineral Salt Crystallization on RO membranes and Surrogate Surfaces,” Spring Meeting of the AWWA/CA-NV, City of Industry, CA, April 4-8, 2005.",
  "Rahardianto, A., “Enhanced Desalination Water Recovery by Induced Mineral Precipitation and Secondary Reverse Osmosis Desalting,” Spring 2005 Meeting of the AWWA CA-NV Section, City of Industry, CA, April 4-8, 2005.",
  "Katner A. and Y. Cohen, “Exposure Assessment Involving an Aerospace Facility with Limited Monitoring Data,” International Conference on Environmental Science and Technology, January 23-26, 2005, New Orleans, Louisiana.",
  "Lyster, E. and Y. Cohen, “Numerical Model of Concentration Polarization: Considerations of Membrane Channel Geometry and Spacer Configurations,” 2005 Annual Meeting, North American Membrane Society, Providence, Rhode Island, June 11-15, 2005.",
  "Lyster, E., A. Rahardianto, M. Uchymiak and Y. Cohen, “Mineral Salt Scale Development in RO Membrane Desalting: A Predictive Numerical Model for Unsteady State Scale Formation,” 2005 Annual Meeting, North American Membrane Society, Providence, Rhode Island, June 11-15, 2005.",
  "Uchymiak, M. and Y. Cohen, “A Novel Ex-Situ Scale Observation Detector (EXSOD) for Mineral Scale Characterization and Online RO Process Monitoring,” 2005 Annual Meeting, North American Membrane Society, Providence, Rhode Island, June 11-15, 2005.",
  "Shih, W-Y and Y. Cohen, “Mineral Salt Crystallization on Surrogate Polymeric Surfaces and RO Membranes,” 2005 Annual Meeting, North American Membrane Society, Providence, Rhode Island, June 11-15, 2005.",
  "Libotean, D., Giralt, J., Rallo, R., Cohen, Y., and F. Giralt, “Reverse Osmosis QSAR Model Using Neural Networks Neural Networks Summer School,” Porto, July 2005.",
  "Kampalath, A. R. and Y. Cohen, “Controlling Environmental Risk to an Urban Stream Via TMDLs: Ballona Creek Case Study,” Annual AIChE Meeting, October 30-November 4, 2005, Cincinnati, Ohio.",
  "Katner, A. and Y. Cohen, “Environmental Community Impact Assessment Associated with a Multiuse Industrial Facility: Scientific Rigor, Uncertainties, Transparency and Participation of Stake Holders,” Annual AIChE Meeting, October 30-November 4, 2005,",
  "Shih, W-Y and Y. Cohen, “Mineral Salt Crystallization on Ro Membranes and Surrogate Surfaces,” Annual AIChE Meeting, October 30-November 4, 2005, Cincinnati, Ohio.",
  "Lewis, T. G. and Y. Cohen, “Plasma-Induced Graft Polymerization of Grafted Nanofilms onto Inorganic Surfaces,” Annual AIChE Meeting, October 30-November 4, 2005, Cincinnati, Ohio.",
  "Lyster, E., “A Predictive Numerical Model for Unsteady State Scale Formation in a Spiral-Wound Membrane Module with Channel Spacers,” Annual AIChE Meeting, October 30-November 4, 2005, Cincinnati, Ohio.",
  "Cohen, Y., “Membrane Surface Nano-Structuring: Selectivity Enhancement, Fouling Reduction and Mineral Scale Formation,” Invited Presentation, U.S. - Israeli Workshop on Nanotechnology for Water Purification, Arlington, VA, March 13-15, 2006.",
  "Cohen, Y., \"Membrane Desalination of Agricultural Drainage Water - Opportunities and Limitations,” Invited Presentation, 2006 Salinity Drainage Conference, Water Resources Center, Sacramento, CA, March 29, 2006.",
  "Cohen, Y., “Desalination Process Limitations and Enhancements,” Invited Plenary Presentation, California/Nevada Section American Water Works Association (CA/NV AWWA) 2006 Spring Conference, Burlingame, CA April 24-28, 2006.",
  "Uchymiak, M., E. Lyster, J. Glater and Y. Cohen “A novel ex-situ scale observation detector (EXSOD) for mineral scale characterization and online RO process monitoring,” California/Nevada Section American Water Works Association (CA/NV AWWA) 2006 Spring Conference, Burlingame, CA April 24-28, 2006.",
  "Rahardianto, A., B. C. McCool, S. Rezvani and Y. Cohen, “High Recovery Desalination of Agricultural Drainage Water: Integration of Accelerated Seeded Precipitation with RO Membrane Desalination,” California/Nevada Section American Water Works Association (CA/NV AWWA) 2006 Spring Conference, Burlingame, CA April 24-28, 2006.",
  "Shih, W-Y and Y. Cohen, “Crystallization on RO membranes and surrogate surfaces,” Poster Presentation, California/Nevada Section American Water Works Association (CA/NV AWWA) 2006 Spring Conference, Burlingame, CA April 24-28, 2006.",
  "Uchymiak, M., E. Lyster, J. Glater and Y. Cohen, “Direct Optical Detection of Mineral Scale Formation and Gypsum Surface Crystallization Kinetics on Reverse Osmosis Membranes,” 2006 North American Membrane Society Meeting, May 12-17, 2006.",
  "Shih, W-Y, H-Y Nancy Lin, G. Lewis, E. Lyster and Y. Cohen, “Mineral Salt Crystallization on RO Membranes and Nano-Structured Polymer Surfaces,” CA/NV AWWA 2006 Fall Conference, Long Beach, CA, October 2-5, 2006.",
  "Uchymiak, M., E. Lyster and Y. Cohen, “Ex-Situ Scale Observation Detector (EXSOD) for Early Detection of Mineral Scale Formation and Surface Crystallization Kinetics on RO Membranes,” poster presentation, 2006 North American Membrane Society Meeting, May 12-17, 2006.",
  "Cohen, Y., E. M.V. Hoek, P. Christofides, J. Glater and Francesc P. Giralt, “Advanced Desalination Research and Training at the UCLA Water Technology Research Center,” CA/NV AWWA 2006 Fall Conference, Long Beach, CA, October 2-5, 2006.",
  "Rahardianto, A., B. McCool, M. Uchymiak and Y. Cohen, “Impact of Mixed Mineral Salt Scaling and Its Mitigation in Brackish Water RO Desalination,” CA/NV AWWA 2006 Fall Conference, Long Beach, CA, October 2-5, 2006.",
  "Uchymiak, M., E. Lyster, J. Glater and Y. Cohen, “Direct Observational Monitoring of RO Membrane Scaling in Brackish Water Desalination,” (CA/NV AWWA) 2006 Spring Conference, Burlingame, CA April 24-28, 2006.",
  "Martinez, I., Espinosa, G., Grifoll, J., Cohen, Y., and F. Giralt (2006) Modelling chemical multimedia partitioning with neural networks, SETAC Europe 16th Annual Meeting, The Hague, May 2006.",
  "Cohen, Y., “Desalination Process Development and Diagnostic,” First Western Workshop on Water Technology Research,” September 29, 2006, UCLA, Los Angeles, CA.",
  "Espinosa, G., Rallo, R., Grifoll, J., Vogel, T., Cohen, Y., and F. Giralt (2006) Cognitive neural networks analysis of organic pollutants persistence in the environment, SETAC Europe 16th Annual Meeting, The Hague, May 2006.",
  "Lyster, E., M. Uchymiak, F. Giralt and Y. Cohen, “Numerical Modeling Mineral Salt Surface Scaling in Reverse Osmosis Modules Using Single Crystal Growth Kinetics,” Session: Desalination Processes, Annual AIChE Meeting, November 12-17, 2006, San Francisco, California.",
  "Rahardianto, A., Y. Cohen M. Uchymiak, “Mixed Mineral Scale Formation in Low-Pressure Reverse Osmosis Membrane,” Session: Desalination Processes – II, Annual AIChE Meeting, November 12-17, 2006, San Francisco, California",
  "Rallo, R., G. Espinosa, T.  M. Vogel, Y. Cohen and F. Giralt, “Quantitative Structure Biodegradation Relationships for Organic Pollutants in Water and Soil,”   Session: Advanced Computations for Environmental Applications I, Annual AIChE Meeting, November 12-17, 2006, San Francisco, California.",
  "Lyster, E., M. Uchymiak and Y. Cohen, “Numerical Modeling Mineral Salt Surface Scaling in Reverse Osmosis Modules using Single Crystal Growth Kinetics,” CA/NV AWWA 2006 Fall Conference, Long Beach, CA, October 2-5, 2006.",
  "Martinez, I., G. Espinosa, R. Rallo, J. Grifoll1, Y. Cohen and F. Giralt, “A Method for Modeling Chemical Multimedia Partitioning with Neural Networks and Classifiers,” Session: Environmental Fate and Transport Processes I, Annual AIChE Meeting, November 12-17, 2006, San Francisco, California.",
  "Uchymiak, M., E. Lyster, J. Glater and Y. Cohen, “Real-Time Mineral Scale Detection and Characterization Using a High-Pressure Ro Ex-Situ Scale Observation Detector,” Session: Desalination Processes – I, AIChE Meeting, November 12-17, 2006, San Francisco, CA.",
  "Libotean, D., J. Giralt, Y. Cohen, and F. Giralt, “Neural Network Approach for Modeling the Performance of RO Membrane Processes,” Session: Advanced Computations and Numerical Models in Water Technology and Resource Management – I, Annual AIChE Meeting, November 12-17, 2006, San Francisco, California.",
  "Lewis, G. and Y. Cohen, “Integrating Plasma Surface Initiation with Living Nitroxide-Mediated Polymerization: Novel Approach to Graft Polymerization,” Polymer Thin Films and Interfaces II, Annual AIChE Meeting, November 12-17, 2006, San Francisco, California.",
  "Hsiao-Yu Nancy Lin, H-Y, G. T. Lewis, W-Y Shih, M. Uchymiak and Y. Cohen, “Fundamental Characterization of Surface Mineral Crystallization on Aromatic Polyamide Ro Membrane Surfaces,” Session: Novel Techniques for Membrane Characterization and Functionalization, Annual AIChE Meeting, Nov. 12-17, 2006, San Francisco, California.",
  "McCool, B. C., A. Rahardianto, S. Rezvani and Y. Cohen, “Technical and Economic Feasibility of Reverse Osmosis Reclamation of Agricultural Drainage Water in the San Joaquin Valley,” Session: Novel Membranes and Membrane Processes for Water Treatment and Production, Annual AIChE Meeting, November 12-17, 2006, San Francisco, California.",
  "Cohen, Y., Invited Panel Member, Applied Membranes Workshop on Water Recycling, Australian Water Association, UNSW and Victoria University, Sydney, Australia, December 1, 2006.",
  "Cohen, Y., Invited Presentation, “High recovery brackish water desalination,” Engineering Conference International (ECI) Conference on Water Treatment and Reuse II, Tomar, Portugal, February 8-11, 2007.",
  "Cohen Y., Christofides P., Giralt F., Giralt J., Libotean D., McFall C., Uchymiak M., Rahardianto A., Lyster E., “High Efficiency Reverse Osmosis Desalination – Process Integration and Control,” International Conference on Water Treatment and Reuse II, Tomar (Portugal), February 8-11, 2007.",
  "Cohen, Y., “The Water-Energy Nexus,” presented at the Faculty Workshop in Energy Related Research,” Organized by the Strategic Planning Group-Office of the Vice Chancellor for Research (OVCR), April 12, 2007, UCLA.",
  "Libotean, D., J. Giralt, R. Rallo, Y. Cohen and F. Giralt, “Neural Network QSAR Analysis of Organic Compounds Rejection and Fouling in RO Membranes,” paper presented at the “Monitoring and mitigation of fouling” Session, 2007 North American Membrane Society Meeting, Orlando, FL May 12-16 (2007). (Also presented in a Poster Session).",
  "Cohen, Y., Invited Panelist, \"Danger on the Delta\" conference, Aquarium of the Pacific, Long Beach, CA, March 13, 2007.",
  "Libotean, D., J. Giralt, Y. Cohen and F. Giralt “RO Membrane Plant Performance Modeling with Neural Networks,” paper presented at the “Membrane process modeling and simulation” Session, 2007 North American Membrane Society Meeting, Orlando, FL May 12-16 (2007. (Also presented in a Poster Session in the same meeting).",
  "Espinosa G., Rallo R., Vogel T., Cohen Y., Giralt, F., “Structure biodegradation relationships for organic pollutants in water and soil,” SETAC Europe 17th Annual Meeting, Porto, May 2007.",
  "Martínez I., Espinosa G., Rallo R, Grifoll J., Cohen Y., Giralt F., “Estimation of Environmental Multimedia Partitioning of Pollutants from Molecular Descriptors using Artificial Neural Networks,” SETAC Europe 17th Annual Meeting, Porto, May 2007.",
  "Rahardianto, A., B. McCool, M. Uchymiak and Y. Cohen, “RO Membrane Desalination of Inland Brackish Water: Scaling by Gypsum in the Presence of Bicarbonate,” paper presented at the “Characterization and prediction of fouling” Session, 2007 North American Membrane Society Meeting, Orlando, FL May 12-16 (2007. (This work was also presented in a Poster Session in the same meeting).",
  "Lin, N. H., G. Lewis, W-Y Shih and Y. Cohen, “The impact of surface topology on the scaling propensity of polyamide membranes” paper presented at the “Characterization and Prediction of Fouling,” 2007 North American Membrane Society Meeting, Orlando, FL May 12-16 (2007). (This work was also presented in a Poster Session).",
  "Kim, M., A. Rahardianto, E. Lyster, Y. Cohen and James Au, “Kinetics of RO Membrane Scaling in The Presence of Antiscalants,” paper 305d, session: Membrane Fouling, Annual AIChE Meeting, November 12-17, 2007, Salt Lake City, UT.",
  "Kim, M., J. Au, J. Glater, Y. Cohen and F. W. Gerringer, “Diagnostic antiscalant screening for brackish water RO desalination with conventional feed pretreatment,” paper presented at the “Monitoring and mitigation of fouling” Session, 2007 North American Membrane Society Meeting, Orlando, FL May 12-16 (2007. (This work was also presented in a Poster Session in the same meeting).",
  "McFall, C., P. D. Christofides, Y. Cohen and J. F. Davis, ``Fault Detection and Control of a Reverse Osmosis Desalination Process,' AIChE Annual Meeting, paper 444c, November 12-17, 2007, Salt Lake City, Utah, 2007.",
  "Hsiao-Yu, N. L., G.T. Lewis, W-Y Shih, Y. Cohen, “The Impact of Surface Topography on Scaling Propensity of Polyamide Membranes,” Paper 189e, Session: “Novel Techniques for Membrane Characterization and Functionalization, Annual AIChE Meeting, November 12-17, 2007, Salt Lake City, UT.",
  "McFall, C., P. D. Christofides, Y. Cohen and J. F. Davis, ``Fault-Tolerant Control of a Reverse-Osmosis Desalination Process,'' Proceedings of 8th IFAC Symposium on Dynamics and Control of Process Systems - Volume 3, 163-168, Cancun, Mexico, 2007.",
  "Cohen, Y., E. M.V. Hoek and P. Christofides, Overview of basic and applied research at the UCLA Water Technology Research Center, RO Analysis and Modeling Session, CA/NV AWWA Spring Conference, Hollywood, CA, April 21-24 (2008).",
  "Bartman, A., C. McFall, P. Christofides and Y. Cohen, Advanced control concepts in membrane RO desalination, presented in the RO Analysis and Modeling Session, 2008 CA-NV AWWA Spring Conference, Hollywood, CA, April 21-24 (2008).",
  "Lyster, E., M. Uchymiak, F. Giralt and Y. Cohen, “Comprehensive numerical modeling of concentration polarization and RO module performance for brackish water desalination,” presented in the RO Analysis and Modeling Session, 2008 CA-NV AWWA Spring Conference, Hollywood, CA, April 21-24 (2008).",
  "Zhu, R., P. Christofides and Y. Cohen, “Fundamental analysis and practical implications of RO process optimization with respect to energy minimization,” presented in the RO Analysis and Modeling Session, 2008 CA-NV AWWA Spring Conference, Hollywood, CA, April 21-24 (2008).",
  "Giralt, F., R. Rallo, D. Libotean, J. Giralt and Y. Cohen, “Artificial Neural Networks analysis of RO process performance: organic compound passage and RO plant performance,” presented in the RO Analysis and Modeling Session, 2008 CA-NV AWWA Spring Conference, Hollywood, CA, April 21-24 (2008).",
  "Lewis, G., M. Kim, N. Hsiao and Y. Cohen, Development of RO/NF membranes of low fouling/scaling propensity by surface nano-structuring, presented in the RO Membrane Process Development and Novel Membranes Session, 2008 CA-NV AWWA Spring Conference, Hollywood, CA, April 21-24 (2008).",
  "Rahardianto, A., B. McCool, Y. Cohen, High recovery inland water desalination via RO integrated with accelerated chemical demineralization – Laboratory and Pilot studies, presented in the RO Membrane Process Development and Novel Membranes Session, 2008 CA-NV AWWA Spring Conference, Hollywood, CA, April 21-24 (2008).",
  "Uchymiak, M., A. Bartman, E. Lyster, M. Kim, A. Rahardianto, J. Glater, P. Christofides and Y. Cohen, Real-time monitoring and novel control scheme of RO membrane scaling, presented in the RO Membrane Process Development and Novel Membranes Session, 2008 CA-NV AWWA Spring Conference, Hollywood, CA, April 21-24 (2008).",
  "Martínez I., Espinosa G., Rallo R, Grifoll J., Cohen Y., Giralt F., “Clustering the chemical space to estimate environmental multimedia partitioning of pollutants with Kernel methods and molecular descriptors, SETAC Europe 18th Annual Meeting, Warszawa, May 2008.",
  "Uchymiak M., A. Bartman, Y. Cohen, P. Christofides, and J. Gilron, “Brackish Water RO Operation in a Flow Reversal Model with automated Real-Time Scale Monitoring – Demonstration in the Gypsum System,” paper presented at the conference “Engineering with Membranes 2008: Membrane Process Development, Monitoring and Modeling – from the Nano to the Macro-Scale, May 22-28, 2008, Algrave, Portugal.",
  "Cohen, Y., “Mineral scaling in Membrane Desalination,” presented in the Desalination Workshop, International Congress on Membranes and Membrane Processes (ICOM 2008), July 12-18, 2008, Honolulu, Hawaii.",
  "Lewis, G. N. Lin, M. Kim, and Y. Cohen, “High Performance Surface Nano-Structured RO/NF Membranes,” paper presented in Membrane and Surface Modification Session, also presented as poster in Poster Session II, International Congress on Membranes and Membrane Processes (ICOM 2008), July 12-18, 2008, Honolulu, Hawaii.",
  "Uchymiak, M., A. Bartman, P. Christofides, N. Daltrophe, M. Weissman, J. Gilron, R. Rallo, and Y. Cohen, “RO Membrane Desalting in a Feed Flow Reversal Mode,” paper presented in Desalination II Session, International Congress on Membranes and Membrane Processes (ICOM 2008), July 12-18, Honolulu, Hawaii.",
  "Zhu, R., P. Christofides and Y. Cohen, “Energy Cost Optimization in RO Desalting and the Thermodynamic Restriction,” plenary presentation in Desalination I Session, also presented as Poster in Poster Session I. International Congress on Membranes and Membrane Processes (ICOM 2008), July 12-18, 2008, Honolulu, Hawaii.",
  "Myung-man, K., R. Rallo, E. Lyster and Y. Cohen, “Optical Monitoring and Real-Time Digital Image Analysis of Mineral Scale Formation on RO Membranes,” in Membrane Fouling I-RO Desalination session, also presented in Poster Session I. 2008 International Congress on Membranes and Membrane Processes, July 12-18, 2008, Honolulu, Hawaii.",
  "Giralt, F., R. Rallo, D. Libotean, J. Giralt and Y. Cohen, “Artificial Neural Networks Analysis of RO Processes Performance: RO Plant Performance and Organic Compound Passage,” paper presented in session on Membrane Modeling III – Process Simulations, Int. Cong. on Membranes and Membrane Processes (ICOM 2008), July 12-18, 2008, Honolulu, Hawaii.",
  "Cohen, Y. and H. Muralidhara, “Reuse/Recycle Water Opportunities and Challenges in Food/Bio Processing Industry Using Membrane Technology: Is this myth or reality?” plenary presentations, presented in Drinking and Wastewater Applications I session, International Congress on Membranes and Membrane Processes (ICOM 2008), July 12-18, 2008, Honolulu, Hawaii.",
  "Lin, N. H, G. Lewis, M. Kim and Y. Cohen, “Surface Nano-Structuring by Atmospheric Pressure Plasma Induced Graft Polymerization for the Synthesis of Low Fouling and Scaling RO/NF Membranes, (paper 421c), in session on “Membrane/surface Modification,” Annual AIChE Meeting, November 16-21, 2008, Philadelphia, PA.",
  "Lewis, G. T. and Y. Cohen, “Nanostructured Polystyrene Films: Graft Polymerization and Organic Sorption Behavior,” paper 616c in session “Polymer Thin Films and Interfaces I”, Annual AIChE Meeting, November 16-21, 2008, Philadelphia, PA.",
  "Rahardianto, A., B. C. McCool, and Y. Cohen, “Accelerated Demineralization of Reverse Osmosis Concentrate of High Gypsum Scaling Propensity,” (paper 551a), in session on “Novel Membranes and Processes for Water Treatment and Purification,” Annual AIChE Meeting, November 16-21, 2008, Philadelphia, PA.",
  "Zhu, R., P. D. Christofides and Y. Cohen, “Energy Cost Optimization in Membrane Desalination and the Thermodynamic Restriction,” (paper 624b). Session: “Water Desalination and Purification,” Annual AIChE Mtg. Nov. 16-21, 2008, Philadelphia, PA.",
  "McCool, C. B., A. Rahardianto and Y. Cohen, “Kinetics of Mineral Precipitation and Organics Removal in Brackish Water Desalination,” Paper 624d, in Session on Water Desalination and Purification, Annual AIChE Meeting, November 16-21, 2008, Philadelphia, PA.",
  "Y. Cohen, P. Christofides, E. Hoek and W. Kaiser, “Research Advances at the Water Technology Research Center,” Poster presented at the AIChE Separations Division Networking session, Annual AIChE Meeting, November 16-21, 2008, Philadelphia, PA.",
  "Lyster, E., R. Rallo, F. Giralt and Y. Cohen \"Numerical Modeling of Scale Formation in RO Membrane Desalination,” (paper 604b) session on Membranes for Water treatment II, Annual AIChE Meeting, November 16-21, 2008, Philadelphia, PA.",
  "Christofides, P.D., A. Bartman, C. McFall, Y. Cohen “Model Predictive Control of Feed Flow Reversal in a Reverse Osmosis Desalination Process,” (paper 641b) in Session on “Dynamics and Control of Energetically Sustainable Processes”, Annual AIChE Meeting, November 16-21, 2008, Philadelphia, PA.",
  "Giralt, F., R. Rallo, J. Giralt, D. Libotean and Y. Cohen “Data Driven Neural Network Based Models of Ro Desalination Plant Operation and RO Membrane Performance,” (paper 688d) in session “Data Analysis: Design, Algorithms & Applications,” Annual AIChE Meeting, November 16-21, 2008, Philadelphia, PA.",
  "Kim, M, N. H. Lin, G. Lewis and Y. Cohen, “Nano-Structured RO/NF Membrane with the Resistance for Scaling in Desalination and Fouling in Bio-Separations,” (paper 700a), Session on “Membrane Based Separations,” Annual AIChE Meeting, November 16-21, 2008, Philadelphia, PA.",
  "Uchymiak, M., Han Gu, A. Bartman, Yeung Lam, P. D. Christofides, W. Kaiser and Y. Cohen, “The Mini-Mobile-Modular (M3) RO Research and Pilot Plant Platform,” West Coast Water Technology Transfer Workshop, February 20, 2009, Los Angeles, California.",
  "McFall, C., A. Bartman P. D. Christofides and Y. Cohen, ``Control of Reverse Osmosis Desalination at High Recovery,'' Proceedings of the American Control Conference, 2241-2247, Seattle, Washington, 2008.",
  "Lyster E., F. Giralt, Y. Cohen, “Concentration Polarization and Scale Formation in a Laboratory RO Cell,” 8th World Congress of Chemical Engineering (WCCE8), Montreal, Quebec, August (2009).",
  "Lin, N. H., R. Arbel, E. Lyster, J. Gilron and Y. Cohen, \"Mineral Scaling of RO Membranes in the Presence of Biofilm,\" paper 415 f in Session on Membrane Fouling, 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "Bartman, A., J. Thompson, A. Rahardianto, H. Gu, B. C. McCool, A. Xhu, M. Uchymiak, Y. Lam, P. D. Christofides, W. J. Kaiser and Y. Cohen, Cohen, Y., \"A Novel Approach and System for Rapid Field Evaluation of Water Desalination,” Paper (412a) in session,\" in Session \"Hybrid and Emerging Membrane-Based Separations Technologies,\" 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "Surawanvijit, S., M. Kim, Y. Cohen, A. A. Keller, H. S. Lenihan, \"Removal of Nanoparticles via Coagulation followed by Sedimentation,\" paper 128c in Session on \"Advances in Fluid-Particle Separations,” 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "Gu, H., M. Uchymiak, A. Bartman, A. Rahardianto, P.D. Christofides, W. J. Kaiser and Y. Cohen, \"Rapid Reverse Osmosis Membrane Performance Analysis Using an autonomous RO Desalination System,\" paper 579f in Session on \"Novel Membranes and Processes for Water Treatment, Desalination and Purification II, 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "Surawanvijit, S., M. Kim, Y. Cohen, A. A. Keller, H. S. Lenihan, \"Removal of Nanoparticles by Coagulation Integrated with Membrane Filtration,\" paper 412f in Session on Hybrid and Emerging Membrane-Based Separations Technologies, 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "Gu, H., A. Bartman, P.D. Christofides and Y. Cohen, \"Reverse Osmosis Desalination in the Undergraduate Laboratory,\" paper 329g in session on Teaching Design Outside of the Capstone Course, 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "Zhu, A., A. Rahardianto, P.D. Christofides and Y. Cohen, \"Minimization of RO Desalination Cost: Considerations of Membrane Permeability and Feed Salinity,\" paper 521e in Session on Membranes for Water Treatment, 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "Bartman, A., P. D. Christofides, and Y. Cohen, \"Modeling and Control of an Experimental Reverse Osmosis Water Desalination System,\" paper 438f in Session Advances in Process Control II, 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "Lyster, E., F. Giralt and Y. Cohen, \"Advanced CFD Modeling of Mineral scaling of RO Membranes\", paper 699e in Session Modeling Transport in Membrane Processes, 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "McCool, B. C., A. Rahardianto and Y. Cohen, \"Field Demonstration of Brine Demineralization for High Recovery RO Desalination,\" paper 579g in session Novel Membranes and Processes for Water Treatment, Desalination and Purification II, 2009 Annual AIChE Meeting, Nashville, TN, November 8-13 (2009).",
  "Cohen, Y., P.D. Christofides, R. Zhu and A. Rahardianto, \"Reverse Osmosis Desalination with High Permeability Membranes- Cost Optimization and Research Needs,\" Invited Presentation, 11th Annual Israel Desalination Society, December 14, 2009, Ben-Gurion University, Sde-Boqer Campus, Israel.",
  "S. Nair, R. Liu, R. Robert, S. George, A. E Nel, Y Cohen, “Learning the Effect of Nanoparticles on Biological Cells Using Property Activity Relationships,” Int. Conf. Env. Implications of Nanotechnology, Washington, D.C. -  September 9 & 10, 2009.",
  "Nair, S., Y. Cohen, S. George, T. Xia, B. France, R. Damoiseaux, K. Bradley, and A. E. Nel, “Analysis of Nanoparticle Toxicity using Machine Learning Techniques,” 1st Int. Conf. on Env. Implications of Nanotechnology, Washington, D.C. -  Sept. 9 & 10, 2009.",
  "Liu, H. and Y. Cohen, “Computational Model of Nanoparticle Aggregation Kinetics,” International Centers for the Environmental Implications of Nanotechnology (ICEIN) Conference, Los Angeles, CA, May 12, 2010.",
  "Liu, R., Y. Cohen, S. George, T. Xia, B. France, R. Damoiseaux, K. Bradley, A. E., Nel, “Unsupervised Feature Subset Selection with Feature Similarity for the Analysis of Chemical and Nanoparticle Toxicity,” First International Conference on the Environmental Implications of Nanotechnology Washington, D.C., September 9 & 10, 2009.",
  "Sanciolo, P., E. Ostarcevic, P. Atherton, G. Leslie, T. Fane, Y. Cohen, M. Payne, S. Gray, “Crystallization to enhance reverse osmosis recovery,” AWA Ozwater10, March 8-10, 2010, Brisbane, Queensland, Australia, paper 005.",
  "Cohen, Y., \"Reverse osmosis desalination with surface nanostructured membranes,” paper 162, Invited Presentation, ACS 239th National Mtg., San Francisco, March 21-25 (2010).",
  "Rallo, R. and Y. Cohen, \"High Throughput Screening of Nanoparticles Toxicity: Data Mining and Modeling,\" International Centers for the Environmental Implications of Nanotechnology (ICEIN) Conference, Los Angeles, CA, May 11-12, 2010.",
  "Surawanvinit, S., M. Kim, H. Liu and Y. Cohen \"Removal of Metal Oxide Nanoparticles from Aqueous Nanoparticle Suspension via pH Adjustment and Coagulation Followed by Membrane Filtration” – Poster presentation, International Centers for the Environmental Implications of Nanotechnology (ICEIN) Conference, Los Angeles, CA, May 2010.",
  "Liu, R., S. Nair, R. Rallo, S. George, A. E. Nel, K. Bradley and Y. Cohen, \"HTS Nanoparticle Data: Complexity Reduction and Knowledge Extraction,\" poster presentation, International Centers for the Environmental Implications of Nanotechnology (ICEIN) Conference, Los Angeles, CA, May 11-12, 2010.",
  "Nair, S., R. Liu, R. Rallo, G. Saji, A. Nel and Y. Cohen, “A Property-Activity Relationship (PAR) model to predict cytotoxic effects of engineered nanoparticles using machine-learning techniques,\" poster presentation, International Centers for the Environmental Implications of Nanotechnology (ICEIN) Conference, Los Angeles, CA, May 11-12, 2010.",
  "Cohen, Y., \"Reverse Osmosis Desalination: Surface Nano-Structured Membranes, Invited Plenary Presentation, International Water Association, Leading Edge Technology Conference, June 2-4, 2010, Phoenix, Arizona.",
  "Surawanvijit, S., M. Kim and Y. Cohen, \"Analysis of Membrane Filtration Efficiency in Removal of Metal Oxide Nanoparticles from Aqueous Nanoparticle Suspension in the Presence of Coagulation Pretreatment,\" Nanotech 2010 Conf., Anaheim, CA, June 2010.",
  "Liu, H., Surawanvinit, S., and Y. Cohen, “Modeling Aggregation and Size Dist. of Nanoparticles with Monte Carlo Simulation,” NanoTech Conf., Anaheim, CA, 6/24/2010.",
  "Gu, H., A. Bartman, M. Uchymiak, A. Rahardianto, P. Christofides, and Y. Cohen, Automated Feed Flow Reversal Operation in a \"Smart\" RO Pilot System with Real-Time Mineral Scale Monitoring, NAMS 2010, July 18-22, 2010, Washington, D.C.",
  "Gu, H., A. Bartman, M. Uchymiak, P. Christofides, Y. Cohen, \"Demonstration of Feed Flow Reversal Operation in an Automated “Smart” RO Pilot System,\" AMTA (American Membrane Technol. Assoc.) Annual Conf. & Exposition, 7/12-15/2010, San Diego, CA.",
  "Gu, H., M. Uchymiak, A. Bartman, J. Thompson, A. Rahardianto, P. Christofides and Y. Cohen, Field Demonstration of Rapid RO Process Evaluation with a “Smart” RO Pilot System, AMTA (American membrane Technology Association) Annual Conference & Exposition, July 12-15, 2010, San Diego, CA.",
  "Bartman, A. r., A. Zhu, P. D. Christofides, Y. Cohen. \"Nonlinear Model-Based Control and Optimization in an Experimental Reverse Osmosis Desalination Process'', AMTA (American Membrane Technol. Assoc.) Annual Meeting, July 15, 2010, San Diego, CA.",
  "Zhu, A., P. D. Christofides and Y. Cohen, \"Reverse Osmosis Desalination: Thermodynamic Restriction and Process Economics,\" AMTA (American Membrane Technology Association) Annual Conf. & Exposition, July 12-15, 2010, San Diego, CA.",
  "McCool, B.C., A. Rahardianto and Y. Cohen, \"Field Demonstration of Brine Demineralization for High Recovery Desalination,\" AMTA (American Membrane Technol. Association) Annual Conference & Exposition, July 12-15, 2010, San Diego, CA.",
  "Lin, N. and Y. Cohen, \"Performance of nano-structured RO/NF membranes,\" AMTA (American Membrane Technology Association) Annual Conference and Exposition, 7/12-15/2010, San Diego.",
  "Rahardianto, R., B. C. McCool and Y. Cohen, \"The Role of Brine Management in the Optimization of Brackish Water Desalinating with High Permeability RO Membranes,\" AMTA, Annual Conf. & Expo. July 12-15, 2010, San Diego, CA.",
  "Cohen, Y., “Smart Water Systems – Concepts and Designs,” presented in the Short Course: Water Technologies: An eye on the 21st Century Technologies & Markets, TechConnect World 2010 Conf. & Expo, June 21-24, 2010, Anaheim Convention Center, Anaheim, CA.",
  "R. Robert, R. Liu, S. Nair, S. George, A. E. Nel, “Y Cohen. Knowledge Extraction from High Throughput Screening Data using Self-Organizing Maps,” NanoTech Expo. June 21-24, 2010, Anaheim, CA USA.",
  "George, S., R. Rallo R, Z. Ji, T. Xia, D. Schoenfeld, X. Wang, H. Zhang, B. France, R. Damoiseaux, S. Lin, K. Bradley, Y. Cohen, AE. Nel, “A High Throughput Cytotoxicity Screening with in vivo Relevance for Toxicity Profiling of Engineered Nanomaterials,” Nano 2010, Clemson- Aug 22-26, 2010.",
  "S. Nair, R. Liu, R Robert, S. George, A. E. Nel and Y. Cohen, “A Property-Activity Relationship (PAR) Model to Predict Cytotoxicity of Engineered Nanoparticles Using Machine Learning Techniques,” NanoTech Expo. June 21-24, 2010, Anaheim, CA, USA.",
  "Cohen, Y., R. Rallo, R. Liu, H. Liu and T. Hassan, “Collaboration and Data Management for Nanoinformatics,” Session: Presentations: Data Collection and Curation, Nanoinformatics 2010, November 3-5, Arlington, VA.",
  "Zhu, A., P.D. Christofides and Y. Cohen, “Stream Recycling and Mixing in Reverse Osmosis Desalination,” in Session: Novel Membranes and Processes for Water Treatment, Desalination and Purification II, AIChE Annual Mtg., Nov. 7-12, 2010, Salt Lake City, UT.",
  "Thompson, J., N. Lin and Y. Cohen, “The Impact of a Pre-Existing Biofilm On Mineral Salt Scaling of RO Membranes,” Session on: Membrane Fouling, AIChE Annual Meeting, November 7-12, 2010, Salt Lake City, UT.",
  "Pascual, X., H. Gu, A. Bartman, A. Zhu, A. Rahardianto, J. Giralt, R. Rallo, F. Giralt, Y. Cohen, “Rapid Prototyping of Reverse Osmosis Processes Using Data-Driven Models,” in Session: Dynamic Simulation and Optimization,” AIChE Annual Meeting, November 7-12, 2010, Salt Lake City, UT.",
  "Rallo, R., R. Liu, S. Nair, S. George, A. E. Nel, F. Giralt and Y.,” Cohen “Data Mining of High Throughput Screening Toxicity of Engineered Nanoparticles,” in Session: “Environmental Health and Safety (EHS) Concerns of Nanomaterials,” AIChE Annual Meeting, November 7-12, 2010, Salt Lake City, UT.",
  "Gu, H., A. Bartman, M. Uchymiak, P. D. Christofides, and Y. Cohen, “Demonstration of Fully Automated Feed Flow-Reversal RO Pilot System Operation Triggered by Real-Time",
  "Membrane Surface Mineral Scale Monitoring,” Session: Membrane Fouling, AIChE Annual Meeting, November 7-12, 2010, Salt Lake City, UT.",
  "Liu, H., S. Surawanvijit and Y. Cohen, “Modeling Aggregation and Size Distribution of Nanoparticles with Monte Carlo Simulation,” Session on: Aggregate and Agglomerate Nanoparticle Formation Dynamics, AIChE Annual Meeting, November 7-12, 2010, Salt Lake City, UT.",
  "Bartman, A., A. Zhu, P.D. Christofides, and Y. Cohen, “Minimizing Energy Consumption in Reverse Osmosis Membrane Desalination Using Optimization-Based Control,” Session on Optimization and Control of Energy Systems II, AIChE Annual Meeting, November 7-12, 2010, Salt Lake City, UT.",
  "Bartman, P.D. Christofides and Y. Cohen, “Real-Time Image Analysis for Automated Scale Detection and Cleaning in a Reverse Osmosis Desalination System,” Session on: Novel Membranes and Processes for Water Treatment, Desalination and Purification, AIChE Annual Meeting, November 7-12, 2010, Salt Lake City, UT.",
  "Varin, K., N. H. Lin and Y. Cohen, “Characterizations of Surface Nano-Structured RO/NF Membranes: Surface Properties and Membrane Performance,” Session on: Advances in Water Treatment Membranes by Surface Modification, AIChE Annual Meeting, November 7-12, 2010, Salt Lake City, UT.",
  "Cohen, Y., “Strategies for Reducing the Cost of RO Water Desalination,” Invited Presentation, Session on: Session in Honor of Professor Anthony Fane: Membrane Separations I, AIChE Annual Meeting, November 7-12, 2010, Salt Lake City, UT.",
  "R. Liu, R. Rallo and Y. Cohen, “Nanoparticles Toxicity: Knowledge Extraction from High-Throughput Screening Data,” Nanoinformatics 2010, November 3-5, 2010, Arlington, VA.",
  "Kari Varin, Nancy H. Lin, and Yoram Cohen, “Evaluation of the Surface Properties of High-Performance Nano-Structured NF/RO Membranes,” session on “Recent Research Advances in RO Desalination I,” AWWA Spring Meeting, Long Beach, CA, 3/28-31/2011.",
  "Thompson, J., N. Lin, E. Lyster, R. Arbel, J. Gilron and Y. Cohen, “Mineral Scaling of RO Membranes in the Presence of a Biofilm,” in session on “Recent Research Advances in RO Desalination I,” AWWA Spring Meeting, Long Beach, California, March 28-31, 2011.",
  "Bartman, A., R. Rallo, P. Christofides, and Y. Cohen, “Real-Time Monitoring of Mineral Scaling for Reverse Osmosis Desalination,” in session on “Recent Research Advances in RO Desalination I,” AWWA Spring Meeting, Long Beach, California, March 28-31, 2011.",
  "Eric Lyster, Alex Bartman, Brian McCool, and Yoram Cohen, “A Direct Method for Evaluating the Effectiveness of Antiscalant Retardation of Crystal Nucleation and Growth on RO Membranes,” in session on “Recent Research Advances in RO Desalination II,” AWWA Spring Meeting, Long Beach, California, March 28-31, 2011.",
  "Gu, H., Al. Bartman, P. Christofides, and Y. Cohen, “Fully Automated Feed Flow-Reversal Operation of RO Desalination: An effective Approach for Suppressing Membrane Mineral Scaling” in session on “Recent Research Advances in RO Desalination II,” AWWA Spring Meeting, Long Beach, California, March 28-31, 2011.",
  "Zhu, A., A. Bartman, A. Rahardianto, P. Christofides, and Y. Cohen, “Strategies for Reducing the Cost of RO Water Desalination,” in session on “Recent Research Advances in RO Desalination I,” AWWA Spring Meeting, Long Beach, CA, March 28-31, 2011.",
  "Cohen, Y., R. Liu and R. Rallo, “Data Mining, Pathways and Network Analyses of Nanoparticle Toxicity Based on High Throughput Screening Data,” Int. Conference on Environmental Implications of Nanotechnology, Durham, NC, May 9-11, 2011.",
  "Liu, R., R. Rallo and Y. Cohen, “Classification Nano-SAR Development for Cytotoxicity of Nanoparticles,” Int. Conf. on Env. Implications of Nanotech, Durham, NC, 4/9-11/2011.",
  "Cohen, Y., T. Hassan, R. Liu, Collaboration and Data Management for Characterization and Toxicity of Nanomaterials, Poster, Int. Conference on Environmental Implications of Nanotechnology, Durham, NC, May 9-11, 2011.",
  "Varin, K., N. Lin and Y. Cohen, “High performance nano‐structured NF/RO membranes synthesis, surface characterization and performance,” Session: Membranes and Surface Modification, Int. Congress on Membranes and Membrane Processes, Amsterdam, The Netherlands, July 23-29, 2011.",
  "Bartman, A., E. Lyster, H. Gu, B. McCool, R. Rallo, P. Christofides and Y. Cohen, “Real time monitoring of mineral scaling in RO membrane desalination – fundamentals of surface crystallization, process optimization and RO plant control,” Session: Desalination 2, Int. Cong. Membrane and Processes, Amsterdam, The Netherlands, July 23-29, 2011.",
  "Cohen, Y., “History, Current Status and Research Needs,” in Session on Nanofiltration and reverse osmosis, Invited Keynote presentation, Int. Congress on Membranes and Membrane Processes, July 23-29, 2011, Amsterdam, The Netherlands.",
  "Pascual, X., H. Gu, A. Bartman, R. Zhu, A. Rahardianto, J. Giralt, R. Rallo, F. Giralt and Y. Cohen, “Diagnostic analysis and fault detection of RO membrane desalination via machine learning,” Session: Desalination 2, International Congress on Membranes and Membrane Processes, Amsterdam, The Netherlands, July 23-29, 2011.",
  "Zhu, A., A. Bartman, A. Rahardianto, B. McCool, P. Christofides and Y. Cohen, “Strategies for reducing the cost of RO water desalination via process integration and optimization,” Session: Modeling, International Congress on Membranes and Membrane Processes, Amsterdam, The Netherlands, July 23-29, 2011.",
  "George, S., T. Xia, S. Pokhrel, Z. Ji, H. Meng, H. Zhang, R. Rallo, R. Damoiseaux, K. Bradley, Y. Cohen, L. Madler and A. Nel, “High throughput screening for developing paradigms of nanomaterial toxicity and safe material design strategies,” Symposium F: Toxicology of Engineered Nanomaterials, International Conference on Materials for Advanced Technologies, June 26-July 1, 2011, Suntec, Singapore.",
  "Cohen, Y., “Effect of membrane biofouling on mineral scaling,” Invited Participant/ Speaker, Biofouling Workshop, International Water Association, Nanyang Technological University, Singapore, July 1-3, 2011.",
  "Liu, R., S. George, B. France, R. Damoiseaux, R. Rallo, K. Bradley, A. E., Nel and Y. Cohen, “Evaluation of the Toxicity of Nanomaterials Based on Knowledge Extraction from High Throughput Screening of Biological Toxicity Data,” Session: Environmental Health and Safety (EHS) Concerns of Nanomaterials, Annual AIChE Annual Meeting, Minneapolis, MN, October 16-21, 2011.",
  "Liu, H., S. Surawanvijit, G. Orkoulas and Y. Cohen, “Modeling Aggregation and Size Distribution of Nanoparticles in Aqueous Suspensions,” Session: Environmental Implications of Nanomaterials: Fate and Transport, Annual AIChE Annual Meeting, Minneapolis, MN, October 16-21, 2011.",
  "Zhu, A., P. Christofides and Y. Cohen, “Reducing Energy Consumption in Reverse Osmosis Desalination: Cyclic or Multi-Stage Operation?”  Session: Membrane-Based Technologies for Water and Energy Reduction, Annual AIChE Annual Meeting, Minneapolis, MN, October 16-21, 2011.",
  "Pascual, X., A. Bartman, A. Zhu, A. Rahardianto, J. Giralt, R. Rallo, J. Ferrer-Giné, F. Giralt and Y. Cohen, “Dynamic Data-Driven Models of Reverse Osmosis Desalination Systems,” Session: Modeling and Computational Approaches for Water Treatment, Annual AIChE Annual Meeting, Minneapolis, MN, October 16-21, 2011.",
  "Surawanvijit, S. and Y. Cohen, “Electrolysis for Bromide Removal and Reduction, in Formation Potential of Brominated Disinfection Byproducts from Drinking Water,” Session: Contaminants in Water: Genesis, Rapid Detection and Sustainable Removal Processes, Annual AIChE Annual Meeting, Minneapolis, MN, October 16-21, 2011.",
  "Varin, K., N. Lin and Y. Cohen, “High performance nano-structured NF/RO membrane synthesis, surface characterization and performance,” Session: Membrane and surface modification, Int. Congress on Membranes and Membrane Processes, July 23-29, 2011, Amsterdam, The Netherlands.",
  "Bartman, A., E. Lyster, H. Gu, B. McCool, R. Rallo, P. Christofides and Y. Cohen, “Real-time monitoring of mineral scaling in RO membrane desalination – fundamentals of surface crystallization, process optimization and RO plant control,” Int. Congress on Membranes and Memb. Processes, July 23-29, 2011, Amsterdam, The Netherlands.",
  "Pascual, X., H. Gu, A. Bartman, R. Zhu, A. Rahardianto, J. Giralt, R. Rallo, F. Giralt, and Y. Cohen, “Diagnostic analysis and fault detection of RO membrane desalination via machine learning,” Session: Desalination, Int. Congress on Membranes and Membrane Processes, July 23-29, 2011, Amsterdam, The Netherlands.",
  "Zhu, A., A. Bartman, A. Rahardianto, B. McCool, P. Christofides and Y. Cohen, “Strategies for reducing the cost of RO water desalination via process integration and optimization,” Session: Modeling, Int. Congress on Membranes and Membrane Processes, July 23-29, 2011, Amsterdam, The Netherlands.",
  "Cohen, Y., R. Liu, T. Hassan, H. Liu and R. Rallo, “Tools for Nanoinformatics and Knowledge Extraction from High Throughput Screening Data of Nanoparticles Toxicity,” Invited Presentation, American Society for Nanomedicine, 11/9-11/, Rockville, Maryland.",
  "Lyster, E. and Y. Cohen, “Modeling Membrane Mineral Scaling in RO Channels - Coupling of Channel Hydrodynamics and Mass Transfer with Crystal Nucleation Kinetics,” in Session on Advances in RO and NF, North American Membrane Society, 2011 Annual Meeting, Las Vegas, June 4-8, 2011, Las Vegas, NV.",
  "Liu, R., S. George, B. France, S. Lin, Z. Ji, T. Hassan, H. Liu, R. Damoiseaux, T. Xia, R. Rallo, K. Bradley, A. E. Nel, and Y. Cohen, “High Throughput Screening Data of Nanoparticles Toxicity: Data Mining and Knowledge Extraction,” Nanoinformatics 2011, December 7-9, 2011, Arlington, VA (Poster).",
  "Hassan, T., R. Liu, and Y. Cohen, “Nanoinformatics Collaboration, Management and Analysis Tools for Nanomaterial Characterization, Toxicity and Environmental Distribution,” Nanoinformatics 2011, December 7-9, 2011, Arlington, VA (Poster).",
  "Sanciolo, P., E. Ostarcevic, P. Atherton, G. Leslie, T. Fane, Y. Cohen, M. Payne, S. Gray, Poster presentation, Pre- and Post-Treatment Systems Part I, Perth Convention and Exhibition Centre (PCEC), Perth, Western Australia September 4-9, 2011, Ref: IDAWC/PER11-252 IDA World Congress.",
  "Cohen, Y., “Strategies for RO process integration and cost reduction,” Invited Presentation, in Session VI: Process Integration and New Ideas, Engineering Conferences International, Conference on Water Treatment / Re-Use and the Water-Energy Nexus, January 8-12, 2012, Cancun, Mexico.",
  "Cohen, Y., “Smart Water Filtration and Desalination Systems – Distributed Deployment and Cost Reduction,” Invited Presentation, 2012 Multi-State Salinity Coalition (MSSC) - Annual Salinity Summit, January 26-27, 2012, Las Vegas, NV.",
  "Liu, H.H., Cohen, Y. “Multimedia Environmental Distribution of Nanomaterials,” Poster Presentation, Southern California Soc. for Risk Analysis, Los Angeles, CA, May 17, 2012.",
  "Cohen, Y., Invited Panel Member, \"The Future of Water in Southern California\", UCLA's Luskin Center for Innovation, Institute of the Environment and Sustainability, & Water Technology Research Center, May 27, 2012, Los Angeles, CA.",
  "Cohen, Y., “Developing Risk Assessment Models for NanoEHS – It’s not what we are used to,” Invited Presentation, Southern California Society for Risk Analysis, May 17, 2012, Los Angeles, CA.",
  "Cohen, Y., “Reducing the Cost of Reverse Osmosis Desalination via Process Configuration, Optimization and Self-Adaptive Operation,” Invited Presentation, Session: Sustainability, Water, Env., 7thChemical Engineering Conference for Collaborative Research in Easter Mediterranean Countries, April 27-May 1, 2012, Corfu Greece.",
  "Gu, H., L. Gao, A. Rahardianto, M. Heijnen, P. Berg, J. Wunram, P. D. Christofides and Y. Cohen, “Self-Adaptive Integrated Ultrafiltration (UF)/Reverse Osmosis (RO) Desalination,” System Session: UF/MF, 22nd North American Membrane society, June 9-10, 2012, New Orleans, Louisiana.",
  "Surawanvijit, S., J. Thompson, A. Rahardianto, V. Frenkel and Y. Cohen, “A Molecular Marker Approach for Characterization of RO Membrane and Module Solute Transport,” Session: Membrane Transport II, 22nd North American Membrane society, June 9-10, 2012, New Orleans, Louisiana.",
  "Thompson, J., N. Lin, E. Lyster, R. Arbel, T. Knoell, J. Gilron and Y. Cohen, “RO Membrane Mineral Scaling in the Presence of a Biofilm, Session: Biofouling and Monitoring, 22nd North American Membrane society, June 9-10, 2012, New Orleans, Louisiana.",
  "Varin, K.J., N. Lin and Y. Cohen, “Fouling Resistance and Ease of Cleaning Post Biofouling of Atmospheric Pressure Plasma Induced, Surface Nanostructured, Reverse Osmosis Membranes,” in Session: Membrane Surface Modifications, 22nd North American Membrane society, June 9-10, 2012, New Orleans, Louisiana.",
  "Cohen, Y., “Use of Nanoinformatics for Predictive Modeling,” Breakout Session Presentation, Greener Nano 2012: Nanoinformatics Tools and Resources Workshop, July 30, 2012, Portland, Oregon.",
  "Liu, H. and Y. Cohen, “Multimedia environmental distribution of nanomaterials,” Session: Nanomaterials in Medicine, Food and the Environment, 244th ACS National Meeting & Exposition, August 19-23, 2012, Philadelphia, Pennsylvania.",
  "Cohen, Y., K. Varin and J. Thompson, “Modeling, monitoring, and suppression of mineral scaling of reverse osmosis membranes,” Session: Mineral Scales in Biological and Industrial Systems, 244th ACS National Meeting & Exposition, August 19-23, 2012, Philadelphia, Pennsylvania.",
  "Liu, R., R. Rallo, S. Shaw, Y. Cohen, “Nano-SAR development with application to regulatory decision making,” Nanomaterials in Medicine, Food and the Environment, 244th ACS National Meeting & Exposition, August 19-23, 2012, Philadelphia, Pennsylvania.",
  "Cohen, Y., “Membrane technology innovations,” in Water Technology Caucus, Update California Water 2013, Sacramento, CA, September 12, 2012.",
  "Cohen, Y., “Overview of Salinity Gradient Technology,” Invited Presentation, INES Workshop, Developing Salinity Gradient Power Technologies, Public Utilities Board (PUB), October 19, 2012, Singapore.",
  "Cohen, Y., P. D. Christofides, A. Rahardianto, B. McCool, H. Gu and L. Gao “Interstage Chemical Demineralization for High Recovery RO Desalination,” in session D: Brine and Sludge Treatment Towards ZLD, The 3rd Sde Boker Conference on Advanced Technologies in Water management, October 15-17, 2012.",
  "Cohen, Y., “Improving the efficiency of RO desalination through self-adaptive mitigation of membrane fouling and process optimization,” Invited Speaker, in Advanced Membrane Technology V: Membranes for Sustainable Water, Energy and the Environment, Engineering Conference International, October 14-19, 2012, Singapore.",
  "Surawanvijit, S., A. Rahardianto, J. Thompson and Y. Cohen, “Real-time Integrity Analysis of Reverse Osmosis Membranes,” 2012 Annual Fall Conference, CA-NV Section, American Water Works Association, October 8-11, 2012, San Diego, CA.",
  "Varin, K. J., N. Lin and Y. Cohen, “Fouling-Resistant, Surface-Nanostructured, Hydrophilic Membranes,” 2012 Annual Fall Conference, California-Nevada Section, American Water Works Association (AWWA), October 8-11, 2012, San Diego, CA.",
  "Cohen, Y., “Predictive Modeling for Health, with Material Characterization,” Invited Presentation, EU-US Joint Workshop: Bridging the NanoEHS Research Efforts, October 25-26, 2012, Helsinki, Finland.",
  "Yu, Z. L. T., A. Rahardianto, J. R. DeShazo, M. K. Stenstrom and Y. Cohen, “Regulatory Incentives and Impediments for Onsite Graywater Reuse in the United States,” 2012 Annual Fall Conference, California-Nevada Section, American Water Works Association (AWWA), October 8-11, 2012, San Diego, CA.",
  "Gao, L., H. Gu, A. Rahardianto, P. D. Christofides and Y. Cohen “Real-Time Operation and Control of Integrated Ultrafiltration-Reverse Osmosis Membrane Desalination System,” Session: Research Frontier of Water Sustainability, 2012 Annual AIChE Meeting, Oct. 28-Nov. 2, 2012, Pittsburgh, PA.",
  "Liu, R., H. Zhang, Z. Ji, R. Rallo, A. Nel and Y. Cohen, “Structure-Activity Relationship Predicted Toxicity Metric for Metal Oxide Nanoparticles,” Session:  Environmental Health and Safety (EHS) Concerns of Nanomaterials, 2012 Annual AIChE Meeting, Oct. 28-Nov. 2, 2012, Pittsburgh, PA.",
  "Gu, H., L. Gao, A. Rahardianto, P. D. Christofides and Y. Cohen “Self-Adaptive Operation of Ultrafiltration (UF)/Reverse Osmosis (RO) System for Desalination of Brackish Water and Coastal Seawater” Session: Emerging Processes for Water and Wastewater Treatment II, 2012 Annual AIChE Meeting, Oct. 28-Nov. 2, 2012, Pittsburgh, PA.",
  "Surawanvijit, S., J. Thompson, A. Rahardianto, V. Frenkel and Y. Cohen “A Molecular Marker Approach for Real-Time Characterization of RO Membrane Integrity,” session: Characterization and Simulation of Novel Membranes and Separations 2012 Annual AIChE Meeting, Oct. 28-Nov. 2, 2012, Pittsburgh, PA.",
  "Varin, K. J., N. Liu and Y. Cohen, “Biofouling and Cleaning Effectiveness of Surface Nanostructured, Reverse Osmosis Membranes,” Session: Membrane Surface Modification, 2012 Annual AIChE Meeting, Oct. 28-Nov. 2, 2012, Pittsburgh, PA.",
  "Innovation Complimentary to Industrial Needs, 2012 Annual AIChE Meeting, Oct. 28-Nov. 2, 2012, Pittsburgh, PA.",
  "Rahardianto, A., H. Gu, L. Gao, J. Thompson, P. D. Christofides and Y. Cohen, “Cooling Tower Wastewater Treatment and Reuse,” Session: Biomembrane & Water Management",
  "Liu, H. and Y. Cohen, “Multimedia Environmental Distribution of Nanomaterials,” Session: Environmental Implications of Nanomaterials: Fate and Transport, 2012 Annual AIChE Meeting, Oct. 28-Nov. 2, 2012, Pittsburgh, PA.",
  "Cohen, Y., “Experience in Desalinating Agricultural Brackish Water on Westside of Joaquin Valley,” Session: Desalination Technology Advances, The Central Valley Salinity and Nitrate Conference,” Nov. 15-16, 2012, Sacramento, California.",
  "Cohen, Y., “Salinity Management Research Needs Panel,” Invited Panel Member, Central Valley Salinity & Nitrate Conference: Advances in Salinity & Nitrate Research,” Nov. 15-16, 2012, Sacramento, California.",
  "Cohen, Y., Early Membrane Research and Development,” Invited Presentation, Session: Desalination Technology Advances, Central Valley Salinity & Nitrate Conference: Advances in Salinity & Nitrate Research,” Nov. 15-16, 2012, Sacramento, California.",
  "Cohen Y, H. Godwin, A. Nel “High-throughput screening: a transformative approach to nanotoxicology,” 2012 annual Meeting Society for Risk analysis, December 9-12, 2012, San Francisco, CA.",
  "Cohen Y, H. Liu, R. Liu, R. Rallo, H. Godwin, A. Nel, “Development of environmental impact assessment models for engineered nanomaterial,” in “Symposium: Ready for Prime Time? The Role of High Through-Put Screening in Risk Assessment for Engineered Nanomaterials,” 2012 annual Meeting Society for Risk analysis, December 9-12, 2012, San Francisco, CA.",
  "Cohen, Y., “Multimedia Environmental Distribution of Nanomaterials,” 2012 NSF Nanoscale Science and Engineering Grantees Conference, Dec. 3-4, 2012, Arlington, VA.",
  "Nel., A., A. Keller, H. Godwin, Y. Cohen, R. Nisbet “NSEC UC Center for Environmental Implications of Nanotechnology DBI-0830117,” (poster presentation), 2012 NSF Nanoscale Science and Engineering Grantees Conference, Dec. 3-4, 2012, Arlington, VA.",
  "Cohen, Y., “Energy Efficient RO Desalination,” Session: Energy and Sustainability, Invited Keynote Presentation,1st International Conference on Desalination using Membrane Technology, April 7-10, 2013, Sitges, Spain.",
  "Cohen, Y., “Environmental Decision Analysis for Nanomaterials, presented at the “UC CEIN Nano EHS Forum: Scientific Advances Toward Reducing Complexity in Nano EHS Decision Making,” May 8, 2013, Los Angeles, CA.",
  "Cohen, Y., “Nanoinformatics and Predictive data tools,” presented at the “UC CEIN Nano EHS Forum: Scientific Advances Toward Reducing Complexity in Nano EHS Decision Making,” May 8, 2013, Los Angeles, CA.",
  "R. Liu, R. Rallo, and Y. Cohen, Quantitative Structure-Activity-Relationships for Cellular Uptake of Nanoparticles. IEEE-NANO 2013, August 6, 2013, Beijing, China.",
  "Cohen, Y., “High Throughput Screening of Nanomaterials Toxicity,” invited presentation, MODENA (Modeling Nanomaterial Toxicity) Scientific Meeting - State of the Art in NanoSafety – An interdisciplinary Approach, August 5-7, 2013, Rome, Italy.",
  "Cohen, Y., “Smart Water Systems for Distributed Water Treatment,” invited presentation, Nitrate Treatment Technology workshop, State Water Resources Control Board (SWRCB) and the Department of Public Health (DPH), September 4-5, 2013, Sacramento, CA.",
  "Cohen, Y., “Regional Desalination of Brackish Groundwater via Distributed Smart Water Systems,” Invited Presentation, 29th Biennial Groundwater Conference & GRA 22nd annual Meeting, October 8-9, 2013, Sacramento, CA.",
  "Rahardianto, A., B. C. McCool, J. Faria and Y. Cohen, “Evaluation of RO Concentrate Treatment for High Recovery Desalting of High Salinity Inland Brackish Water (Paper 29c),” in Session: Water Sustainability and Integrated Water Resource Management, AIChE Annual Meeting, November 3-8, 2013, San Francisco, CA.",
  "Surawanvijit, S., J. Thompson, A. Rahardianto, Y. Cohen and V. Frenkel, Paper 430f, “A Molecular Marker Approach for Characterization of RO Membranes and Solute Transport in Spiral-Wound RO Membrane Systems,” in Session: Membranes for Water Treatment Applications, AIChE Annual Meeting, November 3-8, 2013, San Francisco, CA.",
  "Thompson, J. F., A. Rahardianto and Y. Cohen, paper 777e: “Real-Time Monitoring Approach and System for Early Detection and Characterization of RO Membrane Fouling,” in Session: Emerging Membrane Processes, AIChE Annual Meeting, November 3-8, 2013, San Francisco, CA.",
  "Lopilato, J., A. Rahardianto and Y. Cohen, “Reverse Osmosis Specific Energy (ROSE) Analysis Tool,” in Session: Synthesis and Design for Water Systems, AIChE Annual Meeting, November 3-8, 2013, San Francisco, CA.",
  "Gao, L., A. Rahardianto, H. Gu, P. D. Christofides and Y. Cohen, (364a) Energy-Optimal Control of an Integrated UF-RO Seawater Desalination Plant, in Session: Fundamentals of Water Processing Systems, AIChE Annual Meeting, Nov. 3-8, 2013, San Francisco, CA.",
  "Moses (Varin), K. J., and Y. Cohen, (625c) Surface Analysis and Biofouling Resistance of Nanostructured Reverse Osmosis Membranes, in Session: Membrane Surface Engineering I, AIChE Annual Meeting, November 3-8, 2013, San Francisco, CA.",
  "Liu, R., B. France, S. George, H. Zhang, T. Xia, A. E. Nel, K. Bradley, R. Rallo and Y. Cohen, (422e) Regulatory Association of Cell Responses Induced by Metal and Metal Oxide Nanoparticles, in Session: Environmental Health and Safety (EHS) Concerns of Nanomaterials, AIChE Annual Meeting, November 3-8, 2013, San Francisco, CA.",
  "Haven, H., R. Liu and Y. Cohen, (485a) Multimedia Environmental Distribution of Nanomaterials, in Session: Environmental Implications of Nanomaterials: Fate and Transport, AIChE Annual Meeting, November 3-8, 2013, San Francisco, CA.",
  "Yu, Z. L.T., A. Rahardianto, M. K. Stenstrom and Y. Cohen, in Session: Advanced Treatment for Water Reuse and Recycling II, AIChE Annual Mtg., Nov.3-8, 2013, San Francisco, CA.",
  "Gao, L., A. Rahardianto, H. Gu, P. D. Christofides, and Y. Cohen, “Energy-Optimal Control of an RO Seawater Desalination Plant,” in session Advances in NF and RO, North American Membrane Society, 24th Annual Meeting, May 31 - June 4, 2014, Houston, TX.",
  "Sagiv, A., R. Semiat, and Y. Cohen, “A Two-Dimensional CFD Model Analysis of Forward Osmosis,” in session Engineered Osmosis 1: Modeling of FO and PRO, North American Membrane Society, 24th Annual Meeting, May 31 - June 4, 2014, Houston, TX.",
  "Surawanvijit, S. and Y. Cohen, “Impact of Chemical Oxidation on Polyamide Reverse Osmosis Membrane Integrity,” in session Membrane formation and characterization, 24th Annual Meeting, North American Membrane Society, May 31 - June 4, 2014, Houston, TX; (Also, received 2nd Place poster Award).",
  "Cohen, Y., “Can Membranes Performance Be Improved with Polymer Brush Layers?”  Biomimetics and Biomimicry Workshop: Applications for Desalination, Singapore, organized by Environment & Water Industry Program Office and PUB Singapore’s National Water Agency May 31, 2014.",
  "Varin, K. and Y. Cohen, “Biofouling Resistant Surface Nanostructured Reverse Osmosis Membranes,” presented in session Novel Membranes and Membrane Processes for Desalination and Water Treatment, Division of Environmental Chemistry, 284th ACS National Meeting & Exposition, San Francisco, CA, August 10-14, 2014.",
  "Cohen, Y., Delivering Water from Source to Tap, Session: Membranes in the Future, “What to expect from membranes in the future,” invited presentation, Singapore Water Convention 2014, Singapore Water Week, June 1-4, 2014.",
  "Gao, L., A. Rahardianto, H. Gu, P. D. Christofides and Y. Cohen, “Direct Integration of RO Desalination and UF Pre-Treatment with RO Concentrate Backwash,” Session: Fund. of Water Processing Systems, AIChE Annual Mtg. Atlanta, GA, Nov.16-21 (2014).",
  "Haven, H., R. Liu, M. Bilal, A. Lazareva, A. Keller and Y. Cohen, “Nanoinformatics platform for assessing the potential environmental distribution and exposure levels of engineered nanomaterials (ENMs),” presented in session Assessing the Implications of Nanotechnology, ENVR: Division of Environmental Chemistry, 284th ACS National Meeting & Exposition, San Francisco, CA, August 10-14, 2014.",
  "Bilal, M., M. Romero, H. Liu, R. Liu and Cohen, “Probabilistic nanoinformatics modeling platform for assessing the potential environmental impact of engineered nanomaterials,” presented in session Assessing the Implications of Nanotechnology, ENVR: Division of Env. Chemistry, 284th ACS National Mtg, San Francisco, CA, August 10-14, 2014.",
  "Kim, S., “Surface nano-structuring with polymer brush layers for fouling resistant ultrafiltration (UF) membranes,” presented in session Reactive Membranes and Surfaces in Water Treatment Application, Division of Environmental Chemistry, 284th ACS National Meeting & Exposition, San Francisco, CA, August 10-14, 2014.",
  "Cohen, Y., Nanoinformatics Tools and Approaches, Invited Presentation Nanoinformatics, January 26-29, 2015, Arlington, VA.",
  "Rong Liu and Cohen, Y., “Quantitative Structure-Activity Relationships for Engineered Nanomaterials: Advances and Challenges,\" Nanoinformatics Workshop, January 26-29, Arlington, VA.",
  "Bacsafra, D., M. Bilal, M. Romero, H. Liu, R. Liu, and Y. Cohen, “\"Nanoinfo.org: An Integrated Nanoinformatics Web-Portal,” Nanoinformatics 2015 Workshop, January 26-29, 2015, Arlington, VA.",
  "Bilal, M., H. Liu, R. Liu and Y. Cohen, “Probabilistic Assessment of the Potential Environmental Impact of Engineered Nanomaterials,” Nanoinformatics 2015 Workshop, January 26-29, 2015, Arlington, VA.",
  "Cohen, Y., Co-Chair: Human Toxicity COR, Summary of Toxicity Modeling, Invited Presenter, EU-U.S.: Bridging NanoEHS Research Efforts a Joint Workshop, March 12-13, 2015, Venice, Italy.",
  "Cohen Y. and R. Liu, “Nanoinformatics Tools for Analysis and Modeling of Toxicity of Engineered Nanomaterial,” Invited Keynote, ASME 2015 4th Global Conference on Nano-Engineering for Medicine and Biology, Minneapolis, MN, April 19-22, 2015.",
  "Cohen, Y., “Intermedia and Multimedia Transport of Nanomaterials: Implications for Regional Exposures and Toxicity Studies,” Exposure Modeling, invited speaker, in workshop on “Implementing Environmentally-Relevant Exposures for Improved Interpretation of Laboratory Toxicology Studies of Manufactured and Engineered Nanomaterials (M&ENMs),” March 19-20, 2015, UCLA, Los Angeles, CA.",
  "Cohen, Y., “Nanoinformatics - Development and Integration of Computational Tools for Assessing the Environmental Impact of Engineered Nanomaterials,\" Invited Keynote, Gordon Research Conference on Environmental Nanotechnology, June 21-26, 2015, Mount Snow, West Dover, VT.",
  "Sagiv, A., P. Christofides, R. Semiat and Y. Cohen, “Modeling and Performance Analysis of Laboratory Forward Osmosis System,” North American Membrane Society (NAMS) Annual Meeting, May 30 – June 3, 2015, Boston, Massachusetts USA.",
  "Moses, K. J., S. Kim and Y. Cohen, “Impact of Hydrophilic Polymer Brush Layers on Biofouling Resistance of Polyamide Reverse Osmosis Membranes,” North American Membrane Society (NAMS) Annual Meeting, May 30 – June 3, 2015, Boston, Massachusetts USA.",
  "Rahardianto, A., H. Gu, Y. Cohen and P. D. Christofides, “Novel Design and Operational Control of Integrated Ultrafiltration – Reverse Osmosis System with RO Concentrate Backwash,” North American Membrane Society (NAMS) Annual Meeting, May 30 – June 3, 2015, Boston, Massachusetts USA.",
  "Cohen, Y., “Environmental Multimedia Distribution of Nanomaterials,” invited plenary speaker, in “QEEN Workshop: Quantifying Exposure to Engineered Nanomaterials (QEEN) from Manufactured Products,” SPSC and NNI, July 7-8, 2015, Arlington, VA.",
  "Gu, H., L. Gao, X. C. Pascual, A. Rahardianto, P. D. Christofides, Y. Cohen, “Field Evaluation of Fouling Quantification Soft Sensors for an Integrated UF-RO Desalination System,” in Session: S-21 Seawater Desalination: Fouling and Scaling, IDA World Congress on Desalination and Water Reuse, San Diego, CA, USA, August 30 – Sept. 4, 2015.",
  "Surawanvijit, S., J. Thompson, A. Rahardianto, V. S. Frenkel, Y. Cohen, “A Pulsed Marker Method for Membrane Integrity Monitoring and Evaluation of Membrane Degradation,” in session: S-08 Emerging Technologies: Research and Development, IDA World Congress on Desalination and Water Reuse, San Diego, CA, USA, August 30 - September 4, 2015.",
  "Liu, R., and Y. Cohen, “Prediction of Nanoparticles-Cell Association on Corona Proteins and Physicochemical Properties, in Session 527: Environmental Implications of Nanomaterials: Biological Interactions, AIChE Annual Meeting, November 8-13, 2015, Salt Lake City, UT.",
  "Cohen, Y., “Nanomaterials Fate Modeling,” Invited Plenary, Fourth Sustainable Nanotechnology Organization Conference, November 8 – 10, 2015, Portland, Oregon.",
  "Liu, H. H., J. Lanphere, S. L. Walker and Y. Cohen, “Agglomeration of Nanoparticles Evaluated Via a Constant Number Monte Carlo Simulation,” Paper 487b, in Session: Nanoscale Science and Engineering Forum, AIChE Annual Meeting, November 8-13, 2015, Salt Lake City, UT.",
  "Cohen, Y., A. Sagiv, P. D. Christofides and R. Semiat, Paper (653b) CFD Analysis of Transport in a Forward Osmosis System, in Session Modeling Transport in Membrane Processes, AIChE Annual Meeting, November 8-13, 2015, Salt Lake City, UT.",
  "Thompson, J. T., M. Bilal, A. Rahardianto, L. Gao, ad P. D. Christofides, “Real Time Monitoring of Membrane Mineral Scaling and Application to RO Plant Optimization,” invited presentation, in Honorary Session for Dibakar Bhattacharyya, AIChE Annual Meeting, November 8-13, 2015, Salt Lake City, UT.",
  "Gao, L., A. Rahardianto, H. Gu, P. D. Christofides and Y. Cohen, Paper (19b) Self-Adaptive Ultrafiltration with Optimal Coagulant Dosing, in Session on Fundamentals of Water Processing Systems, AIChE Annual Mtg., Nov. 8-13, 2015, Salt Lake City, UT.",
  "Varin, K., K. Soomin and Y. Cohen, paper (718c) Surface Nano-Structuring of Polysulfone UF Membrane Surfaces, in Session Advanced Surface Engineered Membranes, AIChE Annual Meeting, November 8-13, 2015, Salt Lake City, UT.",
  "Rahardianto, A., S. Surawanvijit and Y. Cohen, paper (324a) Membrane Integrity Monitoring in Multi-Element Spiral-Wound RO/NF Plant, in Session Advanced Treatment for Water Reuse and Recycling, AIChE Annual Mtg., Nov. 8-13, 2015, Salt Lake City, UT.",
  "Sagiv, A., P. D. Christofides, R. Semiat and Y. Cohen, CFD Analysis of Transport in a Forward Osmosis System, in Session Modeling Transport in Membrane Processes, AIChE Annual Meeting, November 8-13, 2015, Salt Lake City, UT.",
  "Varin, K. and Y. Cohen, paper (478e) Synthesis, Characterization and Performance of Polyamide Membranes Structured with Hydrophilic Polymeric Brush Layers, in Session Membranes for Water Treatment Applications I, AIChE Annual Meeting, November 8-13, 2015, Salt Lake City, UT.",
  "Cohen, Y., Water Governance and Technology: Challenges and Opportunities in California, invited presentation, in Session California and Israel: The Water - Energy Nexus, 5th International Conference on Water Technologies & Environmental Control (WATEC), October 13-15, 2015, Tel-Aviv, Israel.",
  "Cohen, Y., Nanomaterials Fate Modeling, invited plenary,5th Sustainable Nanotechnology Organization Conference 2016, November 7-10, 2015, Portland, Oregon.",
  "Cohen, Y., Invited Keynote, “Membrane technology for water purification, desalination and in energy production: Current status and challenges,” ACS National Meeting, March 13-17, 2016, San Diego, CA.",
  "Cohen, Y., “Distributed Water Systems”: in Conference on Smart and Sustainable Cities, May 19, 2016, Los Angeles, CA.",
  "Cohen, Y. “Water Sustainability for California,” Statewide Water Reuse Forum, Governor Edmund G. Brown Jr.’s Office of Planning and Research, September 16, 2016.",
  "Cohen, Y., “SMART groundwater treatment, remediation and residual management,” in Legislative/UCLA Workshop on Environment and Sustainability: Applying Environmental and Sustainability Research, October 21, 2016, UCLA, Los Angeles, CA.",
  "Cohen, Y., Paper 154b, “Advances and Challenges in Membrane Desalination and Osmotic Power Generation,” invited talk, in Session 154 Honorary Session for Georges Belfort I, 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Cohen, Y., A. Rahardianto, H. Gu, L. Gao and P. D. Christofides Paper 418b, invited talk, Self-Adaptive Water Treatment and Desalination of Source Water of Variable Feed Quality, in Session 418 - Membranes for High TDS Waters and Difficult Separations, 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Kim, S. and Y. Cohen, paper 499b, Surface Characterization of Membrane Surfaces Nanostructured with Tethered Hydrophilic Polymers, in session 499 Surface Engineered and Responsive Membranes, 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Lee, T., A. Rahardianto and Y. Cohen, Paper 562c, Flexible and Low-Energy Approach for RO Desalination, in session 562 Advances in Fluid Particle Separation in Energy, Water, and Environmental Systems, 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Rong Liu, H. Haven Liu, Zhaoxia Ji, Chong H Chang, Tian Xia, Andre E. Nel and Yoram Cohen, Paper 584b:  In-Vitro Dosimetry Model for Toxicity Ranking of Metal Oxide Nanoparticles, in session 584 - Environmental Implications of Nanomaterials: Biological Interactions, 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Gu, H., A. Rahardianto, L. Gao, P. D. Christofides and Y. Cohen, Paper 647b:  Self-Generated RO Concentrate Pulse Backwash of Ultrafiltration Module in an Integrated Seawater Desalination UF-RO Pilot Plant, in Session 647- Membranes for Water Treatment, Reuse, and Desalination III, 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Bilal, M., H. H. Liu, R. Liu and Y. Cohen, Paper 135e: Causal Analysis of the Environmental Distribution of Engineered Nanomaterials Using Bayesian Networks, in Session 135 Big Data and Sustainability, 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Bilal, M., R. Liu, E. Oh, I. Medintz and Y. Cohen, Poster 235bw, Meta-Analysis of Cellular Toxicity of Cadmium-Containing Quantum Dots Using Bayesian Networks, in Poster Session 253: Computational Molecular Science and Engineering Forum (CoMSEF), 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Gao, L., H. Gu, A. Rahardianto, P. D. Christofides and Y. Cohen, Paper 454b Optimization of UF Backwash with Real-Time Control of Coagulant Dosing, in Session 454 Advanced Treatment for Water Reuse and Recycling I, 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Rahardianto, A., T. Lee and Y. Cohen, Paper 538b On the Operational Flexibility of Process Systems for Membrane-Based Water Treatment and Desalination, in Session 538 Membranes for Water Treatment, Reuse, and Desalination II, 2016 AIChE Annual Meeting, November 13-16, 2016, San Francisco, CA.",
  "Cohen, Y., “Smart distributed water treatment systems - Advances and Research Needs,” Invited Plenary Speaker, U.S. Department of Energy, 2017 Basic Research Needs Water Workshop, Bethesda, Maryland, January 4-6, 2017.",
  "Cohen, Y., Invited Presentation, “Smart Membrane Based Water Treatment and Desalination,” The 8th Eastern Mediterranean Chemical Engineering Conference (EMCC8), February 26 – March 1, 2017, Haifa, Israel.",
  "Cohen, Y., Invited Presentation, “Smart Distributed Water Treatment & Desalination Systems: advances and Research Needs,” Basic Research Needs for the Energy-Water Nexus: New Approaches to Ensure Robust and Secure Energy, DOE Workshop, Bethesda, Maryland, January 4-6 (2017).",
  "Bilal, M., P. Church, H. Liu, R. Liu, Y. Cohen, “Nanoinformatics platform for environmental impact assessment of engineered nanomaterials,” Session on Advanced Materials: Issues in Nanoinformatics & NanoSafety Data, 253rd American Chemical Society National Meeting, April 2-6 (2017), San Francisco, CA.",
  "Church, P., M. Bilal, R. Liu and Y. Cohen, “Flexible database management system for nanoinformatics research and data integration,” Session on Session on Advanced Materials: Issues in Nanoinformatics & NanoSafety Data, American Chemical Society National Meeting, April 2-6 (2017), San Francisco, CA.",
  "Cohen, Y., Invited Keynote, “Self-adaptive RO desalination: Advances and Challenges,” 3rd International Conference on Desalination Using Membrane Technology, April 2-5, 2017, Gran Canaria, Spain.",
  "Coen, Y., “Advances in Water Treatment and Desalination Technology in Israel: Regional Global Benefits and Challenges, “Water in Israel and the Middle East – 2nd Annual Symposium, Northwestern Center for Water Research, Northwestern University, Evanston, Illinois, May 24, 2017, NO",
  "Cohen, Y., “Early Detection of Silica in Membrane Systems,” 26th Annual Southwest Chemistry Workshop, June 19 – 22, 2017, Santa Fe, NM.",
  "Cohen, Y., “The Challenges and Future of Membranes in Water Treatment and Desalination Technologies,” Invited Presentation, 2017 Clean Water Technology Workshop, U.S. Department of Energy, July 10-11, 2017, TX.",
  "Cohen, Y. “The Regional Influence of Israel’s Water and Energy Resources,” 33rd Annual Mtg., The Association for Israel Studies, A Century After Balfour: Vision and Reality, Schusterman Center for Israel Studies, Brandeis Univ., Waltham, Ma, June 12-14, 2017.",
  "Cohen, Y., J. Choi, M. Kennedy and M. Glickfeld, “RO Technology for Nitrate Removal from Impaired Groundwater of Remote and Disadvantaged Communities,” Greater Monterey County IRWM Regional Water Management Group, Monterey County Water Resources Agency, Salinas, CA, June 26, 2017.",
  "Cohen, Y., Invited Talk, “The Challenges and Future of Membranes in Water Treatment and Desalination Technologies,” U.S. DOE Advanced Manufacturing Office, Clean Water: Technical Challenges & Opportunities Workshop, July 10-11, 2017.",
  "Cohen, Y., “Nanoinformatics platform for environmental impact assessment of manufactured nanomaterials,” Invited Presentation, Herman Skolnik Award Symposium, Division of Chemical Information, 254th ACS National Meeting in Washington, DC, August 20-24, 2017.",
  "Zhang, Y, J., Y. Cohen. S. Kim, A. Rahardianto, \"Nano-Structuring of UF and RO Membranes with Hydrophilic Polymers – Scalability of Membrane Synthesis via Atmospheric Pressure Plasma-Induced Graft Polymerization,\" in Session 399: Environmental Implications of Nanomaterials: Biological Interactions, 2017 AIChE Annual Meeting, 10/29/2017-11/03/2017, Minneapolis, MN.",
  "Cohen, Y., J. Thompson. A. Rahardianto and M. Bilal, Silica Scaling of RO Membranes – Real Time Detection and Scaling Kinetics, in Session 399: Poster Session: General Topics on Separations, 2017 AIChE Annual Meeting, 10/29/2017-11/03/2017, Minneapolis, MN.",
  "Cohen, Y., M. Bilal and R. Liu, Association Rule Mining for Assessing the Relationships Among Biological Responses of Embryonic Zebrafish, in Session 353: Environmental Implications of Nanomaterials: Biological Interactions, 2017 AIChE Annual Meeting, 10/29/2017-11/03/2017, Minneapolis, MN.",
  "Cohen, Y., A. Rahardianto, S. Kim and J. Zhang Scale up of RO and UF Membrane Surface Nano-Structuring with Hydrophilic Polymer Brush Layers - Evaluation of Uniformity of Membrane Performance, in Session 514: Water Treatment, Desalination, and Reuse I, 2017 AIChE Annual Meeting, 10/29/2017-11/03/2017, Minneapolis, MN.",
  "A. Rahardianto and Y. Cohen, Overcoming Operating Pressure Barrier in High Recovery Membrane Desalination via Hybrid RO-NF Processes, Session 580: Water Treatment, Desalination & Reuse II, 2017 AIChE Meeting, 10/29/2017-11/03/2017, Minneapolis, MN.",
  "Cohen, Y., Salinas Valley Distributed Water Treatment Project, Invited Speaker, 2017 Safe Drinking Water Workshop, Water Replenishment District, 11/7/2017, Lakewood, CA",
  "Lee. T., Y. Cohen and A. Rahardianto, Application of Semi-Batch RO Operation for Water Purification in Small Communities, in Session 655: Community-Based Water Treatment Innovations, 2017 AIChE Annual Mtg., 10/29/2017-11/03/2017, Minneapolis, MN.",
  "Cohen, Y., A. Rahardianto and J. Yong-Choi, Salt Harvesting of Reverse Osmosis Concentrate by Continuous Chemically-Enhanced Seeded Precipitation, in Session 460: Advanced Treatment for Water Reuse and Recycling, 2017 AIChE Annual Meeting, 10/29/2017-11/03/2017, Minneapolis, MN.",
  "Zha, S., S. Kim, A. Rahardianto and Y. Cohen, Scale up of Synthesis Seawater Reverse Osmosis Membranes with Surface Nano-Structured Hydrophilic Polymer Brush Layers, in Session Membranes for Water Treatment -1: Desalination, 2018 North American Membrane Society Meeting, Lexington, KY, June 9-13, 2018.",
  "Cohen Y., T. Lee and A. Rahardianto, Impact of Intermittent Feed Water Flushing on Surface Mineral Scaling during SEMI-Batch Reverse Osmosis Operation, in Session Membranes for Water Treatment -1: Desalination, 2018 North American Membrane Society Meeting, Lexington, KY, June 9-13, 2018.",
  "Cohen, Y., A. Rahardianto and P. D. Christofides, Field Pilot-Testing of Self-Adaptive Brackish Water Desalination System for Agricultural Drainage Water Desalination, Large-Scale Membrane Applications (User and Manufacturer Interactions), 2018 North American Membrane Society Meeting, Lexington, KY, June 9-13, 2018.",
  "Cohen, Y., Paper 288a, Intelligent RO Systems: Advances and Challenges, paper 288, Session in 288Honor of Neal Chung II: Liquid Separation, AIChE Annual Meeting, Pittsburgh, PA, October 28 – November 2, 2018.",
  "Yong-Choi, J., A. Aleidan, Y. Chen, A. Rahardianto, M. Glickfeld, M. Kennedy and Y. Cohen, RO Denitrification and Desalting of Impaired Brackish Water in Remote Communities, in Session 212b “Community-Based Water Treatment Innovations,” AIChE Annual Meeting, Pittsburgh, PA, October 28 – November 2, 2018.",
  "Cohen, Y., High Performance Surface Nano-structured RO Membranes, Invited Presentation, Water Treatment Working Group, U.S. Army, Webinar, May 22, 2018.",
  "Bilal, M., Y. Cohen, M. Romero-Franco and H. Godwin, Paper 338a- A Framework for Assessing the Adequacy of Information for Environmental Impact Assessment of Engineered Nanomaterial, in Session 338, Environmental Implications of Nanomaterials: Biological Interactions, AIChE Annual Meeting, Pittsburgh, PA, Oct. 28 – Nov. 2, 2018.",
  "Kim, S., Cohen, Y., Chen, Y., Rahardianto, A., Zha, S., Paper 686c, Surface Nano-Structuring with Hydrophilic Polymer Brush Layers for Tailored Performance of Fouling Resistant RO and UF Membranes, Session 686, Water Treatment, Desalination, and Reuse I, AIChE Annual Mtg., Pittsburgh, PA, Oct. 28 – Nov. 2, 2018.",
  "Lee, T., A. Rahardianto and Y. Cohen, Paper 727a, Membrane Mineral Scaling in Semi-Batch and Steady State Reverse Osmosis Desalination - a Comparative Study, in Session 727, Water Treatment, Desalination, and Reuse II, AIChE Annual Meeting, Pittsburgh, PA, October 28 – November 2, 2018.",
  "Cohen, Y., “The Facts Regarding Membranes as a Barrier for Pathogens: Successes and Limitations,” Invited Lecture, Workshop W11: Membranes for Water Reuse: Past, Present, Future”, 2018 Water Env. Federation, Sept. 29 – Oct 3, 2018, New Orleans, Louisiana.",
  "Cohen, Y., “Intelligent Water Systems for Distributed Industrial and Agricultural Water Treatment and Reuse,” Invited Speaker, in AIChE Workshop on Industrial Water Use and Reuse Workshop 2018, San Antonio, Texas, USA, November 15-16, 2018,",
  "Cohen, Y., Invited Keynote Speaker, Treatment of Impaired Groundwater in Small Remote Communities, Distributed Membrane-Based Systems for Water Reuse, 5th International Specialized Conferences on Small Water and Wastewater Systems, International Water Association (IWA), Haifa, Israel, October 14-18, 2018.",
  "Cohen, Y., “Rejuvenating Our Freshwater Supplies,” Invited Speaker, in Session: Preserving Freshwater and Protecting Marine Environments, 25th International Conference on the Unity of the Sciences, Environmental Health and the Quality of Human Life, February 12–14, 2019, Seoul, Korea.",
  "Chen, Y., S. Kim, R. Rahardianto and Y. Cohen, “Surface Nano-structuring with Hydrophilic Polymer Brush Layers for Membrane Performance Tailoring and Optimization,” presented in Session 227: “Materials: Advances in Membrane and Materials Characterization,” NAMS 28th Annual Meeting, Pittsburgh, PA, May 11-15, 2019.",
  "Kim, Y., R. A. Rahardianto and T. Lee, “RO Mineral Scale Mitigation via Self-Adaptive Feed-Flow Reversal,” presented in session 1: “Processes: Fundamentals of Predicting and Preventing Membrane Fouling,” North American Membrane Society 28th Annual Meeting, Pittsburgh, PA, May 11-15, 2019.",
  "Cohen, Y., Invited Plenary, “Water Treatment and Desalination: From High Performance Membranes to Flexible Self-Adaptive Systems,” invited presentation, Session: Division Plenary: Gerhold and Kunesh Awards on Separations, Annual 2019 AIChE Annual Meeting, Pittsburgh, PA, November 15-19, 2019, Orlando, FL. (Also listed in Invited Lectures and Seminar, #182).",
  "Madelyn Glickfeld and Yoram Cohen, “Distributed Water Treatment Systems for Disadvantaged Communities,” Environmental Justice Board Item Coordination Meeting, Central Coast Water Board Meeting on January 30, 2020, San Luis Obispo, CA.",
  "Cohen, Y., “NanoDataBank: Data Management System for Nanomatrials,” NanoInformatix Workshop, Invited Presentation, Athens, Greece, Greece, February 26-27, 2020.",
  "Chen, Y., S. Kim and Y. Cohen, “Tuning Ultrafiltration Membrane Performance via Surface Graft Polymerization of Acrylic Acid Enabled by Air Plasma Activation,” in session 13: Microporous and Catalytic Materials, NAMS, May 18-21, 2020.",
  "Chen, Y. and Y. Cohen, Surface Nano-Structuring with Tethered Poly(Acrylic acid) Chains for Tuning Ultrafiltration Membrane Performance,” Poster Presentation (#22), Poster Session, NAMS, May 18-21, 2020.",
  "Cohen, Y., Invited Speaker/Panelist, “Water Use and Water Scarcity in the Middle East: The Impact of Technology and Cooperation Opportunities,\" Phoenix Project Panel/Webinar, CA, September 30, 2020.",
  "Cohen, Y., Invited Panelist/Online, “UD College of Engineering Virtual Career Panel,” University of Delaware, September 30, 2020.",
  "Cohen, Y., J. Yong Choi, T. Lee, Y. Chen, A. Rahardianto, (666c) RO Treatment of Small Community Wellhead Water for Contaminant Removal and Salinity Reduction, 2020 Virtual AIChE Annual Meeting (ISBN: 978-0-8169-1114-1).",
  "Z. Yang, B. Khan, H. Gu and Y. Cohen, (701d) Operational Improvements of Ultrafiltration Treatment of RO Feedwater Driven by Neural Network Models of UF Fouling and Backwash, 2020 Virtual AIChE Annual Meeting (ISBN: 978-0-8169-1114-1).",
  "B. Khan, J-Y Choi, A. Rahardianto, Z. Yang, and Y. Cohen, (339n) “Machine Learning Models for Water Use Patterns Analysis in Small Rural Agricultural Communities for Informed Design and Deployment of Membrane-Based Water System,” 2020 Virtual AIChE Annual Meeting (ISBN: 978-0-8169-1114-1).",
  "Cohen, Y., S. Kim, A. Rahardianto, and Y. Chen, (386f) “Spiral-Wound RO Elements Performance Tuning with Surface Nano-Structured Polyamide TFC Membranes,” 2020 Virtual AIChE Annual Meeting (ISBN: 978-0-8169-1114-1).",
  "Cohen, Y., S. Kim and Y. Chen, “Spiral-wound RO elements performance tuning with surface nano-structuring of polyamide TFC membranes,” Session 6B-3D, 12 Int. Congress on Membranes and Membrane Processes, 7-11, Dec. 2020 (online: Live and on-demand).",
  "Cohen, Y., Y. Kim and A. Rahardianto, “Reduction of applied pressure in high recovery RO/NF desalting,” Session 13C - RO 2, 12 International Congress on Membranes and Membrane Processes, 7-11, December 2020 (online: Live and on-demand).",
  "Zhou, Y., B. Khan, J-Yong Choi, and Yoram Cohen, Flexible small RO systems for distributed water purification and desalination, Poster session 2, 12 Int.Congress on Membranes and Membrane Processes, 7-11, December 2020.",
  "Cohen, Y., Y. Zhou, M. Bilal, H. Gu, 6b “Neural Network Model with Evolutionary Algorithm and Bayesian Binary Classification of UF Performance in Pretreatment of Seawater RO Feedwater,” Environmental Applications, 30th Annual Meeting, North American Membrane society, Estes Park, Colorado, 8/28/-9/3/2021.",
  "Chen, Y., S. Kim, Y. Kim, Y. Cohen, 23b “Scale-up of High-Performance Surface Nano-Structured Reverse Osmosis TFC Membranes,” in Osmotic Processes (RO/FO/PRO) II, 30th Annual Meeting, North American Membrane society, Estes Park, CO, 3/28/2021.",
  "Cohen, Y., J-Y Choi, F. Kaufmann, 280b “High Recovery Inland Water RO Desalination Via Integration with Continuous Chemically-Enhanced Seeded Precipitation (CCESP),” 2021 AIChE Annual Meeting, November 7-19, Boston, MA.",
  "Z. Yang, B. Khan, H. Gu and Y. Cohen, 534f “Modeling UF Performance in Pretreatment of Seawater RO Feedwater Using Neural Network with Evolutionary Algorithm and Bayesian Binary Classification,” 2021 AIChE Annual Meeting, 11/7-19/2021, Boston, MA.",
  "Zhou, Y., B. Khan, J-Yong Choi, and Yoram Cohen, 749a “Exploration and Forecasting of Water Usage for Treatment Process Development in Small Disadvantaged Agricultural Communities,” 2021 AIChE Annual Meeting, November 7-19, 2021, Boston, MA.",
  "Chen, Y. and Y. Cohen, 619c “High Performance Surface Nano-Structured Reverse Osmosis Membranes for Seawater and Brackish Water Desalination,” AIChE Annual Meeting, November 7-19, 2021, Boston, MA.",
  "Cohen, Y., “Faculty Experience in Integrating Social Impact and Ethics into Engineering Courses, “Winter 2022 Engineering Faculty workshop: Including Social Impact in Engineering and Computer Science Courses, Henry Samueli School of Engineering and Applied Science, University of California, Los Angeles, March 4, 2022.",
  "Zhou, Y., B. Khan, N. Marki and Y. Cohen, “Modeling RO System Water Treatment Operation for Nitrate and Salt Removal Using Long-Short Term Memory (LSTM) Machine Learning Model with Attention Coefficient,” North American Membrane Society Meeting, 31st annual Meeting, May 14-18, 2022, Tempe, Arizona.",
  "Cohen, Y., “Hybrid RO-NF for reduced applied pressure requirement in high recovery water treatment and desalination,” Session 3, “Nanofiltration Applications I: Water Treatment,”, Nanofiltration 2022: Principles, Applications and New Materials, June 26-30, 2022 – Achem, Reutlingen, Germany.",
  "Cohen, Y., Invited Speaker, “Autonomous Optimal Operation of Distributed Membrane-Based Water Treatment and Desalination Systems,” in Session “Desalination: Old Concepts, New Horizons,” Int.Water Summit, Ben-Gurion University, May 22-23, 2022.",
  "Rao., P., Y. Cohen and B. Khan, “Analytics for Causal Analysis and Decision Support Models for Autonomous and Smart Water Treatment,” in Topic Area: AOI A-3, National Alliance for Water Innovation (NAWI) Spring Meeting, May 3, 2022.",
  "Cohen, Y., Invited Proposer, in Segment 4: Fouling, the Future of Desalination – International Conference, September 11 – 13, 2022, Riyadh, Saudi Arabia.",
  "Cohen, Y., “Autonomous Membrane-Based Water Treatment and Desalination,” 13th World Filtration Congress, San Diego, CA, October 5-9, 2022.",
  "Cohen, Y., Invited Speaker, “Environmental Impact Assessment of Engineering Nanomaterials: Integration of Models, Data and the Body of Evidence for Decision-Support,” in Nanoinformatics: Spanning Scales, Systems and Solutions, Beilstein Nanotechnology Symposium 2022, October 11 – 13, 2022, Rüdesheim, Germany",
  "Zhou, Y., N. Marki, B. Khan and Y. Cohen, “Process Modeling of Intermittent Wellhead RO Water Treatment Operation Via Integration of Self-Organizing Maps and Long Short-Term Memory Recurrent Neural Network (RNN),” in Session 469 - Water Treatment, Desalination, and Reuse II, AIChE Annual Meeting, Nov. 13-18, 2022, Phoenix, Arizona.",
  "Cohen, Y. and B. Khan, “Association Rule Mining of the Relationships Among Biological Responses of Embryonic Zebrafish Exposed to Nanoparticles,” in Session 510 - Nanoscale Science and Eng. Forum II, AIChE Annual Meeting, Nov. 13-18, 2022, Phoenix, AZ.",
  "Cohen, Y., B. Khan, C. Aguilar, M. Rogers, Y. Zhou, N. Marki, “Remote Monitoring, Supervisory Control and Technoeconomic Evaluation of Advanced High Recovery Wellhead Water Purification and Desalination Systems,” Env. Div. Poster Session 533, AIChE Annual Meeting (2022), November 13-18, 2022, Phoenix, Arizona.",
  "Chen, Y. and Y. Cohen, “RO Membranes with Surface Tethered Poly(acrylic acid) Chains for Low Fouling, Ease of Cleaning, Selective Removal and Hydraulic Permeability and Salt Rejection Tunability,” in Session 678 - Surface Engineered and Responsive Membranes, AIChE Annual Meeting, Nov.13-18, 2022, Phoenix, Arizona.",
  "Rao., P., Y. Cohen and B. Khan, “Analytics for Causal Analysis and Decision Support Models for Autonomous and Smart Water Treatment,” Topic Area: AOI A-3, National Alliance for Water Innovation (NAWI), Annual Meeting, February 27-29, 2023",
  "Zhou, Y., N. Marki, C. Aguilar, K. L. Yip, B. Khan and Y. Cohen, “Machine Learning Modeling of Intermittent Reverse Osmosis Desalination System Operation via Transfer Learning and Long Short-term Memory,” paper 94 in Session “Molecular and Process Modeling,” North American Membrane Society, 32nd Annual Meeting, May 13-17, 2023, Tuscaloosa, AL",
  "Marki, N., Y. Zhou, K. L. Yip, C. Aguilar, Y. Jarma, B. Khan and Y. Cohen, “Nitrate and Salt Transport Coefficients Determination for Spiral-Wound RO Membranes Derived from Field Data of Treatment of Impaired Brackish Groundwater,” Paper 56 in Session “Desalination and Osmotic Processes,” North American Membrane Society, 32nd Annual Meeting, May 13-17, 2023, Tuscaloosa, AL.",
  "Jarma, Y., B. Akhavain, and Y. Cohen, “Flexible operation of RO desalting in the mode of partial concentrate recycle, “ Poster 7, presented at the North American Membrane Society, 32nd Annual Meeting, May 13-17, 2023, Tuscaloosa, AL",
  "Cohen, Y., Marki, N., Y. Zhou, K. L. Yip, C. Aguilar, Y. Jarma, B. Khan, “Analysis of Nitrate and Salt Passage Based on Extensive Field Data of RO Purification and Desalination of Impaired Brackish Groundwater,” 13th International Congress on Membranes and Membrane Processes, July 9-14, 2023, Chiba, Japan."
]